[
{"author": ["Norbert"], "content": ["Definitely one of the best hotels in Guayaquil, when I go to Ecuador on vacation I only prefer to stay there for the quality and service, especially the attenti", "..."]},
{"author": ["Walter524"], "content": ["I fully agree with previous reviews. Gundi is the perfect host, takes care about your needs  and arranges  tours at your convenience. The breakfast is very tast", "..."]},
{"author": ["Walter524"], "content": ["Excellent Boutique Hotel. Stayed 4 nights in October, inside room very quiet, clean and comfortable. Very helpful and friendly staff arranging English speaking ", "..."]},
{"author": ["Walter524"], "content": ["Stayed 3 nights in October 2014. Big apartment, clean, quiet. Helpful staff. Taxi ride to center approx. 10 minutes for 3 dollars. Really, a valid alternative t", "..."]},
{"author": ["Robin W"], "content": ["Comfortable rooms with great ensuite facilities. Very nice lounge areas on all floors. Decent city views. Great breakfast with fresh eggs, coffee refills, hot c", "..."]},
{"author": ["georgiax21"], "content": ["Beautiful & delicious homemade cakes. Freshly prepared sandwiches,salads, & juice. Great coffee, with fantastic views of the ancient amphitheatre and acropolis ", "..."]},
{"author": ["georgiax21"], "content": ["The bathroom (which was a shack in the corner of our room without a roof, and sack material to cover the glass sides for privacy) was filthy dirty, as was the b", "..."]},
{"author": ["georgiax21"], "content": ["We arrived hours before check in after a long travel. Annette @ the reception desk was extremely helpful and friendly and went above and beyond and gave us a ro", "..."]},
{"author": ["georgiax21"], "content": ["We arrived early hours of the morning to this hostel. The door was closed and lights off, we rang the bell with no luck. The property advertises 24 hour recepti", "..."]},
{"author": ["georgiax21"], "content": ["Riad Zinoun was great value, so when we booked we really didn't know what to expect. On arrival we were greeted by friendly faces, mint tea and cookies. The Ria", "..."]},
{"author": ["georgiax21"], "content": ["Delicious REAL Moroccan food. Incredible value. The two of us ate for under £8 for a main meal side orders and drinks on three separate occasions. The staff wer", "..."]},
{"author": ["georgiax21"], "content": ["I've been using this pub since I was a child. I've never had a bad meal there. The menu is extensive with anything from homey pies, to pasta, or fresh fish. The", "..."]},
{"author": ["georgiax21"], "content": ["Big menu, delicious home cooked food. Friendly and competent staff. Excellent value. What more do you need? "]},
{"author": ["georgiax21"], "content": ["My husband and I stayed in the B&B cottage for a weekend for a friends wedding. It was spacious, clean & comfortable with a well kept garden and patio area. W", "..."]},
{"author": ["georgiax21"], "content": ["My husband and I stayed in the B&B cottage for a weekend for a friends wedding. It was spacious, clean & comfortable with a well kept garden and patio area. W", "..."]},
{"author": ["georgiax21"], "content": ["We have lived in Lindos for two years permenantly, and visited before that. We have always eaten at Dionysos, the food staff/service has never let us down! DELI", "..."]},
{"author": ["georgiax21"], "content": ["Ive been visiting Lindos since 2008, and have lived here full time for the last two years. any given chance i get, i eat at Arhontiko. the food is to die for, t", "..."]},
{"author": ["Endurorider200"], "content": ["Es sitio es sencillo, acogedor y con una linda decoración azul agua marina y blanco. La atención es excelente, puedes probar todoos los sabores de helado que qu", "..."]},
{"author": ["Endurorider200"], "content": ["I stayed at the hotel with my girlfriend. Both of us were new in Guayaquil and had the chance to visit the Malecón in the short visit. The location for this is ", "..."]},
{"author": ["Endurorider200"], "content": ["Servicio (5/5)El sitio es Pet Friendly y reciben a tu mascota con mucha amabilidad y cariño. Los meseros atienden las necesidades con amabilidad y su actitud a", "..."]},
{"author": ["Endurorider200"], "content": ["La visita que realicé con mi pareja fue algo no planeado durante el viernes de plena feria de Cali. Llegamos sin reserva y la administradora logró acomodarnos d", "..."]},
{"author": ["Endurorider200"], "content": ["Realicé dos visitas al sitio. Un viernes en la noche y un sábado en la mañana.Comida (1/5)- En la primer visita ordenamos salmón, langostinos y carne. Solo r", "..."]},
{"author": ["Endurorider200"], "content": ["Comida (4/5):Les recomiendo visitar el sitio de lunes a jueves, hay 2x1 en comidas y alitas. El sabor de la comida es bueno, las alitas son sencillas sin embar", "..."]},
{"author": ["Endurorider200"], "content": ["No voy a hablar del sitio, he escuchado que es algo agradable, sin embargo no he ido personalmente. De todas formas el pedido que hice a domicilio me dejó sin g", "..."]},
{"author": ["Endurorider200"], "content": ["Estuve de pasada únicamente. Subimos en carro hasta el alto donde se encuentran los miradores. Subimos por las escaleras hasta llegar a la cima donde puedes ver", "..."]},
{"author": ["Endurorider200"], "content": ["Estuvimos una tarde completa en todo el circuito del spa. Lo mejor son laa cavernas con agua caliente y fria, es un lugar romántico para ir en pareja. Las pisci", "..."]},
{"author": ["Endurorider200"]},
{"author": ["Endurorider200"], "content": ["Personally one of my favourite sites in Villa de Leyva. You can spend a nice afternoon drinking good wine with cheese, salami and bread for a reasonable Price. ", "..."]},
{"author": ["Endurorider200"], "content": ["During my visit there was a Tree Festival. The whole square was full of trees and flowers form local sellers. Aditionally there were musical exhibition of local", "..."]},
{"author": ["Endurorider200"], "content": ["Comida (4/5):- Excelentes Sandwiches, muy buena mayonesa de la casa y selección de carnes. La porción es un poco pequeña para el precio.Precios(3/5):- A pes", "..."]},
{"author": ["Endurorider200"], "content": ["Comida (5/5)- Estuve desyunando wn horas de la mañana. Deben prpbar el quiche de mostaza y tomate (si les gustan los sabores fuertes). El pan de chocolate y cr", "..."]},
{"author": ["Endurorider200"], "content": ["Comida (3/5)Tal vez debí probar los Waffles dulces, sin embargo mi opinión aplica para los desayunos. Buen sabor de la comida, los waffles son normales y los o", "..."]},
{"author": ["Endurorider200"], "content": ["Comida (5/5)- Sopa de Cebolla exquisita. La tortilla de los crepes definitivamente se roba el show. Creme brulee increible.Precio (4/5)- Precios razonables ", "..."]},
{"author": ["Endurorider200"], "content": ["Comida (3/5)- Fue la primer vez que como Cuy y comida típica ecuatoriana. Realmente no tengo punto de comparación válido, sin embargo me pareció una comida sim", "..."]},
{"author": ["Endurorider200"], "content": ["Es un restaurante pequeño, donde debes reservar ya que hacen la comida justa para la hora del almuerzo. Llegamos a las 3pm sin reserva y a pesar de esto el serv", "..."]},
{"author": ["Endurorider200"], "content": ["Diferente no siempre significa malo. Este es el caso de la Casa Terracota. En medio del desierto encuentras esta casa de barro en la que pagas $10.000 y entras ", "..."]},
{"author": ["Endurorider200"], "content": ["El sitio es simple. Hay un segmento del fósil de un Kronosaurio de aproximadamente 7 metros. Pagas $8.000 por persona para ingresar al \"museo\". Pongo la palabra", "..."]},
{"author": ["El_Gringo_Montana"], "content": ["When I showed up to check into Kreutzwald, I was welcomed with the good news that my room had been upgraded to a suite, free of charge! The bed was so comfortab", "..."]},
{"author": ["El_Gringo_Montana"], "content": ["Chescos is certainly one of the better hostels I've stayed at in Ecuador.  My room was clean and comfortable, and I was even upgraded to a single after they had", "..."]},
{"author": ["El_Gringo_Montana"], "content": ["Hostal de la Abuela sits in a great location, close to the center of Manta.  My room was on the top floor and it had a good view of the city, but it also got al", "..."]},
{"author": ["El_Gringo_Montana"], "content": ["At around $15 La Esquina is considerably more pricey than most places in Cuenca.As for the food, it certainly does live up to price.  I had a steak in roquefo", "..."]},
{"author": ["El_Gringo_Montana"], "content": ["I learned of La Caleta when I attended a free class put on by Diego, the owner and chef.  When I tried his ceviche it was by far the best Ecuadorian ceviche I h", "..."]},
{"author": ["El_Gringo_Montana"], "content": ["I had never eaten a Greek breakfast before, so when I saw it advertised outside of Souvlaki, it sounded like a worthwhile venture. I'm happy to say that it cert", "..."]},
{"author": ["El_Gringo_Montana"], "content": ["I've come to Pacifico twice within the past few weeks.  The first time I dropped in for an almuerzo and the combination of superior ambiance and service made it", "..."]},
{"author": ["El_Gringo_Montana"], "content": ["The food at Chopsticks is just fabulous!  While technically it's a Taiwanese restaurant, they also have a menu with the standard \"chifa\" options that you'll fin", "..."]},
{"author": ["El_Gringo_Montana"], "content": ["Eco lodge is tucked back into a quiet corner of town away from the highway traffic and dance clubs.  From there it's only a 5 minute walk to the main tourist dr", "..."]},
{"author": ["El_Gringo_Montana"], "content": ["I stayed at Kimbas for two nights and honestly, considering the other options nearby, I likely would not stay here again.The issue was partly with the rooms. ", "..."]},
{"author": ["El_Gringo_Montana"], "content": ["I came here twice within a week.  The first time I came for lunch and I was left with such a good impression that I decided to come back and give my Peruvian fr", "..."]},
{"author": ["El_Gringo_Montana"], "content": ["I make a point of coming here whenever I´m in Lima.  Through the years this place has kept up the quality in their flavors and the quantity of their filling por", "..."]},
{"author": ["El_Gringo_Montana"], "content": ["Barranco has long been the part of Lima where I´ve most enjoyed spending time.  In Barranco you will find:  Charming old architecture, abundant pro graffiti art", "..."]},
{"author": ["El_Gringo_Montana"], "content": ["I recently spent a month staying with my friend in San Borja.  This was our favorite place to come for our weekly Sunday feast, and we ended up visiting 3 diffe", "..."]},
{"author": ["El_Gringo_Montana"], "content": ["I dropped in here to have an afternoon coffee and to take a break from the heat.  I found that they had a good selection of different desserts and coffee variat", "..."]},
{"author": ["El_Gringo_Montana"], "content": ["I make periodic trips to Guayaquil and for a while I was always taking a gamble with booking mid-range accommodation options.  I'll no longer have to worry abou", "..."]},
{"author": ["El_Gringo_Montana"], "content": ["I had always known Dulce and Cremoso mostly as a place for desserts and coffees.  When I came to stay in Manta, you could say in a way I was lucky that my hotel", "..."]},
{"author": ["El_Gringo_Montana"], "content": ["I came here 3 times during my stay in Cajamarca.  The first and the last time were for cake and coffee, and the second time I came for lunch with a group of fri", "..."]},
{"author": ["El_Gringo_Montana"], "content": ["I found this place shortly after I arrived in Cajamarca.  It was near mt hotel and had a few good ratings so I figured it might be worth checking out.When I g", "..."]},
{"author": ["El_Gringo_Montana"], "content": ["The Tex Mex food in Cuenca seems to be getting quite popular, with the quality of places falling all over the map.  This one, sadly finds it's self right at the", "..."]},
{"author": ["_skyliptor"], "content": ["Don't stay in this place. Owner is awful. His behaviour was crazy and all atmosphere in this place really unsafe. I arrived to this hostel and nobody was there,", "..."]},
{"author": ["_skyliptor"], "content": ["Хостел располагается прямо рядом с вокзалом и недалеко от моста Сан-Франциско. Месторасположение очень хорошее недалеко много ресторанов, кафе и тур. агенств. С", "..."]},
{"author": ["_skyliptor"], "content": ["До аллее очень удобно добираться на общественном автобусе, проезд стоит 0,5$, автобус останавливается в любом месте на дороге, ходят примерно каждые 20 мин. К в", "..."]},
{"author": ["_skyliptor"], "content": ["Честно говоря водопад оказался не настолько впечатляющим, как на фотографиях. Но место однозначно достойно посещения. Доехать сюда можно из Баньоса на автобусе ", "..."]},
{"author": ["_skyliptor"], "content": ["Церковь находится в самом сердце Баньоса, рядом с центральной площадью и рынком. Красивый вход с резными деревянными дверьми. Внутри очень просторно,а интерьер ", "..."]},
{"author": ["_skyliptor"], "content": ["Решила попробовать бурито именно в этом кафе, т.к. отзывы были очень хорошие. Буррито совершенно обычный, много риса, начинка не равномерная, сначала вообще ешь", "..."]},
{"author": ["_skyliptor"], "content": ["Маленький парк прямо рядом с собором. Сначала игуан даже не видно, но слишком присмотреться, то они повсюду, на деревьях и клумбах. Тут же продают еду и можно и", "..."]},
{"author": ["_skyliptor"], "content": ["I stayed in this hostel one night. The next day I was planning to stay one more night, but a woman who worked at reseption told me \"No\". She answered what the h", "..."]},
{"author": ["_skyliptor"], "content": ["It's something like a one of the best bus company in  Peru. The service of this company wasn't really good. I took bus from Lima to Trujillo, with including din", "..."]},
{"author": ["_skyliptor"], "content": ["Awful staff. It was really unpleasant experience . A manager on reception was extremely rude and unprofessional. When he took my passport, he was really nervous", "..."]},
{"author": ["_skyliptor"], "content": ["I arrived to Probolingo and wanted to rent room in this homestay. When I met the host , he wasn't really pleasent. And started to explane me about tour to Bromo", "..."]},
{"author": ["_skyliptor"], "content": ["Приехали мы наконец то после 12часов дороги в отель. Где у нас был номер с балконом и видом на сад который мы купили в тур фирме. И получили какое то техническо", "..."]},
{"author": ["Edith S"], "content": ["Really at walking distance from the Sassi. If you are lucky you can park in front of the B&B. Very nice host who explains well what to do in Matera.The rooms a", "..."]},
{"author": ["Edith S"], "content": ["The host is an older lady who is very kind and helpful. She is helped by her son and daughter in law who is a very good cook.Breakfast and dinner were very goo", "..."]},
{"author": ["Edith S"], "content": ["Very nice place. Quiet and spacious modern rooms. At walking distance from the historic center. Very kind hosts who take the time to explain what you can do in ", "..."]},
{"author": ["Edith S"], "content": ["Very nice restaurant in the center of Naples. We were initially planning to dine at Tandem but they were full. They suggested us to go to this little spaghetter", "..."]},
{"author": ["Edith S"], "content": ["Restaurant in the old center at the piazza Dante. Location is nice , service is good but unpersonal. They are very nice towards local Italian guests , but less ", "..."]},
{"author": ["Edith S"], "content": ["We had lunch in this osteria which is located close to the bay. The food is ok ; service acceptable but it is clear that locals are given much more attention th", "..."]},
{"author": ["Edith S"], "content": ["Very nice quiet restaurant in the center of Naples. Perfect service , good quality of food. Very good wine. "]},
{"author": ["Edith S"], "content": ["Nice little place in the center of Montalcino. Nice garden to have lunch outside. Combination of restaurant and wine bar. They have indeed very good wine.The f", "..."]},
{"author": ["Edith S"], "content": ["A bit crowded , but nice seating outside. View on the lake.Good service.The meals were very good (especially seafood)"]},
{"author": ["Edith S"], "content": ["Very nice restaurant a few kilometers from Como center next to the Sheraton hotel.Nice place to eat with perfect garden to have dinner outside.We had the Ital", "..."]},
{"author": ["Edith S"], "content": ["This small hotel/B&B is the perfect place to stay in the center of Como.It is located near the lake , just behind some nice restaurants. However , it was not n", "..."]},
{"author": ["Edith S"], "content": ["The restaurant was almost empty due to the lack of tourists , so we could sit quietly in the courtyard and the service was very good.They have very good wines ", "..."]},
{"author": ["Edith S"], "content": ["The restaurant offers a limited menu with lunch options. The quality is very good.Nice setting.The service however was just bad. There were not enough waiters", "..."]},
{"author": ["Edith S"], "content": ["We had dinner in the nice garden of the Relais. It was quite busy , but social distancing was guaranteed.However , since there was a birthday dinner ongoing , ", "..."]},
{"author": ["Edith S"], "content": ["They have a few tables outside just next to the piazza in Cortona , which is perfect for lunch.The food is very good , excellent wine and a good service."]},
{"author": ["Edith S"], "content": ["Although there were hardly any tourists in Cortona , the restaurant was almost full , however well respecting COVID measures.The starter was not exceptional , ", "..."]},
{"author": ["Edith S"], "content": ["We had the advantage to be the only guests of the restaurant, since tourism was very low in Cortona in July 2020. So the service was perfect.The food was delic", "..."]},
{"author": ["Edith S"], "content": ["Restaurant met 1 vast menu. Eten heel lekker behalve het rundvlees. Service dramatisch : begonnen om 19u , buiten om 23u30."]},
{"author": ["Edith S"], "content": ["Super restaurant in hartje Brussel. Perfecte service. Schitterende visgerechten. 4 gangen menu is heerlijk heerlijk.Perfecte "]},
{"author": ["Edith S"], "content": ["The Suites are located on the other side of the Neckar near the old bridge.The suites are spacious , clean , very soft beds.The breakfast in the main building", "..."]},
{"author": ["Y546LDtimothys"], "content": ["I stayed in a room in the basement level with a shared bathroom and it was just fine for $35 a night. Old style Colorado; clean, funky and comfortable. Quiet to", "..."]},
{"author": ["Y546LDtimothys"], "content": ["I have stayed here for many years when I come and go from Guayaquil. It is convenient and generally reliable. Front door and front desk people are very helpful.", "..."]},
{"author": ["Y546LDtimothys"], "content": ["Open for just 5 months or so this hotel is in a quiet area just above the El Poblado neighborhood in Medellin. Easy access to new tunnel to the airport, a short", "..."]},
{"author": ["Y546LDtimothys"], "content": ["I have been trying to come up with the proper way to comment on this place. At the end of the day it should not be called an Inn in my opinion. I am OK with no ", "..."]},
{"author": ["Y546LDtimothys"], "content": ["La peor cosa que me pueden decir dura te check in es “ perdón que estamos remodelándolo el hotel”Ten cuidado. Aunque estamos en el piso 16 el ruido y vibració", "..."]},
{"author": ["Y546LDtimothys"], "content": ["If you want to Ride the UK and beyond this would be the companybto use. I had a great experience with Iain and Keith."]},
{"author": ["Y546LDtimothys"], "content": ["Steve and Erica and all of the staff were excellent, the facilities are beautiful, the view, the peace and quiet and all of the comments in the other reviews ar", "..."]},
{"author": ["Y546LDtimothys"], "content": ["One grouchy bartender, one who has been around and can manage a smile. Decent happy hour, good raw bar, used to be our favorite but a dog in a bag at the bar th", "..."]},
{"author": ["Y546LDtimothys"], "content": ["We had a very favorable impression of Lime Tree upon arrival but it all fell apart when we laid down on the bed. Felt like they pulled the mattress off the tras", "..."]},
{"author": ["Y546LDtimothys"], "content": ["We had an outstanding meal at Palette this evening. All four dishes were outstanding, the service was excellent and the view is one of the best in town."]},
{"author": ["Y546LDtimothys"], "content": ["I have been staying in this hotel and NH Hotels in Spain for years. The service is still good but the Internet service offered this year is unacceptable. When y", "..."]},
{"author": ["Y546LDtimothys"], "content": ["I had a shuttle pick up scheduled for 7 AM a week ago from Marathon to the Miami airport. I was picked up as the first passenger in an old Dodge van. This was n", "..."]},
{"author": ["Y546LDtimothys"], "content": ["We stayed at Yemaya for 9 nights in January of 2016. Every aspect of our visit was outstanding. The cabanas are wonderful, spacious and beautifully designed. Th", "..."]},
{"author": ["Y546LDtimothys"], "content": ["Willy was kind enough to take us on a little full moon panga ride and it was magical. His fishing cred is solid and he is a great guy. "]},
{"author": ["Y546LDtimothys"], "content": ["We spent a lovely weekend with the owners of the Hacienda, it was like being home but even better! It was a quiet weekend and we were the only guests on Saturda", "..."]},
{"author": ["Y546LDtimothys"], "content": ["We had two fantastic nights with the owners of the hacienda on a quiet weekend. A special place that we will return to as soon as we can. The food, the service ", "..."]},
{"author": ["Y546LDtimothys"], "content": ["I stay at the Amistad every year when I visit Murcia and this time the experience was as good as ever, especially since I injured my knee while hiking in the mo", "..."]},
{"author": ["Y546LDtimothys"], "content": ["A week ago yesterday we pulled back into Quito, climbing up from the Amazon basin and over the Papallacta Pass after completing the three day Avenue of the Volc", "..."]},
{"author": ["Y546LDtimothys"], "content": ["This was my first visit and I could not find fault with the hotel. The rooms was very nice and comfortable, the service was very good, the breakfast fantastic a", "..."]},
{"author": ["Y546LDtimothys"], "content": ["My home away from home in Guayaquil. Outstanding service, very convenient to airport, San Marino Mall and the Mall del Sol. As taxis are 5 bucks from the airpor", "..."]},
{"author": ["Jet700326"], "content": ["Great place to walk to Guayaquil highlights including river front. Friendly and helpful staff. Went out and bought phone SIM card and umbrella for me at a very ", "..."]},
{"author": ["IAMTHETRAVELGOD"], "content": ["Great place to stay in Playa Del Carmen. The pool is great during the day and the vibe, staff and people are always a good time. Selina is close to everything i", "..."]},
{"author": ["IAMTHETRAVELGOD"], "content": ["Crystal clear light blue hue water. I saw starfish, fish, & a manaray. Water was a bit rough for the first stop but still a great place experience. "]},
{"author": ["IAMTHETRAVELGOD"], "content": ["Great hotel. The roof has a pool and it has a great vibe and they play great music. The rooms are big and clean. The balcony is great at night to take in the so", "..."]},
{"author": ["IAMTHETRAVELGOD"], "content": ["Gran Cenote is a great place to visit, it has a cave you can swim through. It has turtles some small fish, as well as birds and bats flying in the cave. "]},
{"author": ["IAMTHETRAVELGOD"], "content": ["Posada Paraiso is a great place with a great view of Tepoztlan. It is very close to everything in the small town. Great staff working at the hotel and were very", "..."]},
{"author": ["IAMTHETRAVELGOD"], "content": ["Great vibe and the staff was great. The rooms were clean and the food was great. Always a great time at Selina and you always meet great people while staying at", "..."]},
{"author": ["IAMTHETRAVELGOD"], "content": ["The Mercado is huge and has all of the stuff you could want from Mexico for souvenirs. Great spot and the people were very helpful. "]},
{"author": ["IAMTHETRAVELGOD"], "content": ["Interesting building and I really like the design as well as the colors on the outside area of the building before you entered. "]},
{"author": ["IAMTHETRAVELGOD"], "content": ["Best restaurant in town. Great food and great vibe and colors in the restaurant. One of the best Mexican restaurants I have been to. Definitely a must see when ", "..."]},
{"author": ["IAMTHETRAVELGOD"], "content": ["Great experience on the boat. The people were friendly and even had a Mariachi Band play a song for us. "]},
{"author": ["IAMTHETRAVELGOD"], "content": ["Somos has great Ecuadorian food, great music and vibe. The art murals are amazing. A definite must experience when in Quito. "]},
{"author": ["IAMTHETRAVELGOD"], "content": ["Great Breakfast and Coffee in the morning here. I ate at the place and also ordered delivery with Uber Eats. Both were good "]},
{"author": ["IAMTHETRAVELGOD"], "content": ["Great 2x1 (2 for 1) Lunch Sandwich Special. Good Portion and Good Value. Delivery was fast with Uber Eats "]},
{"author": ["IAMTHETRAVELGOD"], "content": ["The Secret Garden Cotopaxi hands down is my favorite place. They have llamas, sheep, horses and cows on the property and amazing views of many mountains includi", "..."]},
{"author": ["IAMTHETRAVELGOD"], "content": ["El Panecilo is elevated above the city of Quito and it is a bit of a drive to get there but when you arrive at the top you get great views of Quito. The statue ", "..."]},
{"author": ["IAMTHETRAVELGOD"], "content": ["Hands down my favorite Cafe. Great music and food. The Coffee and tea are great as well. Definitely check this cafe out when in Quito. "]},
{"author": ["IAMTHETRAVELGOD"], "content": ["Arte Cafe & Te is a great place for breakfast. Great coffee and Tea. Worth going to when In Banos, Ecuador "]},
{"author": ["IAMTHETRAVELGOD"], "content": ["Arepas to Go has really great Arepas for a great price. Definitely worth getting for lunch when in Banos, Ecuador. I went back twice while I was here. "]},
{"author": ["IAMTHETRAVELGOD"], "content": ["Zoological de San Martin is a Zoo that has many birds as well as monkeys and even a white tiger. There are a lot of stairs and hills to walk up throughout the Z", "..."]},
{"author": ["IAMTHETRAVELGOD"], "content": ["Luna Volcan is a great place. I went there for the day to the pools which is a $20 day pass for 3hrs. It has really amazing views of the mountains from the pool", "..."]},
{"author": ["Arturo C"], "content": ["Un hotel ubicado  en la ribera del río ocupando un antiguo edificio que los propietarios Isra y Jordan han reformado generando magníficas suites.Ambos te hacen", "..."]},
{"author": ["Arturo C"], "content": ["Local con encanto.La carta no es muy extensa pero nos decidimos por las recomendaciones de “fuera de carta” y quedamos muy satisfechos. La ensalada de tomate e", "..."]},
{"author": ["Arturo C"], "content": ["Fuimos dos familias de amigos y esperábamos disfrutar del espectáculo pero nos encontramos con una sorpresa mayúscula con el despliegue de medios humanos y técn", "..."]},
{"author": ["Arturo C"], "content": ["Nos recomendaron comer en el Museo y reservamos para las 15:30.Al final empezamos a comer a las 16:15 pero la atención fue muy buena y la comida, con el menú d", "..."]},
{"author": ["Arturo C"], "content": ["Después de comer en la bodega San Rafael y el el mercado de Feria La Cantina, hemos ido a la Bottega Italia.Helados, limonchelo y bolleria casera inmejorable.", "..."]},
{"author": ["Arturo C"], "content": ["Un día trabajando en Sevilla y me llevan a comer a un nuevo sitio, La Cantina en el mercado de Feria.Trato muy cercano, comida excelente y a un precio asequibl", "..."]},
{"author": ["Arturo C"], "content": ["Pagamos por reservar los asientos que queríamos lo que incrementa el costo del billete pero así nos olvidamos de las largas colas que se generan al no tener pri", "..."]},
{"author": ["Arturo C"], "content": ["Nuestro primer viaje a Londres.Decidimos emplear una mañana para conocer algo del Museo Británico.Visitamos una parte, principalmente Egipto y es muy recomend", "..."]},
{"author": ["Arturo C"], "content": ["En nuestra visita de una semana a Londres reservamos una habitación triple para compartir con nuestra hija de 19 años.La habitación pequeña para tres personas,", "..."]},
{"author": ["Arturo C"], "content": ["Fue el primer sitio en el que comimos al llegar de vacaciones a Oropesa y quedamos muy satisfechos. Atención agradable, uno de los camareros muy cercano y simpá", "..."]},
{"author": ["Arturo C"], "content": ["Aprovechamos el finde semana para hacer una escapada y, después de comer, ir a la zona del lago de Sanabria.En la cueva comimos estupendamente y, sobre todo, m", "..."]},
{"author": ["Arturo C"], "content": ["Después de salir del teatro a las 12 de la noche fuimos a cenar a este restaurante ya que en internet se publicita que la cocina está abierta hasta ls 2 de la m", "..."]},
{"author": ["Arturo C"], "content": ["Comimos a la carta una ración de pulpo mejorable y unas vieirias aceptables.Respecto al vino exageradamente caro, 21€ por un Ribeiro.Las filloas relllenas de ", "..."]},
{"author": ["Arturo C"], "content": ["El hotel necesita una reforma urgente. Las cortinas opacas no cierran y ese maravilloso sol levantino de las 8 de la mañana te da de pleno en el ojo sirviendo d", "..."]},
{"author": ["Arturo C"], "content": ["Un local con historia que mantiene intacta la calidad de su producto. Atención personal muy agradable.El arroz meloso con bogavante azul excelente, probadlo.M", "..."]},
{"author": ["Arturo C"], "content": ["Esta compañía ofrece una opción económica para viajar a Mallorca, estricta con la puntualidad, no recomiendo llevar mucho equipaje, se complica la cosa."]},
{"author": ["Arturo C"], "content": ["El hotel tuvo, seguro, su momento de gloria hace tiempo pero ahora, salvando la ubicación, necesita una renovación importante. La ducha no se quedaba en su luga", "..."]},
{"author": ["Arturo C"], "content": ["Durante nuestro viaje familiar a Cuba hicimos nuestra primera parada en La Habana y, como no podía ser de otra forma, fuimos a visitar La Habana Vieja.Empezand", "..."]},
{"author": ["Arturo C"], "content": ["En nuestro viaje familiar de este verano dormimos tres noches y todo fue fenomenal.Atención excepcional. La Srta. Ivis estuvo muy atenta de nuestras necesidade", "..."]},
{"author": ["Arturo C"], "content": ["El primer día de llegar a La Habana, un poco perdidos y cansados, en contra los este restaurante en el Malecón.Buscando un paladar encontramos Casa Mia y cenam", "..."]},
{"author": ["Amy N"], "content": ["We stayed a night before departing. We have been in Ecuador for three weeks and stayed at many accommodations. This particular hotel far surpassed all of the ot", "..."]},
{"author": ["lwainwright19"], "content": ["My husband and I stayed in the king room for two nights after our trip to the Galapagos Islands. The room was spacious and clean with a large balcony and great ", "..."]},
{"author": ["lwainwright19"], "content": ["Hi all -- I found the info on this forum infinitely useful while planning our Maldives trip, so I wanted to give back (at least in this minor way). We stayed at", "..."]},
{"author": ["lwainwright19"], "content": ["We spent one night here on two separate occasions (2 nights total - one on each end of our trip) when we had 9 hour layovers in Doha. Under normal circumstances", "..."]},
{"author": ["lwainwright19"], "content": ["My husband and I spent nine nights at Reethi Faru -- 4 nights in a jacuzzi villa and 5 nights in a water villa -- and cannot recommend the resort enough.PANDE", "..."]},
{"author": ["lwainwright19"], "content": ["My husband and I stayed here for one night before flying out of Fiumicino. The room was spacious and clean, with secure parking for our rental car. It's a small", "..."]},
{"author": ["lwainwright19"], "content": ["My husband and I booked this hotel for a last minute stay after we departed early from another hotel that was disappointing. Hotel Gabbiano was wonderful! The r", "..."]},
{"author": ["lwainwright19"], "content": ["Pros:Hotel is in a good location, right on the water, and our room had a really lovely view out over the promenade and waterHotel is convenient walking distan", "..."]},
{"author": ["lwainwright19"], "content": ["My husband and I stayed in a trullo in Trulli Soave's portfolio for one night, and really enjoyed it! The trullo itself was super cute and clean, and located in", "..."]},
{"author": ["lwainwright19"], "content": ["My husband and I stayed in Matera for two nights and really enjoyed our stay at B&B Nel Muro. We were looking for an affordable place in a convenient location w", "..."]},
{"author": ["lwainwright19"], "content": ["My husband and I stayed here for 3 night and it was absolutely beautiful! We were looking for an affordable place near Sorrento with great views and we found it", "..."]},
{"author": ["lwainwright19"], "content": ["This hotel was just what we were looking for in Rome. Awesome convenient location not too far from the Pantheon, but walkable to almost all the main sights, inc", "..."]},
{"author": ["lwainwright19"], "content": ["My husband and I used this company for Tour C, and had a great time. The previous day we'd used Discover El Nido for Tour A, and found that overall Tarawis was ", "..."]},
{"author": ["lwainwright19"], "content": ["My husband and I used this company for Tour A, and had a great time. Aside from the beautiful scenery and stops, the nice part was that we only had 7 people on ", "..."]},
{"author": ["lwainwright19"], "content": ["My husband and I visited Taipei for 3 days, and we stumbled upon Din Tai Fung on our first day. The food was so delicious that we ended up eating here again two", "..."]},
{"author": ["lwainwright19"], "content": ["My husband and I stayed here for four nights and really enjoyed our stay.  The hotel itself is wonderful: comfortable and modern rooms, spotlessly clean. Wonder", "..."]},
{"author": ["lwainwright19"], "content": ["Lovely hotel with clean rooms, located a bit above town. Lots of steps, which we didn't mind, but wouldn't be the best for anyone with mobility issues. The view", "..."]},
{"author": ["lwainwright19"], "content": ["My husband and I stayed here for four nights and enjoyed our stay. At first, were a little bit underwhelmed with the room and bathroom (very basic/simple compar", "..."]},
{"author": ["lwainwright19"], "content": ["My husband and I had a fabulous stay at Via Hotel Taipei Station. The hotel is really conveniently located, and we used it as a base to walk to lots of the main", "..."]},
{"author": ["lwainwright19"], "content": ["Convenient location, very clean, spacious and modern rooms. Brand new as of a couple years ago. Felt like a very nice luxury property, yet very reasonably price", "..."]},
{"author": ["lwainwright19"], "content": ["Good solid hotel in convenient location, walkable and convenient to lots of great areas. We enjoyed walking to myeongdong and insadong areas in particular. The ", "..."]},
{"author": ["bplatz871"], "content": ["Clean, safe, great breakfast. Easy enough to find. Places nearby to walk to eat. Low key, soothing atmosphere and great music on the record player! Warm showers", "..."]},
{"author": ["megnay"], "content": ["I was flying home from Bangkok after two years living abroad in Asia. I contracted Salmonella in Thailand a few days before I had to get home. I was so sick on ", "..."]},
{"author": ["megnay"], "content": ["While In transit to Bangkok, I stayed at this hotel. I was surprised to see how large and comfortable the rooms were. In Korean-style, the staff provided toothb", "..."]},
{"author": ["megnay"], "content": ["I stayed here on my first stop in Thailand and ended up booking again on my way back home because I loved it so much. The physical building is old and very quai", "..."]},
{"author": ["megnay"], "content": ["Although this resort isn't necessarily close to the tourist attractions, it is absolutely the most charming resort I've ever been to. It's mostly made of wood a", "..."]},
{"author": ["megnay"], "content": ["Sukhothai was one of my favourite stops because it had virtually no tourists and felt like a more authentic stop to relax and just \"be\" in Thailand. At Home Suk", "..."]},
{"author": ["megnay"], "content": ["This park was truly magical, despite the odd car show that was happening out front. You quickly block out the noise and get lost in this beautiful history. I sp", "..."]},
{"author": ["megnay"], "content": ["I was REALLY disappointed by this hostel. I heard from so many friends that this was THE place to stay in Chiang Mai, but honestly it turned out to be just anot", "..."]},
{"author": ["megnay"], "content": ["Despite the size of the guesthouse, I found the service pretty well-organized considering. Although they were a bit disorganized about bed numbers (she gave me ", "..."]},
{"author": ["megnay"], "content": ["My friend took me here last weekend with a promise that it would be the best brunch I'll ever have in South Korea, and she wasn't wrong! Located on the third fl", "..."]},
{"author": ["megnay"], "content": ["The Gwangan Bridge is why I prefer Gwangalli over Haeundae. There are restaurants all along the beach that make it particularly nice to sit on a patio at night ", "..."]},
{"author": ["megnay"], "content": ["This beach is SO MUCH BETTER than Haeundae. I don't know why anyone prefers Haeundae over Gwangalli. It's much less populated and has a gorgeous view of the bri", "..."]},
{"author": ["megnay"], "content": ["While this beach is nice, I much prefer Gwangalli. Haeundae is quite populated during the popular months, where as Gwangalli is a bit more relaxed."]},
{"author": ["megnay"], "content": ["I really enjoyed my visit to the Busan Aquarium. I did like that they stressed the importance of rehabilitation. There was a lot to see and read about in the 1.", "..."]},
{"author": ["megnay"], "content": ["Hey everyone!I'll be flying within Thailand two times during the month I'm there — once with AirAsia and once with Bangkok Airways. I'll have a 70L backpackin", "..."]},
{"author": ["megnay"], "content": ["Thank you so much for all the helpful advice. I'll pay in advance for a checked Air Asia bag."]},
{"author": ["megnay"], "content": ["My friends and I had a decent one-night stay at the Aark Guesthouse. Typical for cabbing in Korea, we had trouble finding the Guest House every single time. It'", "..."]},
{"author": ["megnay"], "content": ["This is absolutely the best beach in mainland Korea. The water is crystal clear and extremely clean. There are tons of fun waves, although sometimes it can be q", "..."]},
{"author": ["megnay"], "content": ["My friend and I will be traveling from Phangan to Surat Thani to catch an overnight train to Bangkok at 6:30pm. We will arrive at Surat Thani around 10am. We or", "..."]},
{"author": ["megnay"], "content": ["Fabulous! Thank you for the ideas."]},
{"author": ["megnay"], "content": ["Hey everyone!From Nov. 29-Dec. 23, my friend and I will be backpacking around Thailand. I'm not experienced in backpacking through Asia, nor is she, so we've ", "..."]},
{"author": ["oleadam"], "content": ["Highly recommend this company. Very personal and accommodating to our needs. Right from the start the email communication was good and the team recommended adj", "..."]},
{"author": ["oleadam"], "content": ["After reading good reviews I decided to try this place and opted to go before 7pm for the early bird. The food was delicious and the early bird food was really ", "..."]},
{"author": ["oleadam"], "content": ["This is close to the airport, the rooms are really spacious with a nice en-suite, breakfast was good and varied, the Internet was fast, a few options on the TV ", "..."]},
{"author": ["oleadam"], "content": ["I enjoyed staying at Tahir's B&B. He made me feel very welcome and it was a good option for me, only a fifteen minute walk to the subway which meant I could get", "..."]},
{"author": ["oleadam"], "content": ["I stayed here for one night as it was close to the bus station and I had an early bus. I also quite like the Latin Quarter and it has lots of cool restaurants. ", "..."]},
{"author": ["oleadam"], "content": ["I had a great three days here. I met some great people, had a dorm room to myself for the whole time and the facilities were great. The kitchen is well equipped", "..."]},
{"author": ["oleadam"], "content": ["I visited here twice, once to explore all the different sites and a second time to do a hike and watch the lava glow at night timegglow "]},
{"author": ["oleadam"], "content": ["These guys organised a great tour to snorkel at night with manta rays. Other tours were out as and these guy's seemed very professional "]},
{"author": ["oleadam"], "content": ["At $5 per car to enter the park it was reasonable and the waterfall and walkway were really impressive. It only takes 30 minutes but it's worth the trip"]},
{"author": ["oleadam"], "content": ["This hostel felt a bit run down. The room was ok but incredibly hot and noisy from outside traffic. Breakfast was ok and it was nice to have free food on two ni", "..."]},
{"author": ["oleadam"], "content": ["This was a nice hotel. The room was big, clean and nice facilities. The pool was good and there was lots of space for parking. The only downside was no breakfas", "..."]},
{"author": ["oleadam"], "content": ["This was an interesting place to visit. The audio guide was informative and interesting. There were also some good live talks."]},
{"author": ["oleadam"], "content": ["The park is nice to walk around and the desert garden is great. But unless you are paying to go to museums it didn't seem particularly impressive "]},
{"author": ["oleadam"], "content": ["This hostel is well located, is really clean, has friendly staff, good breakfast, lots of tours and trips going on. The only thing that was a bit overwhelming w", "..."]},
{"author": ["oleadam"], "content": ["I did grow to like this place. The streets outside are intense, during the day it's sketchy but at night time is is very dodgy. If you can cope with this then i", "..."]},
{"author": ["oleadam"], "content": ["I loved this tour. The audio tour, video and exploring the island were fantastic and well organised. I had to do the Angel Island tour as well as other tickets ", "..."]},
{"author": ["oleadam"], "content": ["This park is incredible. I went exploring the park on a Sunday and there were lots of things going on. The redwoods and bison were great to go and see"]},
{"author": ["oleadam"], "content": ["On a clear day there are fantastic views. $8 seems like quite a lot for a view that is easily over after a few minutes but still probably worth it."]},
{"author": ["oleadam"], "content": ["If you love Mexican wrestling then this is for you. I was vaguely interested and after an hour I had about had enough and it goes on for three but it is still w", "..."]},
{"author": ["oleadam"], "content": ["This is a little out of the way if you are using the metro. There isn't lots to see but Diego's studio is interesting to visit"]},
{"author": ["David B"], "content": ["Na het lezen van de beoordelingen op TripAdvisor was ik wel wat voorzichtig. Mijn eigen ervaring viel gelukkig reuze mee. De bediening was vlot, vriendelijk en ", "..."]},
{"author": ["David B"], "content": ["We had a great stay at the Blue Turtle hotel. Great rooms, Nice pool and friendly staff. Would be a 10/10 if it wasnt for the construction going on at the time.", "..."]},
{"author": ["David B"], "content": ["Everything was good! Had a burger and fries, tasted very nice. Relaxed atmosphere and friendly staff. "]},
{"author": ["David B"], "content": ["This tour takes you to all the highlights. A very friendly driver, who was very helpfull, showed us around the city. It included a typical shrilankan lunch, whi", "..."]},
{"author": ["David B"], "content": ["First of all the staff is very friendly and helpful. You can ask them anything and they even taught us some spanish. Our room was great, clean and spacious. The", "..."]},
{"author": ["David B"], "content": ["We just grabbed a quick bite at this joint. Staff was friendly and the food was tasty and fresh. Would definitly recommend it. "]},
{"author": ["David B"], "content": ["De service die deze familie gerunde hostel biedt is erg hoog. De vriendelijkheid spat er van af, geen verzoek gaat te ver. Het hostel ligt een paar honderd mete", "..."]},
{"author": ["David B"], "content": ["Je kijkt hier je ogen uit. Je proeft meteen de sfeer van de stad. Er is echter niet veel meer te doen dan kijken en eten. Ook zijn er een paar winkeltjes waar j", "..."]},
{"author": ["David B"], "content": ["We arrived upon recommedation of Lonely Planet. Well I sure would not recommend this hostel. The staff wasnt helpful or friendly at all. They gave out zero info", "..."]},
{"author": ["David B"], "content": ["Wij namen een Tour door dit park. Het was erg mooi, vooral de flora is de moeite waard. Je ziet helaas erg weinig dieren, een enkele alpaca. Let er wel op dat h", "..."]},
{"author": ["David B"], "content": ["The room was clean, but with no airco it was pretty hot. Beds were comfy and the room was spacious. The staff was very friendly and patient, although they didnt", "..."]},
{"author": ["Kimpie36"], "content": ["We had a realy nice stay at Dyke rest. The manager was realy nice and helpfull. It is right at the beach. I spend a day Just reading,  and swimming, I was serve", "..."]},
{"author": ["Kimpie36"], "content": ["We had a great morning, starting with a fresh coconut and ending with great curry. In between we saw really nice sides of Colombo. The buddhist tempel, hindu te", "..."]},
{"author": ["Kimpie36"], "content": ["It's a beutifull lake, if you are okay fit you can walk down in 45 minutes and up in 1 hour. Up is quite heavy. If you have about 4-6 houres you can walk all th", "..."]},
{"author": ["Kimpie36"], "content": ["The place looks amazing, nice kolonial house. Helpfull staff and a great patio to drink tea, coffee or beer. There is also a kitchen you can use with plenty of ", "..."]},
{"author": ["Kimpie36"], "content": ["Friendly staff, but they only speak spanish. The room is fine, and clean. Breakfast is not inclused. There is a fan to give you some cool, no airconditioning. I", "..."]},
{"author": ["Kimpie36"], "content": ["A nice day, seeing a different part of Hoi An. The guide was nice, good company and knew a lot about the customs  and the differnt kind of occupations in the ar", "..."]},
{"author": ["arthalion"], "content": ["Awesome service, with care and good explanations and recommendations. Unique food (Naga) that gives you a complete new experience i haven’t tried before.The", "..."]},
{"author": ["arthalion"], "content": ["We Booked a 1 day tour from Hurghada To Luxor. The bus arrived on time, 20 min earlier. The Car was comfortable with Air con. The driver didn´t speak English b", "..."]},
{"author": ["arthalion"], "content": ["- it's located 2 min away from the airport. You would pay around 5usd for the trip.- There is a small place to buy beersa  coke etc 50mts away.- there is a pl", "..."]},
{"author": ["arthalion"], "content": ["You would spend around 1 hr walking the whole malecon. You could view the river(that is not nice) and try local ecuatorian food."]},
{"author": ["arthalion"], "content": ["Pros:- The staff is amazing they are always glad to help you, calling a taxi or whathever you need.- the room was ok is a calm place.- we asked for a breakfa", "..."]},
{"author": ["arthalion"], "content": ["It's a 45 minutes walk through galapagos vegetations. You could see diferent types of birds while walking. I recommend to go early in the morning because the he", "..."]},
{"author": ["arthalion"], "content": ["Pros:- It's located 1 block away from the center of the town.- you have shops and restaurants really close.- the wifi was ok.- the staff was nice.- they ha", "..."]},
{"author": ["arthalion"], "content": ["We saw tons of green tuttles, sharks, rays, etc. less than 1 meter away. Even a seahorse.I believe there is not too much to say."]},
{"author": ["arthalion"], "content": ["Pros:- the location is excelent you are less than 1 block away from the pier.- The room was clean.Cons:- Wifi was not so good(could be an island issue).- ", "..."]},
{"author": ["arthalion"], "content": ["Pros:- Price- big room- TV, Air con.- you are a few blocks away from malecon.Cons:- neighborhood doens't look good, we didn't feel good walking during ni", "..."]},
{"author": ["arthalion"], "content": ["We did 2 dives in isla tortuga. It's located like 15min away from the pier.Cons:-The equipment was bad. My BCD didn't have The strap to purge the air and my ", "..."]},
{"author": ["arthalion"], "content": ["We dive 4 dives in 2 days:- 1x North Seymore.- 1x Mosquera.- 2x Gordon Rocks.Pros: - the boat is really nice it has bathroom and you can relax while you a", "..."]},
{"author": ["arthalion"], "content": ["- The location is good but not incredible. is 10min walk from the mall and 20min walk from the city center.- just 1 block away you have some local food places ", "..."]},
{"author": ["arthalion"], "content": ["- we stayed for just one night. The location it's good, near the night market.- The rooms were clean and comfortable.- My only concern is with the staff when ", "..."]},
{"author": ["arthalion"], "content": ["This place is amazing, i was not expecting something like that. The color of the water is incredible, you could easily spend a whole afternoon in this place, l", "..."]},
{"author": ["arthalion"], "content": ["- the location is great just in the middle of the morning market. 1 block away from the night market.- The staff is great, when you arrive they give you a free", "..."]},
{"author": ["arthalion"], "content": ["We did a 2 days trekking to the hmong/khamu Villages.We had 1 guide per 2 people.  We walked around 4 hours each day, really relaxed with some stops to recove", "..."]},
{"author": ["arthalion"], "content": ["When you arrive you are going to see a place that doesn't look so good. Saddle the garbage of the street is stored just in front of the entrance. Also the plac", "..."]},
{"author": ["arthalion"], "content": ["- I felt bad trying indian food at Palau, but this restaurant was really good.- I tried chicken Vinadaloo and i really love it. Spicy but great.- The have dra", "..."]},
{"author": ["arthalion"], "content": ["One of the best tours companies I'v ever tried.- It's expensive but it worth it.- Were expecting to do 1 or 2 tours with Sam's and at the end we did ( 2 kayak", "..."]},
{"author": ["Ryan P"], "content": ["This place had the best Sri Lanken curry we had on our 3 week trip. Service was good, upstairs dining was nice for couples and juices/milk teas were fantastic. ", "..."]},
{"author": ["Ryan P"], "content": ["We liked staying at 335. The owner is a very nice guy, helpful and knowledgable. He was able to answer our questions regarding activities, food, rickshaws and o", "..."]},
{"author": ["Ryan P"], "content": ["The food was very well presented and tasted great. It was relatively a little higher in price however reflected the good quality. The cafe is cosy and makes a g", "..."]},
{"author": ["Ryan P"], "content": ["We enjoyed the food here and it was also cheap. The service was very friendly. We were provided with playing cards while we waited for our meal and the owner al", "..."]},
{"author": ["Ryan P"], "content": ["We do not like to give poor reviews but must do so based on our experience. Positives:- nice treehouse and bathroom- good Sri Lankan Breakfast and welcome d", "..."]},
{"author": ["Ryan P"], "content": ["This place was a great find. Nice outdoor seating, friendly service, good value, generous portions and tasty. We ate here about 4 times. The veg curry meal whic", "..."]},
{"author": ["Ryan P"], "content": ["Location was good for what we needed. We stayed 2 nights in a dorm. Close to beach, approx 1000 LKR in taxi from airport, 700 LKR to airport in rickshaw. Good A", "..."]},
{"author": ["Ryan P"], "content": ["We stopped by for lunch. The cafe is a nice place, the food well presented and tasted great. I had the French toast which came with a generous amount of fruit. ", "..."]},
{"author": ["Ryan P"], "content": ["We thought this restaurant was a great find and ate here a few times during our 6 days in hampi. The prices were reasonable and portion sizes were generous, par", "..."]},
{"author": ["Ryan P"], "content": ["The guesthouse is in a great location close to main attractions, restaurants, the main temple, the bus station, the river crossing etc. The host was very friend", "..."]},
{"author": ["Ryan P"], "content": ["This hostel had a really good vibe. The team are very helpful. The communal lounge area is a great space for chilling out and having a chat with fellow backpack", "..."]},
{"author": ["Ryan P"], "content": ["This is an excellent family run guest house. The room was very nice and the shower was hot.  It was convenient to have access to the restaurant upstairs. The lo", "..."]},
{"author": ["Ryan P"], "content": ["We've been in India for a month and this is hands down the best Thali we've had so far. It cost R150 per person. The staff were great and we came back four time", "..."]},
{"author": ["Ryan P"], "content": ["We came back here four times. Our favorite was the banana, honey, yoghurt, pomegranate, muesli bowl. It was fresh and delicious and only cost R100."]},
{"author": ["Ryan P"], "content": ["We stayed in the hotel below this restaurant and ate here most days. The service was quick and the food was very good. They have a nice seating area with great ", "..."]},
{"author": ["Ryan P"], "content": ["The room was good. It was clean and comfortable with hot water in the shower. Nice rooftop restaurant upstairs. Great location, central to the step well, clock ", "..."]},
{"author": ["Ryan P"], "content": ["The Tikka Chola and lassi cost R180 which was delicious. We also tried the toasted cheese sandwich which was also good. The staff were very nice and friendly. I", "..."]},
{"author": ["Ryan P"], "content": ["We went here for dinner. It's a nice rooftop setting with views of the fort and candle lit tables. We had two mains, two drinks and two desserts totaling R1000.", "..."]},
{"author": ["Ryan P"], "content": ["We enjoyed both the Indian and Western food options. They have nice views of the fort and friendly staff. We ate there a couple of times. Two mains and two juic", "..."]},
{"author": ["Ryan P"], "content": ["We ate at this restaurant a number of times. The service and food were great. At the time of our visit they had just installed a new espresso machine and offere", "..."]},
{"author": ["PJWray"], "content": ["We found the service to be poor.  Our waiter paid lots of attention to the regulars, while we waited 20 minutes to be asked if we wanted dessert or coffee.  Whe", "..."]},
{"author": ["PJWray"], "content": ["This is a neat area to walk around in Vancouver with tons of restaurants and bars.  We had hoped for more boutique shopping and were a bit disappointed."]},
{"author": ["PJWray"], "content": ["Beautiful building with interesting exhibits both inside and out.  Hourly tours offered at no additional cost.  Expect to spend a couple of hours at least.  Eas", "..."]},
{"author": ["PJWray"], "content": ["Great service.  Buy books of tickets if you're taking multiple rides - good savings.  Excellent service from airport to downtown Vancouver ."]},
{"author": ["PJWray"], "content": ["Great public market.  Huge variety of fruits and veggies.  Had some great doughnuts too.  Take public transit because parking is limited.  Try the Auqua Bus to ", "..."]},
{"author": ["PJWray"], "content": ["Saw a Vancouver Canadians game there.  Fun A ball.  Great little minor league stadium.  Tickets were very reasonable, but games are often sold out so purchase w", "..."]},
{"author": ["PJWray"], "content": ["Mix of touristy souvenir shops and really nice shops.  Good pubs, but can be busy.  Easy walk from downtown."]},
{"author": ["PJWray"], "content": ["Good food and large servings.  This location is convenient and we found the food good.  Like every other Kef"]},
{"author": ["PJWray"], "content": ["Service was slow, food was so-so, but prices were reasonable.  This is a hip downtown spot, but the music was WAY too loud for my taste."]},
{"author": ["PJWray"], "content": ["Great breakfast place - served until 2 in the afternoon.  We ate there three times during our week in Vancouver .  The Bellagio breakfast is great."]},
{"author": ["PJWray"], "content": ["Great way to get around False Creek waterfront.  We used it to get from Yaletown to Grandville Market and then to Space Centre."]},
{"author": ["PJWray"], "content": ["Great day trip.  If you get a sunny day use it to visit this attraction.  Buy your tickets in advance to avoid the line ups when you get there.  Use the free sh", "..."]},
{"author": ["PJWray"], "content": ["Very disappointing!  We went for the Saturday evening Realm of Light show - it was so bad that we asked for our money back.  The sound system wasn't working pro", "..."]},
{"author": ["PJWray"], "content": ["I got a great deal on-line for a one-night stay at this renovated bank.  The tower rooms have recently been renovated and are quite nice.  Well equiped with a g", "..."]},
{"author": ["PJWray"], "content": ["I've frequented The Keg in a number of cities and still find the food quality at the York St. location to be the best.  We were there on a Sunday night, so it w", "..."]},
{"author": ["PJWray"], "content": ["We've stayed at the Chelsea many times over the past 30 years for both business and pleasure.  The location is great for downtown activities (Air Canada Centre ", "..."]},
{"author": ["PJWray"], "content": ["This property is in need of someupgrading.  The rooms were a good size and the bedscomfortable, but I found the bathrooms and carpeting showing some significa", "..."]},
{"author": ["PJWray"], "content": ["We needed a place for lunch prior to convocation at the National Arts Centre and Le Café, being in the NAC seemed like the perfect choice.  I was surprised it w", "..."]},
{"author": ["PJWray"], "content": ["We had been to Cyranos a number of times many years ago and decided to try it again.  We found the service very attentive and friendly.  Great martini and the f", "..."]},
{"author": ["PJWray"], "content": ["We arrived at Casa Geande a day early after having missed a flight from Lima and having to make some major changes to our itinerary.  The staff welcomed us warm", "..."]},
{"author": ["Robert M"], "content": ["Our 1st night stay in the Galapagos and we did not realize that all 3 of our meals were included in our tour package.  The 2 for 1 happy hour drinks brought us ", "..."]},
{"author": ["Robert M"], "content": ["We hiked with our guide \"Che Che\" to this secluded spot and saw alot of marine iguanas, sea lions and other local animals. Past the \"rough\" beach is a calmer be", "..."]},
{"author": ["Robert M"], "content": ["We decided to stay here on and off for a couple weeks to make it easier to help the in laws get around.   Our first room was tiny and cramped but functioned.  T", "..."]},
{"author": ["Robert M"], "content": ["My wife handled all of our trips itinerary and I must say that this place was a standout.  I only wished we had more time to stay here.  Pancho was very accomod", "..."]},
{"author": ["Robert M"], "content": ["My wife and I stayed here through the booking of our tour.  We stayed 3 nights and I must say it was the largest and cleanest of all the places we stayed in our", "..."]},
{"author": ["Elias K"], "content": ["El servicio fue bueno y las habitaciones comodas; tiene muchas actividades de campo y es una forma de inducir a los niños y jovenes a compartir un día de campo.", "..."]},
{"author": ["Elias K"], "content": ["El precio es justo pero las facilidades deberían estar mejor atendidas y haber una tienda de souvenirs y facilidades de fotos o de descanso con aire temperados."]},
{"author": ["Elias K"], "content": ["A 'cebiche' is the main ocean delight dish, and is a characteristic one to eat in the morning. Loganita was the best place to eat it; however, after she became ", "..."]},
{"author": ["Elias K"], "content": ["I stopped to visit and let friends visit, it is full of restored ancient local art and the wood and Altars give you a soothing spiritual feeling. It is also ver", "..."]},
{"author": ["Elias K"], "content": ["The special place and the design make you dig deep into yourself and pray, relax and meditate. Use to be right next to the highway, now you must turn a slight w", "..."]},
{"author": ["Elias K"], "content": ["I have made it a tradition to visit constantly wit friend or by myself; there are no found every place species and the surf is always overwhelming. "]},
{"author": ["Elias K"], "content": ["You pass right through it and it is difficult not to stop and try one of the local delicateness just fished. Of course since it is locally prepared you will be ", "..."]},
{"author": ["Elias K"], "content": ["You will find good service very pleasant and the staff is very helpful. The location is good and the price is worth the service. They have a fantastic view and ", "..."]},
{"author": ["Elias K"], "content": ["The Hotel is extremely well located, a couple of blocks away from the Municipality and the Governors Office; I found the rooms clean and enough for the needs of", "..."]},
{"author": ["Elias K"], "content": ["I have been an assiduous client finding that their steaks and varieties were very carefully cooked and their types defined; besides, the giant pieces served. Ho", "..."]},
{"author": ["Elias K"], "content": ["Ecuador is the only Country with the greatest variety of 'Orquideas' (Yes more than Costa Rica). It is mostly run by volunteers that love gardening; of course, ", "..."]},
{"author": ["Elias K"], "content": ["Visiting the place where the city started and typic living is still found was very interesting, you can enjoy the older people narrating stories of the past and", "..."]},
{"author": ["Elias K"], "content": ["Nice looking at Guayaquil from the top of the revolving wheel and a good place to take pictures, after you finish the ride there are several tourist options to ", "..."]},
{"author": ["Elias K"], "content": ["When you arrive you can feel a tranquillity and peace that is sparked from the very large location, full of trees and flowers. The 'Church' itself is a small pl", "..."]},
{"author": ["Elias K"], "content": ["Many different types of bread and some tasty pastry and sweets are brought right out to from the oven, you can find all the time freshly made baguettes, brioche", "..."]},
{"author": ["Elias K"], "content": ["You can actually hear and feel the passage of the years and feel the ambiance back at the end of the 18th. Century. The best time is at night and since now it i", "..."]},
{"author": ["Elias K"], "content": ["Many things must be taken into consideration; on Tuesday they give pieces of bread in remembrance of Saint Francis and they also give a warm meal to the poor. M", "..."]},
{"author": ["Elias K"], "content": ["It has been for many years a fine dining place and I enjoyed the chef´s suggestion that was a mixture of seafood with  asparagus garnishing"]},
{"author": ["Elias K"], "content": ["I was pleasantly surprised by the courtesy of the staff and they gave an upgrade to a large suite that was followed by a tray with local fruit that was deliciou", "..."]},
{"author": ["Elias K"], "content": ["The aroma of the just baked bread and typical sandwiches was pleasant; besides, they had a variety where you can please anyone if it is a group like ours."]},
{"author": ["bullmarlene45"], "content": ["Good food, place clean, the staff are friendly, WiFi available. It is open 24 hours. All in all very good "]},
{"author": ["bullmarlene45"], "content": ["The hotel is rubbish, is not look like as the pic from the internet, and is not 4 star as TUI say in the broucher,  some days no water, taps broken, shawer room", "..."]},
{"author": ["bullmarlene45"], "content": ["Very good fly with Avianca, food ok. drink ok. staff ok . I will come back flying with Avianca. Could be good if Avianca departure from Cardiff no only from Hea", "..."]},
{"author": ["bullmarlene45"], "content": ["Nothing excited is ok for sleep, more import the room is cleaning every day, and the staff are friendly, the only thing i did not like was the breakfast, no var", "..."]},
{"author": ["bullmarlene45"], "content": ["Called in today (Sunday 4-Sep. 2016) for my birthday meal with my wife, the services was good.  I order a Mixed Grill and Burritos for my wife, disappointed  to", "..."]},
{"author": ["pppbooma"], "content": ["Mate emu ,  peacocks , cranky rock , it's a must do ! i loved it when i found the face in the rock ,,you can see from my image it is a clear image of a face"]},
{"author": ["pppbooma"], "content": ["We often fly with Jetstar and I have to say I'm always a bit worried as to whether it will be on time or not because of other peoples experiences.. Our flight t", "..."]},
{"author": ["pppbooma"], "content": ["Perfect in every way, 5 minutes from the airport, beautiful peaceful surroundings, lovely accommodation with so many little extras. We arrived at 2 am in the ea", "..."]},
{"author": ["pppbooma"], "content": ["My husband,4 friends and I spend an amazing day with Kim and Steve on horseback, riding through the breathtaking Pokolbin area of the Hunter Valley stopping for", "..."]},
{"author": ["pppbooma"], "content": ["thank you everyone, when we book the hotel ill check with them if no luck there Ill contact you TravelAus"]},
{"author": ["pppbooma"], "content": ["Can anyone recommend someone to pick up 4 people with surfboards from airport and take to hotel in Seminyak, and an idea of how much to pay for all 4 of us.Tha", "..."]},
{"author": ["pppbooma"], "content": ["After so much research with all the companies I chose Destination Insight because for their fabulous reviews and safety history. They were happy to tailor a tou", "..."]},
{"author": ["pppbooma"], "content": ["We stayed our first night here as we flew in late and left the next morning for a overnight desert tour and then came back here the next day to fly out the foll", "..."]},
{"author": ["pppbooma"], "content": ["On our way home after a month in Italy and Greece, this hotel has been a quiet oasis to relax and then head home. Staff all lovely and attentive, pool beautiful", "..."]},
{"author": ["pppbooma"], "content": ["While driving around the island of Naxos today we came across this cute little taverna right opposite the beach, so quiet, so peaceful, not a sole in the town b", "..."]},
{"author": ["pppbooma"], "content": ["We are currently staying at Kedros Villas and we just love it here. Unfortunately the weather isn’t the best it’s really windy but we can still lie by the pool ", "..."]},
{"author": ["pppbooma"], "content": ["It is true what all the other reviews say this hotel is right in the centre of Oia but you wouldn’t know it when you are inside the walls, it is like a secret p", "..."]},
{"author": ["pppbooma"], "content": ["We stayed 3 nights in one of the apartments up in the hills with perfect views of the town and ocean. From what I can gather Affittacamere San Giorgio has accom", "..."]},
{"author": ["pppbooma"], "content": ["I really have mixed feelings about this hotel, while we loved the hotel and the gardens, the thing that really lets it down are the staff as they all seem reall", "..."]},
{"author": ["pppbooma"], "content": ["A must visit, sit and have a meal and a vino and watch the people stroll by. After spending 2 weeks in Rome and Florence it was such a joy to come to Lucca with", "..."]},
{"author": ["pppbooma"], "content": ["Our family of 3 stayed for 2 nights and this BnB is so perfect. Immaculately clean, beautiful decor, wonderful hosts, amazing breakfast of eggs, toast, hams, ch", "..."]},
{"author": ["pppbooma"], "content": ["Firstly I’m sorry if this question has been asked a hundred times, but I’m finding the cost of private tours so expensive and want to ask, will we get the most ", "..."]},
{"author": ["pppbooma"], "content": ["Hi EveryoneCould you please tell me which ferry companies go direct from Santorini to Naxos in October we want to leave on the 9 October, do they leave everyda", "..."]},
{"author": ["pppbooma"], "content": ["Thanks Heimdall, that sounds perfect"]},
{"author": ["pppbooma"], "content": ["Thats what we have decided to do, book with destination insight doing the day tour and hotel drop off, we have decided to go with Tilal Liwa Hotel a little more", "..."]},
{"author": ["Savannah_Trifiro"], "content": ["I planned a last minute surprise party at Los Grifos and I could not be happier with how it turned out. The staff was incredibly friendly and accommodating - we", "..."]},
{"author": ["Savannah_Trifiro"], "content": ["Mi novio y yo pasamos tres lindas noches en Yacumama. Aunque estaba mal yo, la  experiencia era genial. Marleny y Pavel son muy buenos guías y una pareja muy am", "..."]},
{"author": ["Savannah_Trifiro"], "content": ["My boyfriend and I stayed at Casa Cino Fabiani for just under a week. The guesthouse is in the best area of Guayaquil, walking distance from what most people te", "..."]},
{"author": ["Savannah_Trifiro"], "content": ["Wonderful wonderful homestay in Quito! My boyfriend and I were welcomed as if we were family. Our room was comfortable and the Internet connection was strong. T", "..."]},
{"author": ["Savannah_Trifiro"], "content": ["Stayed here with my mom, aunt, and cousin back in March. The staff was wonderful. They bent over backwards to make us feel welcome and were happy to assist us w", "..."]},
{"author": ["Savannah_Trifiro"], "content": ["Solid represents all that Bali has to offer, and it's the staff, pups, and space that make it so wonderful. I spent nine months living in Indonesia and visited ", "..."]},
{"author": ["Savannah_Trifiro"], "content": ["It's not often that I'll write a review, but I feel that I have to for Kundalini Villa. I stayed for two nights (not enough!) with my mom, aunt, and cousin in m", "..."]},
{"author": ["federicologuercio"], "content": ["This is a great guesthouse located in the nicest area in Guayaquil. The insides are really pretty, with a very particular, large half-open hall that is the cent", "..."]},
{"author": ["mvsunix77"], "content": ["Extremely happy with their attention and help. The room Super clean and when we needed something it was done right away. From extra pillows to a new TV, not hes", "..."]},
{"author": ["mvsunix77"], "content": ["This was my first trip to South Africa, the most eye-opening, enlightening and fantastic adventure I've had so far.  Neil made this trip so special, effortlessl", "..."]},
{"author": ["Samantha S"], "content": ["We stayed in a dorm for 3 nights total, and felt it was very clean, safe, comfortable. The owner Kevin was friendly, kind and helpful, and made us feel at home.", "..."]},
{"author": ["Samantha S"], "content": ["This hostel is spacious, clean and comfortable, and includes breakfast. It is close to the airport and bus station, which was convenient for us as we were passi", "..."]},
{"author": ["Nick P"], "content": ["Our tour guide Alex was super enthusiastic and passionate about Athens, which always makes for a great tour. He was funny/witty without being arrogant or disres", "..."]},
{"author": ["Nick P"], "content": ["Our Irish guide Mick Birmingham was enthusiastic, funny, and knowledgeable. Turned out he was a former economist which was probably why his recall of facts and ", "..."]},
{"author": ["Nick P"], "content": ["My girlfriend and I have been on a few of the Sandeman city tours and are never disappointed. Our tour of Amsterdam was no exception. Our guide was a fella name", "..."]},
{"author": ["Nick P"], "content": ["Six friends wanted to go for a day on the water with some of us wanting to dive and some more comfortable with snorkeling. We organised our trip in advance as w", "..."]},
{"author": ["Nick P"], "content": ["Our group of 10 friends went through Whanganui River Canoes for a three day freedom canoe trip. We found them to be a professional, and also very friendly,  com", "..."]},
{"author": ["Nick P"], "content": ["If you're spending a few days in Salento you should definitely make some time for a tour of the Kasaguadua Reserve. Our guide was Nicholas, the British half of ", "..."]},
{"author": ["Nick P"], "content": ["We ordered the menu of the day which was very reasonably priced for a lot of food and all of it delicious. Add plenty of salsa picante and you can't go wrong. T", "..."]},
{"author": ["Nick P"], "content": ["Stayed here two nights, and really enjoyed it. The staff are very friendly and gave us good advice on places to check out in Guayaquil. It is well situated near", "..."]},
{"author": ["Nick P"], "content": ["My girlfriend and I stayed at La Selenita for a month while we studied Spanish in Sucre. Very glad we did as it is a wonderful little boutique hostel run by a n", "..."]},
{"author": ["Nick P"], "content": ["We came to Santa Cruz solely with the hope of seeing a sloth in the wild. Nick worked hard to make that dream a reality. His enthusiasm about animals and conser", "..."]},
{"author": ["Nick P"], "content": ["My girlfriend and I went for lunch here today, after she had already been a few days before and insisted I try it. We had the menu of the day, which is ridiculo", "..."]},
{"author": ["Nick P"], "content": ["Once you've recovered from the climb up the stairs, which is only a bit tough due to altitude (but come on it's good training for Machu Picchu), you'll be at th", "..."]},
{"author": ["Nick P"], "content": ["We arrived at 5am and stayed for two nights. A tricycle taxi from outside the bus terminal cost 3 Bolivianos. The staff are friendly and helpful (though not muc", "..."]},
{"author": ["Vacation515"], "content": ["We stayed in Hotel Jira for 2 days in July 2014. One concern I had initially was that no one ever returned my call, after I left several messages regarding ques", "..."]},
{"author": ["Florence1987"], "content": ["We hebben een heerlijke vakantie gehad! Bij een resort denk je misschien een een luie relax vakantie, maar omdat we gedurende de dag steeds van het zwembad naar", "..."]},
{"author": ["Florence1987"], "content": ["Ik heb eerder gezegd dat ik de lekkerste pizza heb gegeten in Baños in Ecuador, maar deze pizza's komen toch wel erg dicht in de buurt (Diavolo en Quatro Formag", "..."]},
{"author": ["Florence1987"], "content": ["Voor onze laatste avond in Rome, wilden we een gezellig restaurantje vinden waar het personeel een beetje aardig zou doen en waar het ook nog een beetje betaalb", "..."]},
{"author": ["Florence1987"], "content": ["Met zn vieren heerlijk ontbeten met cappuccino, chocoladecroissantjes, yoghurt met cereals en vers rood fruit en poached egg met avocado en kaas voor €37. Mooie", "..."]},
{"author": ["Florence1987"], "content": ["Het was flink druk in de wijk Trastevere, er stonden soms rijen bij restaurants. We wilden eigenlijk op een terras zitten, maar lieten ons uiteindelijk overhale", "..."]},
{"author": ["Florence1987"], "content": ["We zochten een leuk tentje om te ontbijten en vonden dit kleine restaurantje. Heerlijk cappuccino (€1,50), belegde foccacia (€4,00) en croissantjes (€1,50) voor", "..."]},
{"author": ["Florence1987"], "content": ["Nadat we 2x weg zijn gelopen bij 2 restaurants in de wijk Trastevere, omdat we simpelweg onbeschoft behandeld werden en de prijzen toch wel iets te hoog waren d", "..."]},
{"author": ["Florence1987"], "content": ["In november 2017 we did the South and the North Tour on Lanzarote. We were pleasentely surprised with the South Tour. Antonio, the tourguide, was very informati", "..."]},
{"author": ["Florence1987"], "content": ["Yarden is a very nice hotel well situated in the citycenter. The staff is very friendly and willing to help you with all of your questions. The lady at the rece", "..."]},
{"author": ["Florence1987"], "content": ["We loved our first experience with this hammam! We had chosen the full package (El Almira) with bodymask, facial mask, feet peeling, foam treatment and a 45 min", "..."]},
{"author": ["Florence1987"], "content": ["Wij waren hier vorig jaar september. We wilden het dorpje Montañita eerst overslaan omdat we hadden gelezen dat het een hippie dorpje was waar veel drugs gebrui", "..."]},
{"author": ["Florence1987"], "content": ["Very nice restaurant with a lot of choices. The wafels with dulce de leche, fruit and almonds we're fantastic!"]},
{"author": ["Florence1987"], "content": ["We wanted to go to The Victor Hugo hotel next to Nantu, but we took a look at Nantu as it was looking really nice. It was much cheaper than the Victor Hugo hote", "..."]},
{"author": ["Florence1987"], "content": ["Hotel Mariane (hotel Jardin de Mariane) is a very nice hotel in baños. The rooms are spacious with nice coloured walls. We got a room for two persons with two d", "..."]},
{"author": ["Florence1987"], "content": ["When I read that these would be the best pizza's of the world, I thought that they were exaggerating, especially when I saw it was not a real restaurant, but ju", "..."]},
{"author": ["Florence1987"], "content": ["We did eat at this place a couple of times, for breakfast, lunch and diner. Tasty food and very friendly Italian owner. Really recommend this place."]},
{"author": ["Florence1987"], "content": ["Very old hotel, looks fine from the outside (at least from the front), but it is a bit of a mess inside the hotel. The beds were fine, a couple of lamellae in f", "..."]},
{"author": ["Florence1987"], "content": ["After a long search on the internet, reading a lot of reviews, we booked this hotel in Guayaquil to stay before we went to the Galapagos Islands. The rooms are ", "..."]},
{"author": ["Florence1987"], "content": ["We did visit Sweet & Coffee in one of the shoppingmalls in Guayaquil. We had some different pie and coffee (lemon pie, cuatro leches and brownie) really delicio", "..."]},
{"author": ["Florence1987"], "content": ["This hotel was included in our island hopping tour on the Galapagos Islands. It is really nice situated right on the beach of Isabela island. We were the only g", "..."]},
{"author": ["hichui"], "content": ["Came here on a recommendation from a friend with my wife and boy did it exceed expectations.  Probably some of the best crispy fries in vancouver and the mussel", "..."]},
{"author": ["hichui"], "content": ["Went around 1230 on a sunday, was not very crowded so service was very prompt.  The food quality was beyond expectation, ordering the beef teriyaki and the seaf", "..."]},
{"author": ["hichui"], "content": ["Went on a recommendation of a friend for lunch on a weekday, barely a wait and the waitress was prompt and the crab bisque was delicious. The strawberry lemonad", "..."]},
{"author": ["hichui"], "content": ["This hotel was nothing special, continental breakfast was meh, eggs a bit too salty. The room smelled moldy the 3 nights we stayed. Showers took awhile to get w", "..."]},
{"author": ["hichui"], "content": ["Came with a family of 6, the place had a diner vibe to it. The service was good even though the server spoke no english, or very little and the food was adequat", "..."]},
{"author": ["hichui"], "content": ["Came with family of 6. Mercedes and her husband were very hands off but always checked to make sure everything was good whenever we crossed paths.  The wifi was", "..."]},
{"author": ["hichui"], "content": ["Went with family of 6 because it accepted credit card, had a sign that said something along the lines of \"famous pizza\". So we ordered the giant Calypso for the", "..."]},
{"author": ["hichui"], "content": ["Booked 2 rooms for fam of 6. The beds were comfortable but the pillows were hard. The showerd had maybe a few minutes of fresh water before they became salty.  ", "..."]},
{"author": ["hichui"], "content": ["Went with just my parents, perhaps it was because my dad forced his way in before the restaraunt was actually open, but the servers were courteous enough and ok", "..."]},
{"author": ["hichui"]},
{"author": ["hichui"], "content": ["Tried to visit the concha, there was a stop sign nailed into the posts as well as wooden bars nailed across. I don't think this attraction is available anymore,", "..."]},
{"author": ["hichui"], "content": ["Went with fam of 6, we were met with adequate service and the juice and soup from the $7 set menu was actually really good. It went all downhill from there, the", "..."]},
{"author": ["hichui"], "content": ["Visited with family of 6. The service was simply put, excellent. The family was very engaging in conversation and it was very friendly. The food was decadent an", "..."]},
{"author": ["hichui"], "content": ["Went with family of 6, no one else in the restaraunt. Had a menu in spanish and english so ordering wasn't too bad. Just had to look at the spanish menu to tran", "..."]},
{"author": ["hichui"], "content": ["Came here with family party of 6. The service here was unlike the restaraunts. Our drinks and appetizers came very shortly after ordering and entreees followed ", "..."]},
{"author": ["hichui"], "content": ["Went with group of 6, we were the first table to sit down and order, drinks took about 5 minutes and the entrees took about 35 minutes to arrive. By the time ou", "..."]},
{"author": ["hichui"], "content": ["From the entrance it was about a 20ish minute walk at a brisk pace on the path to reach the beach. Once you get there it's a really nice beach, soft sand and al", "..."]},
{"author": ["hichui"], "content": ["Went with family, all 20+, on our own with no guide. A nice casual walk with some scenery and a nice view of turtles, tortoises and iguanas. However you can see", "..."]},
{"author": ["hichui"], "content": ["The food was above average quality, nothing to write home about but enjoyable. The service was okay, towards the end of the meal the servers seemed to just forg", "..."]},
{"author": ["hichui"], "content": ["The service was very subpar, patrons were friendly but the pizza took roughly 25 minutes to be delivered with minimal customers. Drinks are definitely the highl", "..."]},
{"author": ["Charlie_travels0"], "content": ["We had a great stay at this hotel. The hotel itself has lots of character and is in a very quiet location. The fact that you can walk to a beautiful lake in abo", "..."]},
{"author": ["Charlie_travels0"], "content": ["Modern, quite minimalist style hotel.  The staff were very friendly and helpful. Very clean room, really comfortable bed and blackout shutters on window. Get a ", "..."]},
{"author": ["Charlie_travels0"], "content": ["I've been having monthly massages with Ami for about a year now and always feel must looser and relaxed after the treatment. She always gets the pressure right ", "..."]},
{"author": ["Charlie_travels0"], "content": ["I would recommend this hotel firstly for its great location. It's easy to get to from the airport. Get the Airport Express (AE) bus (60kr) direct to the train s", "..."]},
{"author": ["Charlie_travels0"], "content": ["Good location being 5 mins from metro. Our double room was perfectly clean and well stocked with toiletries, hot drinks, hairdryer etc although a little small.", "..."]},
{"author": ["Charlie_travels0"], "content": ["The hostel room itself was fine for the price. Comfortable bed. No heating but enough blankets to be  warm enough at night and hot shower (when it worked). Wifi", "..."]},
{"author": ["Charlie_travels0"]},
{"author": ["Charlie_travels0"], "content": ["There are many hikes to do in the Cajas National Park. I chose to do the shorter 2 hour walk around Laguna Toreadora which was stunning on every turn. I got the", "..."]},
{"author": ["Charlie_travels0"], "content": ["Myself and partner stayed in room 15 at the back of the hotel. The room was pretty good, very clean and spacious for two of us and two big windows making it lig", "..."]},
{"author": ["Charlie_travels0"], "content": ["This seemed a very rustic hostel. Ok for people on a budget for one night, which was $30 for a double by galapagos standards. Tiny bathroom, I had to poke my kn", "..."]},
{"author": ["Charlie_travels0"], "content": ["Stayed in a double room for one night as a quick stopover. Hotel overall very clean. On a noisy road which is probably the same throughout the city centre so ea", "..."]},
{"author": ["Charlie_travels0"], "content": ["We had an American breakfast and giant smoothie sitting outside which were great. Service was quick and friendly. Wifi here too which works ok."]},
{"author": ["Charlie_travels0"], "content": ["Stayed here for 2 nights and the hotel was almost perfect. The building is a beautiful old house full of character with very high ceilings, my room and bathroom", "..."]},
{"author": ["Charlie_travels0"], "content": ["Spent 1 week at Grafton from 29/03/04. I've never been on an all inclusive holiday or to the carribean before going to Tobago so I may be a bit naive but I coul", "..."]},
{"author": ["TBoneTX"], "content": ["After lunching at Rita's Mexican Restaurant some months ago, I took the family for dinner on Sunday, 1 September 2019.  This was a \"miniature road trip\" for us.", "..."]},
{"author": ["TBoneTX"], "content": ["While visiting from Houston, I met a friend here for \"Mexican\" food on a Sunday night.  The restaurant looks OK from the outside and has adequate parking, but t", "..."]},
{"author": ["TBoneTX"], "content": ["This 7-Eleven is on the corner of two busy interior highways.  It's next to the Econolodge, separated by a high wall.  My car was covered with pollen and bug-sp", "..."]},
{"author": ["TBoneTX"], "content": ["Highly Acceptable StayI stayed at the \"Econolodge near the Domain - The Arboretum\" in north Austin on the one night of Sunday, 24 March 2019.  The corporate b", "..."]},
{"author": ["TBoneTX"], "content": ["I stayed at the Country Inn & Suites - Coralville over the 3 nights of Thursday-Saturday, 10-12 August 2017.  The reservation was made on the Carlson website in", "..."]},
{"author": ["TBoneTX"], "content": ["This Culver's is within half a mile of the east & west entrance ramps to Interstate 80.  It's next door to the Country Inn & Suites.I had a late lunch/early d", "..."]},
{"author": ["TBoneTX"], "content": ["Thanks so much, Adiana!  Sorry for the extra submissions.*** The listing should be under \"hotels,\" not \"specialty lodging.\" ***If I can't figure out how to cl", "..."]},
{"author": ["TBoneTX"], "content": ["I stayed at the Lake Mills Motel over the night of Tuesday, 8 August 2017.  This 8-room motel is 3 or 4 blocks north of State Highway 9.  I'm not sure why TripA", "..."]},
{"author": ["TBoneTX"], "content": ["I ate dinner here on the eve of 8 August 2017.  I had a plate of chicken enchiladas with rice and beans, and a soda.  The portion size was generous.  The waiter", "..."]},
{"author": ["TBoneTX"], "content": ["I stayed at the Super 8 Oelwein over the night of Wed., 9 August 2017.  I had reserved my room through the Wyndham website in May.  My check-in was very smooth.", "..."]},
{"author": ["TBoneTX"], "content": ["I ate dinner at the Pizza Ranch on 9 August 2017.  Many locals were entering, which was positive.  The buffet price seemed higher than I was used to; however, t", "..."]},
{"author": ["TBoneTX"], "content": ["Last night (8/22/17), I tried multiple times to submit a new hotel listing, because I had a review ready to post.  However, when I clicked \"submit,\" the box for", "..."]},
{"author": ["TBoneTX"], "content": ["Thanks for your meaningful input.  I look forward to hearing from TA in regard to these uncertainties."]},
{"author": ["TBoneTX"], "content": ["As a completely exhausted traveler, I ate dinner at the Ice House on the eve of Sunday, 6 August 2017, at the recommendation of the manager of the nearby Celebr", "..."]},
{"author": ["TBoneTX"], "content": ["I stayed at the Celebrity Inn over the night of Sunday, 6 August 2017.  Anxious to plan my weeklong trip around Iowa early, I reserved by phone on May 22.  Pegg", "..."]},
{"author": ["TBoneTX"], "content": ["I stayed in the Travelodge Denison over the night of Monday, 7 August 2017. I reserved online in May through the Wyndham website.  After reading the doom-and-gl", "..."]},
{"author": ["TBoneTX"], "content": ["I had dinner here at around 5p on Monday, 7 August 2017.  The chips & salsa were better than at most places, and the plate of chicken enchiladas (with rice, bea", "..."]},
{"author": ["TBoneTX"], "content": ["The Super 8 - San Antonio I-10 East is at 222 S. WW White Road (S. Loop 13), San Antonio, TX 78219.  The Wyndham Hotels website lists an incorrect address.The", "..."]},
{"author": ["TBoneTX"], "content": ["The Super 8 Weslaco has been shockingly underrated on TripAdvisor among motels in Weslaco.  It compares favorably with the (also very good) Weslaco Inn and (in ", "..."]},
{"author": ["TBoneTX"], "content": ["This seemingly new hotel is spotless in every way.  The design, decor, maintenance, and cleanliness rival that of any 5-star hotel in a large city.  The staff w", "..."]},
{"author": ["Coronel72"], "content": ["I decided to stay here after a disastrous night at  El Cafecito.  This hostel was recommended by the Lonely Planet guide book.  I paid $18/ night for a room wit", "..."]},
{"author": ["Coronel72"], "content": ["I paid $54.90/night for 2 nights for a room w/private bathroom & cable TV.  The hotel is located right on the Malecon which is Guayaquil's only real tourist des", "..."]},
{"author": ["Coronel72"], "content": ["I must admit this was not my 1st choice.  Unfortunately, when you use the \"name your own price\" option on Priceline, you do not know where you're staying until ", "..."]},
{"author": ["Coronel72"], "content": ["I paid $65/night for 2 nights.  I had stayed here back in '02 and not much had changed except for the price. The rooms are unremarkavle but clean. The bathrooms", "..."]},
{"author": ["Coronel72"], "content": ["I find it amusing how Hampton Inn is considered a 3 star chain in the U.S. but in Ecuador it is considered a 5 star hotel.  I paid $91/night for 2 nights (Thurs", "..."]},
{"author": ["Coronel72"], "content": ["I travel frequently to Guayaquil and I wanted to stay near the Malecon and Zona Rosa, which is the bar/nightclub area so I decided on the Ramada. The staff is g", "..."]},
{"author": ["Coronel72"], "content": ["I had just stayed at the Ramada but refused to pay $86 per night for an average hotel so I sought a cheaper option. The Rizzo was recommended by the Lonely Plan", "..."]},
{"author": ["CK_traveller8"], "content": ["We went to enjoy the beer and the food at Zum Schlussel last night and ended up being charged much more than we actually drank!  The counting of the beer glasse", "..."]},
{"author": ["CK_traveller8"], "content": ["Good friendly stuff, service was good.  The building is really old so are the rooms - so you cannot expect much for good facilities but this hotel is in a safe ", "..."]},
{"author": ["Binkynz"], "content": ["Four of us dined there for dinner. The special included an alcoholic drink and was delicious. The steak was cooked just right. Wine list was limited but what we", "..."]},
{"author": ["Binkynz"], "content": ["Typical small town NZ pub from yesteryear that is in need of refurbishment. It's run down and tired. We didn't eat there as there were more attractive looking p", "..."]},
{"author": ["Binkynz"], "content": ["We arrived late afternoon after a long, hot and windy cycle ride on a dusty trail. The owner Robin met us with cold beers! He even offered to transport us back ", "..."]},
{"author": ["Binkynz"], "content": ["Fairly new establishment just off the main road with an adjacent bar/function facility. No frills but all you need for a comfortable stay. Rooms have a basic ", "..."]},
{"author": ["Binkynz"], "content": ["We were attracted to this small bar/restaurant by the talented acoustic guitar duo playing outside in the lane and decided to pause for a drink to enjoy the mus", "..."]},
{"author": ["Binkynz"], "content": ["Stumbled across this place whilst looking for a quick meal before a movie. The service was quick and friendly despite it being quite busy. We were told that the", "..."]},
{"author": ["Binkynz"], "content": ["We booked a one hour tour of Stewart Island and was met by a pleasant lady who escorted us to her mini bus. We were taken to all the places of note and she pr", "..."]},
{"author": ["Binkynz"], "content": ["We took the ferry from Bluff to Oban. Staff at Bluff were very helpful and friendly and Chris who was the skipper was a delightful character who certainly had n", "..."]},
{"author": ["Binkynz"], "content": ["Want to visit the real New Zealand? Get yourself to Pukehina Beach and try the Hippy Pipi pub/restaurant. You won't get 5th Avenue or Parisenne cuisine or upmar", "..."]},
{"author": ["Binkynz"], "content": ["Three of us had dinner there.  I ordered the seafood chowder which tasted burnt.  I don't normally complain about food but the waitress asked how it was so I to", "..."]},
{"author": ["Binkynz"], "content": ["If it's possible to get a rating higher than 5 stars then this place deserves it. Hosts Allan and Margaret's home is as near to perfection as you could hope for", "..."]},
{"author": ["Binkynz"], "content": ["A themed restaurant wonderfully set up and run by very talented performers who seem to do everything from running the car park to displaying their amazing talen", "..."]},
{"author": ["Binkynz"], "content": ["I wasn't expecting much for the price we paid for a hotel within walking distance of the main attractions and I wasn't disappointed. The hotel is small and cram", "..."]},
{"author": ["Binkynz"], "content": ["Located on the main thoroughfare into Oia and one of the first you come to, this restaurant is like any of the others with good food and fantastic views. Just d", "..."]},
{"author": ["Binkynz"], "content": ["We chose this place due to it's Bartercard connection so for me it was great value. You couldn't get any closer to the best that New Plymouth has to offer. Rest", "..."]},
{"author": ["Binkynz"], "content": ["In summer at night it's an enchanted kingdom. An oasis of natural New Zealand beauty in the heart of a bustling city. New Plymouth's version of New York's Centr", "..."]},
{"author": ["Binkynz"], "content": ["Take the gondola to the top of the mountain, on the way up, you might catch a glimpse of Bou the Grizzly bear who lives in his own little paradise enclosure ben", "..."]},
{"author": ["Binkynz"], "content": ["Located just on the edge of the Art Deco centre of Napier, which has to be one of the most interesting cities in the world for it's concentration of low rise Ar", "..."]},
{"author": ["Binkynz"], "content": ["Loved the central location across the road from Hagley Park and handy to the city. A nice touch was the free use of cycles which allowed us to tour the city eas", "..."]},
{"author": ["Binkynz"], "content": ["I was alarmed enough at my first view of the hotel to request a look at the room before confirming my booking. From the outside it looked like a Soviet-era ammu", "..."]},
{"author": ["samuel2samuel"], "content": ["Bussen var försenad till Cityterminalen. Riskerade bli sen till flyget så det fick bli Arlanda express i stället"]},
{"author": ["samuel2samuel"], "content": ["Fantastiska Thai-tapas, oxkinden i massaman curry var en grym smakupplevelse. Fräscht och ambitiöst presenterat. Tyvärr inget alkoholtillstånd än (dec -17), men", "..."]},
{"author": ["samuel2samuel"], "content": ["Sushi i Stockholm brukar generellt vara bra men detta känns som en låda färdigsushi som du köper på ICA. Små bitar och undermåliga råvaror. Den trevliga service", "..."]},
{"author": ["samuel2samuel"], "content": ["The family suite was fantastic. 2 very spacious rooms joined by a big bathroom in an old fortified farm. Emilie and Florian are super nice people and helped us ", "..."]},
{"author": ["samuel2samuel"], "content": ["The pizzas were very nice indeed. A backyard restaurant (or frontyard) by the river, outside an old mill. The house bottled red wine was pretty average and came", "..."]},
{"author": ["samuel2samuel"], "content": ["Anything but a 5 star rating for this fantastic place is a joke. Francesco cooked a set menu for us consisting of the best ravioli I've ever tasted, a delicious", "..."]},
{"author": ["samuel2samuel"], "content": ["Intim och genuin matupplevelse, mycket trevligt. Vissa rätter var mer roliga än goda men topparna var grymt höga! Lite väl mycket gålever för mig. Vinpaketet va", "..."]},
{"author": ["samuel2samuel"], "content": ["An old colonial buildning, turned into a theatre/cultural venue which is also used to accommodate travellers. Arnaldo is a great host, his great grandparents or", "..."]},
{"author": ["samuel2samuel"], "content": ["Top company! Caroline did really make an effort to get me the best possible dives during my short stay in Key Largo. Wayne was a great diving buddy and guide, I", "..."]},
{"author": ["samuel2samuel"], "content": ["Wow! Kul med en riktigt bra restaurang i ett hörn där sportbarerna har avlöst varandra under tio år. Otroligt vällagad mat med råvaror i toppklass. Trevlig och ", "..."]},
{"author": ["samuel2samuel"], "content": ["This is the best fast food in Stockholm. Not for romantic dinner. Swedish touch on a classic fast food menu, eco-style. Very good value AND you can even have a ", "..."]},
{"author": ["samuel2samuel"], "content": ["Mycket bra kök, sofistikerat, matsal med vardagsrumskänla, cool toa. Perfekt neutralt ställe som de flesta skulle uppskatta om du behöver föreslå något som ska ", "..."]},
{"author": ["Brittany T"], "content": ["This restaurant ended up being our favorite in Cuba!  The outdoor rooftop patio provides a beautiful view of the sunset and the city.  We ordered lobster and sh", "..."]},
{"author": ["Brittany T"], "content": ["Beautiful restaurant with a lot of history. The food was good and the staff were incredible.  Very nice and attentive. The sangria was great!"]},
{"author": ["Brittany T"], "content": ["What an incredible place!! This guesthouse is in the best location close to a ton of bars and restaurants and a short walk to Malecon.  The staff was extremely ", "..."]},
{"author": ["Brittany T"], "content": ["Great location right on the beach!  A short walk to the town but far enough that it's quiet and peaceful at night when things get crazy.  Great breakfast and cl", "..."]},
{"author": ["Brittany T"], "content": ["This hotel is a cute quiet place located on the edge of town.  Super close to everything, you can walk anywhere in 15 minutes.  The staff was great and super he", "..."]},
{"author": ["Brittany T"], "content": ["We did the 1 day Mekong delta tour with Mr Handsome Vu and absolutely loved it!!  Very authentic and Vu made the day great, I would highly recommend Jason SSS!!", "..."]},
{"author": ["Brittany T"], "content": ["This restaurant lives up to the hype!  Every dish was excellent and interesting. Don't miss it when you're in Cartagena!"]},
{"author": ["Brittany T"], "content": ["This is definitely one of my favorite bars in the world.  The ambiance is incredible, the music is perfect and there's no better place to watch the sunset in Ca", "..."]},
{"author": ["Ian S"], "content": ["Fuimos solo por el drink de bienvenida del hotel y ahora tengo que completar los 100 caracters que tripadvisor exige."]},
{"author": ["Ian S"], "content": ["The Guesthouse was very comfortable, with a great breakfast and a relaxed common area to share with other travellers and the very friendly staff and the owner. ", "..."]},
{"author": ["Ian S"], "content": ["Great place to spend some relaxing days surrounded by nature but also as a start point for doing day tours or longer ones. The location is beautiful, the facili", "..."]},
{"author": ["Ian S"], "content": ["Comfortable bungalows, beautiful garden, great kitchen, nice staff! Its located less than 5 minutes walking from everything in Cahuita: Bus station, supermarkts", "..."]},
{"author": ["katarzynam383"], "content": ["A-day-trip to the waterfalls was a fantastic experience. We had an opportunity to admire the nature with the help of our friendly, helpful and knowledgeable gui", "..."]},
{"author": ["katarzynam383"], "content": ["Casa Cino Fabiani is an exellent place to stay while in Guayaquil. It's located in the very heart of of the city, close to all the tourist attractions in a very", "..."]},
{"author": ["Theo_10101"], "content": ["We had an amazing time on our liveaboard to the Similan Islands with Loma Diving. Everything was smooth and well-organised. The equipment was in great condition", "..."]},
{"author": ["Theo_10101"], "content": ["If you're looking for a change from anonymous chain hotels and high-rise condos, this is the place for you. The building and decor are beautiful, with lovely li", "..."]},
{"author": ["Theo_10101"], "content": ["If you love Bhutanese food or have always wanted to try it, this is the place to go. The momos and ema datshi are amazing, and the menu is extensive. It's a rel", "..."]},
{"author": ["Theo_10101"], "content": ["Everything about this experience was awful. The receptionist was extremely rude, kept making racist comments about us in Thai to her colleagues, and had an inti", "..."]},
{"author": ["Theo_10101"], "content": ["Because of the lockdown, we haven't been able to visit in person, but the ribs, burger and chips we ordered we absolutely fantastic. Andy also went to the troub", "..."]},
{"author": ["Theo_10101"], "content": ["We ended our honeymoon with a stay at asDunas, and it was the highlight of the whole trip. Fabio and Elena have created a really magical place -- starting with ", "..."]},
{"author": ["Theo_10101"], "content": ["This little place is incredibly deceptive. The front of the restaurant is just your bog standard, utterly terrible fake British 'Chinese' food--soppy, sugary ru", "..."]},
{"author": ["Theo_10101"], "content": ["A stay at this hacienda is a journey to another another side of Ecuador, and to another time. The hacienda is dripping with history--from the striking Incan wal", "..."]},
{"author": ["Theo_10101"], "content": ["Perhaps because of the excellent reviews this hotel has received in the past, our expectations were very high. In fact, it was perfectly adequate, but absolutel", "..."]},
{"author": ["Theo_10101"], "content": ["This is the sort of place you always hope to find when you're backpacking, but which rarely materialises. No ordinary guesthouse, it's been converted from a vil", "..."]},
{"author": ["Theo_10101"], "content": ["I can't say enough good things about Mandala. It is a tranquil, lovely place on a quiet end of the beach, with fantastic food and brilliant service. But it is a", "..."]},
{"author": ["Theo_10101"], "content": ["Having been to a couple of spas in Cuenca, this was by far the best. The decor is lovely and well-designed, there are lots of different spa treatments and the s", "..."]},
{"author": ["Theo_10101"], "content": ["This place, which is more of a boutique hotel than an agriturismo, is beautifully designed, with a lovely swimming pool, and friendly staff. However, our room h", "..."]},
{"author": ["Theo_10101"], "content": ["If you've lived in China and you're ever nostalgic for the Xinjiang noodle shops, this place is like heaven. Not only is the food itself delicious and authentic", "..."]},
{"author": ["Theo_10101"], "content": ["If you've not yet seen a play here, you're missing out. The building itself is a beautiful reconstruction, and it helps bring alive the shakespearean production", "..."]},
{"author": ["Theo_10101"], "content": ["Far from the bustle of central London, many people have yet to discover Greenwich's charms, but it's really one of the best bits of London. You can stroll along", "..."]},
{"author": ["Theo_10101"], "content": ["Chinatown used to be the preserve of fakey British-style 'Chinese' restaurants and seedier establishments. But as people become more familiar with Chinese food,", "..."]},
{"author": ["Theo_10101"], "content": ["The Garrick is what you'd expect, really -- the coffee is good enough, the cakes and sandwiches are decent. But the decor and atmosphere are very LSE. In a word", "..."]},
{"author": ["Theo_10101"], "content": ["The LSE is of course one of the world's top rated universities. But it's not known for the beauty or historical value of its campus, which is just a jumble if o", "..."]},
{"author": ["Theo_10101"], "content": ["This café is part of a set of local projects to save and preserve elements of Bedzin's forgotten Jewish past. The café itself has been beautifully decorated as ", "..."]},
{"author": ["itstheresapr"], "content": ["Auf der Suche nach Frühstück sind wir um 13:50 hier herein gekommen (Frühstück bis 14 Uhr). Leider wurde uns gesagt dass wir zu spät wären und die Küche jetzt (", "..."]},
{"author": ["itstheresapr"], "content": ["Nette Begrüßung durch das Rezeptionspersonal, unkomplizierte Gepäckaufbewahrung, gute Tipps für den Wienaufenthalt und am nächstes Morgen ein ausgezeichnetes Fr", "..."]},
{"author": ["itstheresapr"], "content": ["A friend and me (both Divemaster) decided to do Angelita and Dos Ojos with CX. He had been there before and described them as „family“. As soon as I arrived I u", "..."]},
{"author": ["itstheresapr"], "content": ["The vegetarian Ramen and the Falafel Pita were excellent. The service was slow but that is part of their concept and we were in no rush, so that’s fine. You can", "..."]},
{"author": ["itstheresapr"], "content": ["The Inn was my last chance after cruising the city in need of a bed to stay in. Thank god they managed to clear a bed for me. I really enjoyed staying here. The", "..."]},
{"author": ["itstheresapr"], "content": ["I ran into the coffee shop by accident and ended up staying way longer than expected. First of all because the food, I had the egg patty with fresh basil and a ", "..."]},
{"author": ["itstheresapr"], "content": ["I discovered the hidden coffee place through asking where to get the best coffee on the island. They were right. So that, pared with an ocean view, a very consc", "..."]},
{"author": ["itstheresapr"], "content": ["I came to UDC, where I did my OW and AOW two years ago, because I wamted to do my Divemaster. I tried other places before but in the end decided to go back wher", "..."]},
{"author": ["itstheresapr"], "content": ["I came here because I wanted to sit on the beach and returned because of the friendly service and good coffee. I got welcomed with a smile and a coffee shot to ", "..."]},
{"author": ["itstheresapr"], "content": ["I loved my stay there. The hostel is an old house and so it still has the heigh ceilings, wooden floor and this really special atmosphere. The employees are ju", "..."]},
{"author": ["itstheresapr"], "content": ["I was looking everywhere for vegetarian Tamales- here I found them. And they were amazing, for a reasonable price. Also the service was really good, fast and fr", "..."]},
{"author": ["itstheresapr"], "content": ["I had an awesome time at UDC. Doug and Will were the best instructors one can wish for, the staff was super friendly and fun and I had a lot of days and nights ", "..."]},
{"author": ["itstheresapr"], "content": ["The quality of the food was great, the service really good and the Portion big enough. We ordered 2 Maki rolls each and almost couldn't finish it (you get 10). ", "..."]},
{"author": ["itstheresapr"], "content": ["I came here because of the reviews that declared this the \"Best Hostel in Cancún\", and I wasn't disappointed. Good and free good, fun games at night, beach at d", "..."]},
{"author": ["447whitney"], "content": ["LOVED this place! Gorgeous architecture and decor - very rustic and colorful. The location is also fantastic - it's situated in a historic and beautiful neighbo", "..."]},
{"author": ["Paul C"], "content": ["Yes indeed, I don't need a visa. Well if that's so, all the better. Thank you!"]},
{"author": ["Paul C"], "content": ["I thought so!"]},
{"author": ["Paul C"], "content": ["This was a great place to stay! Yamil the owner is super chilled, offers great talks and prepares amazing pisco sour. Rooms and beds comfortable, all in all gre", "..."]},
{"author": ["Paul C"], "content": ["This was a great place to stay! Yamil the owner is super chilled, offers great talks and prepares amazing pisco sour. Rooms and beds comfortable, all in all gre", "..."]},
{"author": ["Paul C"], "content": ["Hello trip family! I have searched for this and couldn't find anything. I am wondering if I could show my PayPal balance as a proof of funds when travelling to ", "..."]},
{"author": ["Paul C"], "content": ["My girlfriend and I stayed at Cino Fabiani's for 3 nights before going to Cuenca. Very pleased to find a fully unconventional, old colonial style heritage house", "..."]},
{"author": ["Paul C"], "content": ["Hostal del Mar is not your regular hostel. If you like breakfasts on a balcony with an amazing waterfront view, open kitchen with a lovely garden, kayaks to exp", "..."]},
{"author": ["Paul C"], "content": ["The rooms are okay, comfortable beds (it's super hot in Puerto Jimenez, so staying in the rooms upstairs during the afternoon can be hard, better hang outside a", "..."]},
{"author": ["Paul C"], "content": ["Bernardo and his family are super welcoming and kind, they will help you find out what to do around Masaya depending on your interests. The place is a nice fami", "..."]},
{"author": ["Paul C"], "content": ["The place is a nice Spanish old colonial style house, with center garden. The location is good, close to central park and cathedral. Price is affordable and sta", "..."]},
{"author": ["Paul C"], "content": ["The owner and her staff are kind. The breakfast included option is good, but if you have a big stomach (haha) consider getting some fruits or cereal on the supe", "..."]},
{"author": ["Paul C"], "content": ["The beaches around Las Peñitas are huge, the water pushes back a lot of sand and sculpts a wide sand corridor. Very Nice. Nothing much to do regarding partying.", "..."]},
{"author": ["Paul C"], "content": ["We had some trouble finding the place because the maps.me app (offline map) showed the place was located at the outskirts of town, near the graveyards and the t", "..."]},
{"author": ["Paul C"], "content": ["Pintoresco lugar para comer, alojarse y disfrutar de una visita agradable en Gracias, Lempira donde hay mucho que ver. Adecuado para mochilear, cuentan con guía", "..."]},
{"author": ["Paul C"], "content": ["Un lugar acogedor, lleno de arte y música excelente para disfrutar del pueblo hermoso de Gracias, Lempira. Gente hermosa y un ambiente hogareño lo hacen un luga", "..."]},
{"author": ["s0l0traveler11"], "content": ["One of the safest parts of Guayaquil in a beautiful wooden property, reliable Wifi, close to Malecon where you can walk safely later at night. Las peñas has a g", "..."]},
{"author": ["rapha_y_nici"], "content": ["Die Auberge de Chindonne haben wir als letzte Station unseres Dents-du-midi Treks besucht und waren vom Restaurant und der Herberge begeistert. Vorallem Edward ", "..."]},
{"author": ["rapha_y_nici"], "content": ["Wirklich eines der solidesten Hostels, in welchem wir je waren. Es stimmt einfach alles und der Preis ist für CH-Verhältniss ebenfalls fair. Vorallem das inkudi", "..."]},
{"author": ["rapha_y_nici"], "content": ["Einerseits ist die 360-Grad Sicht sehr spektakulär, vor allem die beiden kostenlosen Ferngläser sind sehr hilfreich bei der Identifikation der Gipfel (bei gutem", "..."]},
{"author": ["rapha_y_nici"], "content": ["Wenn mann in der Region ist, sollte man sich natürlich auch diese Aussicht nicht entgehen lassen, entweder per Bahn oder auch per schöner Wanderung von der Tals", "..."]},
{"author": ["rapha_y_nici"], "content": ["Haben während unseres Aufenthaltes die Alp Grüm mehrfach mit dem Zug passier und sind auch einmal ausgestiegen für einen kurzen Spaziergang. Wir würden das näch", "..."]},
{"author": ["rapha_y_nici"], "content": ["Everything has been reviewed already in other comments but, what we like to mention specifically is the friendly service even during rush hour. And reasonable p", "..."]},
{"author": ["rapha_y_nici"], "content": ["Fantastisches Essen in wunderbarer Atmosphäre bei bestem Service zu fairen Preisen im Herzen einer einzigartigen Region, was will man mehr, sehr empfohlen. Das ", "..."]},
{"author": ["rapha_y_nici"], "content": ["Ein bisschen Italinità, das Zentrum des Tals aber auch die Umgebung, einfach wunderbar entspannt. Ob für schöne Wanderungen oder gemütliches Relaxen in einem Re", "..."]},
{"author": ["rapha_y_nici"], "content": ["Definitely worth a visit and easily accessible from the SAC hut Saoseo which invites for a relaxed drink or meal, also recommended. In the morning hours the Sao", "..."]},
{"author": ["rapha_y_nici"], "content": ["Die Hütte, aber vorallem das Bewartungs-Team um Roberto ist einfach top! Wir haben super lecker und auf Wunsch angepasst an uns angepasst gegessen, einfach Klas", "..."]},
{"author": ["rapha_y_nici"], "content": ["Even this majestic glacier has decreased it‘s size drastically, it‘s definitely still worth a visit! It‘s easily accessible by hike either from Pontresina or ev", "..."]},
{"author": ["rapha_y_nici"], "content": ["Haben das Val Roseg über 3 Tage hinweg während dem Bernina-Trek Anfang Juli durchwandert. Unbedingt besuchenswert mit den tollen SAC-Hütten Coaz und Tschierva, ", "..."]},
{"author": ["rapha_y_nici"], "content": ["Haben in dieser tollen Hütte während dem Berninatrek übernachtet. Wir möchten hier insbesondere das sehr leckere Essen und die wunderbare Gastfreundschaft von U", "..."]},
{"author": ["rapha_y_nici"], "content": ["Von A bis Z einfach nur genial! Ursula und Ruedi sind wunderbare Gastgeber und kochen einfach top, wir haben uns richtig wohlgefühlt nach der fordernden Etappe ", "..."]},
{"author": ["rapha_y_nici"], "content": ["Von Madulain ist es ein gemütlicher Aufstieg mit ca. 800hm Aufstieg, welcher auch für Familien gut machbar sein sollte. Haben diese Hütte als Erste auf dem Bern", "..."]},
{"author": ["rapha_y_nici"], "content": ["Endlich haben wir die Wanderung auf den Säntis einmal gemacht. Die Wanderung ab Schwägalp war nicht ganz ohne, einigermassen steil und teilweise recht schmal, a", "..."]},
{"author": ["rapha_y_nici"], "content": ["Jetzt nicht unbedingt genau mein Lokal, aber dennoch einen Besuch wert, wenn man im Niederdorf ist. Immer wider kulturell ein Erlebnis, deshalb für Einheimische", "..."]},
{"author": ["rapha_y_nici"], "content": ["Wie man es kennt, solider Service, gemütliches Ambiente und für Bierliebhaber sicherlich eine gute Adresse. Würde ich sicherlich weiterempfehlen, gerne wieder."]},
{"author": ["rapha_y_nici"], "content": ["Great service, very friendly and efficient. Food was very good and of decent quantity. For tourists but as well for locals would always recommend it. Great rest", "..."]},
{"author": ["rapha_y_nici"], "content": ["Das Bier ist gut, das Ambiente ist top wie man es kennt, die Bedienung hat es manchmal vielleicht ein wenig schwer, wir kommen natürlich trotzdem wieder. Immer ", "..."]},
{"author": ["Anca Elena G"], "content": ["I had the vintage room, with a hamok, really authentic with old furniture. The house is a traditional one, very well kept, in the heart of the historical centre", "..."]},
{"author": ["Anca Elena G"], "content": ["Best option for vegetarians with vegan options too, really pleased to came across. The salad bar was the best part of it"]},
{"author": ["Anca Elena G"], "content": ["Cosy atmoshere with great English books and videos.  Tasty food with many vegetarian and organic choices"]},
{"author": ["Anca Elena G"], "content": ["Good food and enjoyable place with very friendly service; looking forward to get back to them when arrivin again in Brussels"]},
{"author": ["Mathnawi"], "content": ["Best vegan pizza and best Burmese salad I've had. Amazing tangy, fermented tempeh. So good. The brownie is lovely too and the owner is charming, friendly and in", "..."]},
{"author": ["Mathnawi"], "content": ["I highly recommend Greenleaf. The your was absolutely excellent with highly a knowledgeable and friendly guide. We saw and learned about lots of animals: the gi", "..."]},
{"author": ["Mathnawi"], "content": ["I highly recommend Greenleaf. The your was absolutely excellent with highly a knowledgeable and friendly guide. We saw and learned about lots of animals: the gi", "..."]},
{"author": ["Mathnawi"], "content": ["Highly recommend this lovely place with peaceful view. Food is delicious, healthy, good value and it's great cause: supporting adults with disabilities into wor", "..."]},
{"author": ["Mathnawi"]},
{"author": ["Mathnawi"], "content": ["One of the tastiest meals I've had in a while. Quinoa bowl was lovely as was Golden Milk. Great value and very nutritious. Friendly staff too. I'll be back!"]},
{"author": ["Mathnawi"], "content": ["Delicious food! Friendly service. Cool rooftop balcony. The Badass bowl was amazing and really enjoyed the black (carbon activated) lemonade too. I'll be back!"]},
{"author": ["Mathnawi"], "content": ["Creative and delicious food. Very good value and super friendly owner/chef. The Supreme is good for big appetite. Everything we tried was great. Free WiFi "]},
{"author": ["Mathnawi"], "content": ["I've been to Sunny Yoga several times and always met with high quality teaching and workshops. From Chris' Hatha, George's handstand workshop and of course Sunn", "..."]},
{"author": ["Mathnawi"], "content": ["Great shake and delicious Penang and fried cashews. Run by a sweet family. Highly recommended. Ka pun kaap! "]},
{"author": ["Mathnawi"], "content": ["Very tasty buffet with half a dozen dishes. Healthy, clean food. Pleasant Kirtan music and bhajans play in a relaxed environment. Kombucha is very tasty too. "]},
{"author": ["Mathnawi"], "content": ["I tried the mushroom chick burger and it was delicious, especially the cashew tatziki. It is a cool, breezy and relaxing place to hang out. "]},
{"author": ["Mathnawi"], "content": ["Good rooms, good brekkie. Wifi abysmal. I got stick here for a day when Air Asia canceled my flight. Great location for the airport. Very comfy beds. It wants m", "..."]},
{"author": ["Mathnawi"], "content": ["Family atmosphere, best fish stew I've had in Bahia. It's a warm, friendly place. Highly recommended! "]},
{"author": ["Mathnawi"], "content": ["Go! It's unforgettable! Look out for llamas, foxes, Vicuña, flamingos, Andean rabbits (look like wallabies). Fun to take props for the salt flat pics. Read revi", "..."]},
{"author": ["Mathnawi"], "content": ["I did a two night three day tour to Uyuni with drop off at San Pedro de Atacama. Yan's,  a company in La Paz I trusted,  booked me with Sol de Mañana who had ve", "..."]},
{"author": ["Mathnawi"], "content": ["Lola's is hip, fun and funky. And cozy. Best place for a boogie in San Pedro. Some staff can be a bit snooty and the service is slow though. I left my bag there", "..."]},
{"author": ["Mathnawi"], "content": ["Loved this place and returned twice (they also let me leave my bags at no cost). One of the friendliest hostels I've stayed in (partly because the wifi is a bit", "..."]},
{"author": ["Mathnawi"], "content": ["An absolute gem. An oasis in the city for a deep recharge. But near restaurants and bars and a good supermarket so you can cook (good kitchen). The gardens are ", "..."]},
{"author": ["Mathnawi"], "content": ["Very healthy and tasty vegan/Hare Krishna food. Good salad bar, soup and main meal with juice and tea and a dessert for a good price. Highly recommend. "]},
{"author": ["Kate B"], "content": ["We enjoyed our stay with Lucille, Jonathan and Ollie very much. The weather visiting Golden was hot and the air smoky due to wildfires raging in BC's forests.", "..."]},
{"author": ["Kate B"], "content": ["The owners are clearly very committed to the wellbeing of the wolves, the conservation of their habitat, and providing guests with a genuinely interactive exper", "..."]},
{"author": ["Kate B"], "content": ["Three of us joined Glacier for the Whitewater Express journey on a hot and busy Tuesday. Our guide, Nat, was skilled, experienced, fun and enthusiastic. We foun", "..."]},
{"author": ["Kate B"], "content": ["The Island's patio became our go-to place to eat in Golden while we were there for a week. A solid, varied menu with well-prepared food and something for everyo", "..."]},
{"author": ["Kate B"], "content": ["We were so lucky to have booked Casa El Eden. Mario and Blanca look after all their guests as if they are their own family. We arrived very late after a long jo", "..."]},
{"author": ["Kate B"], "content": ["We visited Antarctica a few years ago and had a passport stamp from el fin del mundo, so we thought it would be fund to get one from la mitad del mundo. I'm not", "..."]},
{"author": ["Kate B"], "content": ["When you are starving and there literally isn't a restaurant open on a Sunday night in Ecuador, there is nothing better than a Pizza from Pizza Zu! Seriously, i", "..."]},
{"author": ["Kate B"], "content": ["But we liked it anyway. One knock was that they weren't serving any food (at least at the time) and there is little apart from beer on the drinks menu. Two of u", "..."]},
{"author": ["Kate B"], "content": ["We liked La Purisima so much we went back twice. The food was outstanding. We had many varied items from the menu - all of them delicately flavoured and perfect", "..."]},
{"author": ["Kate B"], "content": ["To enjoy Capilla del Hombre, I needed to understand the man himself and the social history in which he worked. Luckily, the Guayasamin Museum and the Capilla de", "..."]},
{"author": ["Kate B"], "content": ["Four of us traveled to Sani Lodge last December for a 4day/3night trip. The itinerary was packed - 2 hikes per day for 3 of the days, and a \"creepy crawly tour\"", "..."]},
{"author": ["Kate B"], "content": ["It's honestly like they can't do enough for you at Posada Mirolindo. Laundry? No problem! arrange a drive to town? No problem! Airport transfer? No problem! Thi", "..."]},
{"author": ["Kate B"], "content": ["We enjoyed our stay very much. The bedrooms are charming and clean, the staff is friendly, the breakfasts are basic but fresh. The location is really terrific", "..."]},
{"author": ["Kate B"], "content": ["The location is a bit off the beaten track, but worth the price of a cab. The tour is short and quite interesting. The showroom is very busy with a nice selecti", "..."]},
{"author": ["Kate B"], "content": ["We arrived very late at night and there was a non-English speaking volunteer who let us in - she was young and we got the sense she might be new. After some lon", "..."]},
{"author": ["Kate B"], "content": ["Everything about Tiesto's is big. The portions, the flavours, the personalities. We received good service - we were seated on time for our reservation, the wait", "..."]},
{"author": ["Kate B"], "content": ["We really enjoyed our stay at Harvey House. Judi and Tim were great hosts.  They made sure that we felt welcome and that we had everything we needed, without be", "..."]},
{"author": ["Kate B"], "content": ["We loved Sawanoya and still talk about it over a year later (note: we stayed in September 2014). The location in Yanaka feels very removed from Tokyo (in an his", "..."]},
{"author": ["Kate B"], "content": ["Yarimikan provided us with some amazing memories of Japan. Their Onsen are beautiful and rugged, the food was extraordinarily good, fresh and plentiful, includi", "..."]},
{"author": ["Kate B"], "content": ["We had a wonderful time in Takayama, arriving in time for the fall festival. The Ryokans and hotels were all extremely busy and yet we felt like the service we ", "..."]},
{"author": ["ndcolomb"], "content": ["A friend and I stayed at the Cino Fabiani Guesthouse for one night on our return from the Galapagos Islands.  I found the neighborhood of Las Penas to be very i", "..."]},
{"author": ["Ian O"], "content": ["Kind of like a high-end food court with a concept not unlike Mario Batali's Eataly in NYC, though on a smaller scale. Areas with pizza, burgers, fresh pasta, It", "..."]},
{"author": ["Ian O"], "content": ["I was on a tight time schedule during my couple days in Rome, but I just had to see the Colosseum. It was already too late to go inside, so I just walked around", "..."]},
{"author": ["Ian O"], "content": ["I was overwhelmed with emotion when I walked inside the Pantheon. Absolutely remarkable. A friend back home later told me that conquering Barbarians dropped the", "..."]},
{"author": ["Ian O"], "content": ["You've never seen any place like this place before! Stunning! Be prepared for tons of people and selfie-mania, but once you see it you'll understand why it simp", "..."]},
{"author": ["Ian O"], "content": ["Very popular large hostel. Comfortable beds and most rooms with private baths. Large lockers. Loved the huge public spaces and pool! A bit of a walk to major at", "..."]},
{"author": ["Ian O"], "content": ["Hard to believe how many beds they squeeze into the dorm rooms here, but this is Venice and real estate comes at a high premium. Despite the tight quarters, I g", "..."]},
{"author": ["Ian O"], "content": ["I had a good experience here, though I must admit the wifi is weak and frustrating to connect to. Big windows opened to a huge grassy courtyard. Nice kitchen to", "..."]},
{"author": ["Ian O"], "content": ["Delicious homemade gelato in the same family-run location for decades. Try it slathered in fresh whipped cream! Hint: Buy your ticket before you go to the ice c", "..."]},
{"author": ["Ian O"], "content": ["A Lavender Festival was underway this weekend with a number of local artisans displaying their wares and foodstuffs. Lots of lavender everything and the aroma c", "..."]},
{"author": ["Ian O"], "content": ["Get right up close to the orcas and enjoy long mountain vistas to the Olympic Peninsula to the south and Vancouver Island to the west. Check your cell phone sig", "..."]},
{"author": ["Ian O"], "content": ["Super location directly across from the ferry terminal makes it a dynamite spot to wait to board. I just had coffee but the baked goods and sandwiches looked ve", "..."]},
{"author": ["Ian O"], "content": ["A short walk up a gentle incline takes you up to a great view of Shannon Falls. Well worth it, particularly if you're not an avid hiker able and willing to hit ", "..."]},
{"author": ["Ian O"], "content": ["Get all you need for your Squamish adventure here. Rent a bike. Arrange a hike or gondola ride. Get yourself outfitted to go kayaking. Learn what else to do in ", "..."]},
{"author": ["Ian O"], "content": ["The view is actually better from the road down below looking up to the rocks. The park itself is all about dirtbags getting out onto the rocks and boosting thei", "..."]},
{"author": ["Ian O"], "content": ["Spacious dorm rooms with big lockers, comfy beds, and outstanding views. Try and stay on the side facing the river, otherwise you'll hear some highway noise. Cl", "..."]},
{"author": ["Ian O"], "content": ["Located inside the Squamish Adventure Centre. Get your activities planned and enjoy the awesome views and great coffee before you hit the trails. Awesome archit", "..."]},
{"author": ["Ian O"], "content": ["Built to house athletes for the 2010 Olympics and beautifully re-purposed as a hostel. Clean, bright, new! Possibly the best hostel kitchen ever! Nice views in ", "..."]},
{"author": ["Ian O"], "content": ["Very casual place with great pizza and pasta. Try to have a special pizza or the spaghetti carbonara. There are dozens of similar places to choose from, but we ", "..."]},
{"author": ["Ian O"], "content": ["We tried all the places we could fine, but this was the best gelato in town. Great coffee and pastries too. Family run for decades... check out the photos on th", "..."]},
{"author": ["Ian O"], "content": ["There is no escaping the sun or wind here, so be sure to bring something to protect yourself. There is parking in a number of places along this couple-mile-long", "..."]},
{"author": ["vgBrussels"], "content": ["Efficient staff. More space for the legs than other comparable companies this definitely their strong point. The lunch box is simple and acceptable (eatable)"]},
{"author": ["vgBrussels"], "content": ["Nice and trendy restaurant. Good fresh food, you pay for the quality not for the trendy style, that is just offered on top. Enthusiastic service and life music ", "..."]},
{"author": ["vgBrussels"], "content": ["Nice discovery, well prepared local food and fresh beverages. Try it, good choice. You can have some local goat cheese and the caipherinias with passion fruit a", "..."]},
{"author": ["vgBrussels"], "content": ["Nice atmosphere in this place, and beautiful calm terrace to chill out, better than close restaurants in Florenville."]},
{"author": ["vgBrussels"], "content": ["The house puts authentic furniture and daily living items in its environment. The music room, the smoking area, the dressing rooms, the children’s room, etc. In", "..."]},
{"author": ["vgBrussels"], "content": ["I can only recommend to visit the grand place with a guide who will tell you what and how to see. A lot of details will get their own story and bring some myste", "..."]},
{"author": ["vgBrussels"], "content": ["What means a restaurant with or without a star? Well, try this one out and you will understand what you can expect from the star system. Inventive cuisine, beau", "..."]},
{"author": ["vgBrussels"], "content": ["The fish dishes were nicely dressed and very tasteful. The service was quick, professional and we had a warm and friendly welcome. Very nice view over the vieux", "..."]},
{"author": ["vgBrussels"], "content": ["The menu proposes diversified and tasty dishes with a personal touch. Good quality food. We enjoyed the French mussels, les bouchots, so delicious with nice hom", "..."]},
{"author": ["vgBrussels"], "content": ["We got some nice local products but the result in the plates was not fantastic. The ad hoc personnel is nice, the \"mistress\" of the house is not really welcomin", "..."]},
{"author": ["vgBrussels"], "content": ["The owners reproduced a nice little jungle in the garden and have an impressive orchid collection. They have also been able to attract seven different sort of h", "..."]},
{"author": ["vgBrussels"], "content": ["They do their very best to proposée the whole cycle of the butterflies. I would recommend as kids activity."]},
{"author": ["vgBrussels"], "content": ["We enjoyed this charming place with an artistic flavor, we could not have made a better choice to visit Guayaquil.The owner puts a special spirit in the house, ", "..."]},
{"author": ["vgBrussels"], "content": ["Cities and their water places have special links. At first sight you might not be aware of the importance of the river and channels for the city of Brussels, bu", "..."]},
{"author": ["vgBrussels"], "content": ["Dishes are made depending on what the fisherman can propose that day. So the menu is different every day and you have the guarantee of freshly fished fish. Look", "..."]},
{"author": ["vgBrussels"], "content": ["Familial hotel, in quiet area in new Town , 5 min from the beach, 10 from the old Town. The rooms offer all you need for a comfortable stay, the breakfast is un", "..."]},
{"author": ["vgBrussels"], "content": ["Endless lonely beach and then you find the Mojito beach bar... Fresh drinks, and well served mojitos of course, and small nice snacking a at reasonable price. W", "..."]},
{"author": ["vgBrussels"], "content": ["Greek food with a personal and rural touch. Fresh meals, so food is made with what was available on the market that day. This means you need to be a little pati", "..."]},
{"author": ["vgBrussels"], "content": ["No need to be a music freak to visit. I would recommend for children of all ages, but don't try to visit all at once. Whilst you visualize the instrument, you g", "..."]},
{"author": ["alexandmadie"], "content": ["We paid about 700 MXN / night for a week (including taxes) in a double bedroom with shared bathroom on the second floor. It was quiet, secure, clean, comfortabl", "..."]},
{"author": ["alexandmadie"], "content": ["Delicious churros - only 20 MXN for four. Service was always fast and friendly, and churros and coffee always fresh! Wish there were locations in California!"]},
{"author": ["alexandmadie"], "content": ["We were lucky to get a table around 5:30pm on a busy Monday. Service was excellent and food was amazing - clean flavors, good heat, and overall very satisfying.", "..."]},
{"author": ["alexandmadie"], "content": ["We've stayed here a few times and in three different double bedrooms - all modern and very spacious with a private bathroom and filling breakfast included for 8", "..."]},
{"author": ["alexandmadie"], "content": ["We've eaten here a few times and always had an enjoyable meal. Filling, fresh, and tasty comfort food. Nice, friendly staff with quick service. And super easy m", "..."]},
{"author": ["alexandmadie"], "content": ["We came here every day during our stay in Medellín. We sampled all their delicious flavors, but always ended up ordering their chocolate and pistachio gelatos -", "..."]},
{"author": ["alexandmadie"], "content": ["Lovely little bakery in El Poblado with delicious croissants and coffee for breakfast and afternoon snack. They have a variety of buttery and flakey croissants ", "..."]},
{"author": ["alexandmadie"], "content": ["This was a great intro to the city of Cartagena. Our guide, Edgar, was very passionate, informative, personable, and very engaging! He was also mindful of our c", "..."]},
{"author": ["alexandmadie"], "content": ["We ordered a cerdo gyro and pollo gyro, which were both really tasty and filling. (We didn't know there were fries inside the gyros too!) Ingredients were fresh", "..."]},
{"author": ["alexandmadie"], "content": ["We were happy to see Bao Bei in the neighborhood, as we were looking for something different than the normal cafes around. We ordered the pork belly bao, eggpla", "..."]},
{"author": ["alexandmadie"], "content": ["We paid 40000 COP/person per night for a bunk bed with shared bathrooms. And another 40000/person per day for delicious vegetarian breakfast, lunch, and dinner.", "..."]},
{"author": ["alexandmadie"], "content": ["We paid 60000 COP/night for a basic double bedroom a fan, bathroom, and outside facing window. The rooms were very small with barely enough room for our backpac", "..."]},
{"author": ["alexandmadie"], "content": ["We paid a value of $95/night for a small double bedroom with two twin beds. The rooms were clean and very comfortable. Amazing shower. Wifi and air-conditioning", "..."]},
{"author": ["alexandmadie"], "content": ["Came here on a Sunday night and enjoyed a delicious pizza, ceviche, dessert, and a few drinks. Everything was delicious, service was quick and friendly."]},
{"author": ["alexandmadie"], "content": ["We paid 94000 COP/night for room #3 on the bottom floor. It was a double bedroom with AC, and private bathroom. PROS- Room was spacious, comfortable, and cle", "..."]},
{"author": ["alexandmadie"], "content": ["Was lucky to get a table without a reservation because we came early on a weeknight. Service was fast and friendly, and food was outstanding - delicious gruyere", "..."]},
{"author": ["alexandmadie"], "content": ["Great arepas, wraps, and smoothies! Everything was super fresh and delicious. Staff was fast and friendly for lunch and dinner service."]},
{"author": ["alexandmadie"], "content": ["We were happy to get a table on a busy night, because the food was delicious! Ordered the chicken curry and a ceviche. Both were very simple but full of flavor.", "..."]},
{"author": ["alexandmadie"], "content": ["Wish we discovered this place earlier! We only went once and got the yogurt & maracuya popsicle and vanilla & arequipe possible. Both amazing!!! And only 5000 C", "..."]},
{"author": ["alexandmadie"], "content": ["Service was friendly and fast, but thought the chicken tequila and veggie wraps were bland and overpriced for the small portion. Chicken wrap could use more/str", "..."]},
{"author": ["Cristoffel"], "content": ["I stayed at Casa Ecuatreasures for 4 nights. The hotel is very new, everything is spick and span. I was the only guest at the time, and Alicia and Hernán really", "..."]},
{"author": ["Cristoffel"], "content": ["Yes, you should do the walking tour of the historic centre, but when you've seen the old town you should definitely move on to La Floresta. Emerson is a fantast", "..."]},
{"author": ["Cristoffel"], "content": ["I did the morning tour with Betto. It was the perfect introduction to the city! We saw all the relevant places in the old town. At several stops Betto brought u", "..."]},
{"author": ["Cristoffel"], "content": ["I always had nice food in Ecuador, especially in the many street food stalls in Quito. But I'm a foodie, and I wanted to see if Ecuador can do fine food. And in", "..."]},
{"author": ["Cristoffel"], "content": ["I spend my first 4 nights in Ecuador at Casa Cino Fabiani, and I came back to it whenever I stayed a night in Guayaquil. It was the perfect start into my trip. ", "..."]},
{"author": ["Cristoffel"], "content": ["I stayed in this exquisite B&B for three nights in April. My stay with Janet and Peter was really nice! They are wonderful hosts, while staying there you feel a", "..."]},
{"author": ["Cristoffel"], "content": ["Fish and Chips how it should be. Little restaurant and take-away, very basic, no thrills, good food for little money! They even have some more fancy stuff like ", "..."]},
{"author": ["Nomad_AT_Aust"], "content": ["Cino Fabiani location is perfect for easy access to the Malecon and the bars and restaurants of Las Peñas and Santa Ana. Arnoldo, the owner, provides great reco", "..."]},
{"author": ["charles m"], "content": ["I spent one night here. Check in took too long. They wanted my credit card right off the bat before my passport even! I had to sign my name twice and they ran m", "..."]},
{"author": ["charles m"], "content": ["Stayed here for Christmas weekend. This place is decorated very nicely. The rooms are small but clean. The bathroom is nicely appointed and there is HOT water. ", "..."]},
{"author": ["charles m"], "content": ["I chose this place because of it's fabulous location and the fantastic rates. Little did I know that when I checked in, there is also a live theatre within the ", "..."]},
{"author": ["charles m"], "content": ["had to ask waiter 9 times to turn loud music down....out of half the food on the menu....what meat I got was gristly"]},
{"author": ["charles m"], "content": ["cant say much about this place except a Corona cost me $6.50 and its as dark as hell.....can't see the food you're eating"]},
{"author": ["charles m"], "content": ["expensive for ecuadorean budgets....nice pastries, large selection for drinks.....$12 for two pastries, two drinks"]},
{"author": ["charles m"], "content": ["not a ferris wheel that spins around....it goes up incrementally one capsule at a time, very slow. Mostly for those who like the view which would be spectacular", "..."]},
{"author": ["charles m"], "content": ["a combination mall/playground with lots of attractions up and down....two sailing ships, an Imax, playgrounds, fish lake, Moorish tower, statuary, ferris wheel.", "..."]},
{"author": ["charles m"], "content": ["large cobblestones make up the narrow streets...oldest buildings in Guayaquil (I think), spectacular views, wonderful cubbyhole stores, this is the place for ro", "..."]},
{"author": ["mylessloniker"], "content": ["This beautiful old house is owned and operated by Arnaldo, a producer, empresario, and patron of the arts. There are eclectic and charming paintings, photos, an", "..."]},
{"author": ["inkstainedmedia"], "content": ["We needed one (1) night of lodging; but it was a vacation there in itself! Not an experience easily forgotten. Including time travel with convenience near one o", "..."]},
{"author": ["konrad_rehling"], "content": ["one of these rare places you tend to keep secret and better not tell anyone from your own selfish perspective.such a friendly and unique atmosphere as well as ", "..."]},
{"author": ["Tripsti"], "content": ["The rooms are huge with very high ceilings. Our room also had a hammock large enough for two people. The location of the building is situated close to many bars", "..."]},
{"author": ["Tripsti"], "content": ["The food is fantastic and the staff (all four of them) are so friendly and helpful. The speed and efficiency in which they work is a sight I will not soon forge", "..."]},
{"author": ["Tripsti"], "content": ["Great tour! Frank was a very knowledgable guide, with very interesting stories to tell. I strongly recommend this walking tour."]},
{"author": ["Andrea Christin... S"], "content": ["Cino Fabiani Guesthouse is absolutely the best acommodation i have known in Ecuador and one of the best i have known all over the world!and i have been travelli", "..."]},
{"author": ["Tom S"], "content": ["Me and my girlfriend stayed here in July and were stunned by the beauty of the area and the guesthouse.The rooms are spacious and clean, and the owner is a very", "..."]},
{"author": ["Tom S"], "content": ["Great staff, very difficult games but good old fashioned Malaysian fun! Only 4 types of games which could be expanded but all very enjoyable."]},
{"author": ["Tom S"], "content": ["Stayed here for 2 nights after stumbling upon it a night before and being told it was fully booked. The staff here patched up my cuts from falling off my bike, ", "..."]},
{"author": ["Jeroen K"], "content": ["Het eten was superlekker en met een goede prijs! Vaker komen! Bediening uitstekend. Een vondst voor de liefhebber!"]},
{"author": ["Jeroen K"], "content": ["Room is good, good gym as well. Nice restaurant, but they play the same 3 Bob James songs over and over again, but at least good taste in music. ;-) Nice lounge", "..."]},
{"author": ["Jeroen K"], "content": ["Het eten was lekker, we aten onze buiken vol. Leuk dat ze als een der weinige restaurants een goed en gezond kindermenu hebben!"]},
{"author": ["Jeroen K"], "content": ["This newly built and impeccably maintained boulevard brandishes restaurants, including seafood place \"Resaca\", play areas for kids, 3d movie theater, shops, mus", "..."]},
{"author": ["Jeroen K"], "content": ["Lots of nice little bars; Wednesday night theater or live music at Diva Nicotina. Also singers at various bars, and all the way up there is the light house. Peñ", "..."]},
{"author": ["Jeroen K"], "content": ["Great reception and care by host, including a courtesy breakfast of fruit including the juiciest mango you can imagine! The room is great, with a beautiful comm", "..."]},
{"author": ["Kal C"], "content": ["we were in desperate need of a place to stay and the owner was extremely hospitable. Beds were comfy, rooms were cool and price was definately reasonable. We th", "..."]},
{"author": ["Nora R"], "content": ["Our guide Rachel was so fun, organized, and full of interesting information. We made new friends and highly recommend this tour."]},
{"author": ["Nora R"], "content": ["We took this tour our first night in Bangkok.  Our guide was so knowledgeable and friendly and also spoke excellent English.  She got us grounded in the area wh", "..."]},
{"author": ["Nora R"], "content": ["I highly recommend this class.  Joungy is a great cook and loves to share all she knows.  After we cooked each course, we sat with the new friends we made at th", "..."]},
{"author": ["Nora R"], "content": ["Right on the beach!!!!  Super friendly and helpful staff, delicious food, comfortable beds with good pillows, plenty of hot water and good a/c.  Rooms are rusti", "..."]},
{"author": ["Nora R"], "content": ["EAT THE SEAFOOD SOUP!!!!  We arrived and our room wasn't quite ready so we had margaritas on the beach with chips and guacamole and the best seafood soup I have", "..."]},
{"author": ["Nora R"], "content": ["Although the interior design of the apartment may be a bit dated, the place is clean and well kept.  Lots of room for two couples.  Coffee and coffee maker in t", "..."]},
{"author": ["Nora R"], "content": ["We paid the small fee to upgrade to the superior room. The view was great and the room has a beautiful deck to enjoy morning coffee and an evening glass of wine", "..."]},
{"author": ["Nora R"], "content": ["The showers have hot water and the rooms are rustic, simple, and clean.  Great location - right near the malecon and a great sitting area outside to watch the p", "..."]},
{"author": ["Nora R"], "content": ["My husband and I stayed here for a long weekend get-away.  The rooms were small but clean and the a/c worked great.  Breakfast in the morning was simple - toast", "..."]},
{"author": ["Nora R"], "content": ["Cute, colorful, and well taken care of.  This place is immaculately clean and decorated like the tropics with a tree house feel. Plenty of hot water to shower a", "..."]},
{"author": ["Nora R"], "content": ["Rent a chair for $7 and rent a locker.  Our beach bag with $80 and a credit card were stolen during our first swim.  The beach is georgeois and the people so fr", "..."]},
{"author": ["Nora R"], "content": ["EAT THE SEAFOOD SOUP!!!!  We arrived and our room wasn't quite ready so we had margaritas on the beach with chips and guacamole and the best seafood soup I have", "..."]},
{"author": ["Nora R"], "content": ["Good value but room was run-down.  Old faded bedding and could have used a paint job many years ago.  Beach was nice but not enough chairs or loungers for every", "..."]},
{"author": ["Nora R"], "content": ["This has been happening to me too since the upgrade to iOS 9"]},
{"author": ["Nora R"], "content": ["Nice hotel with helpful staff.  However, I would pick a different city to layover when flying non-rev due to expensive taxi ride to area hotels.  This hotel pai", "..."]},
{"author": ["Nora R"], "content": ["I live in Minnesota but visit my daughter in Atlanta a few times a year.  Between visits I crave Chai Pani.   Each time we have ordered something new and every ", "..."]},
{"author": ["Nora R"], "content": ["We booked using Priceline selecting 2.5 stars, free parking,  and airport shuttle.  Got a great price but when we arrived found out the shuttle is full.   We wi", "..."]},
{"author": ["Nora R"], "content": ["rustic but clean in a beautiful área of town.  Owner was great - showed me around, gave me safety típs, and made me feel welcome.  Nice área to walk around with", "..."]},
{"author": ["Nora R"], "content": ["Clean but plain.  Staff was excellent - say hi to Juan for us.   Took a long time to get hot water, but let the shower run for awhile and it gets warm.   Area w", "..."]},
{"author": ["Nora R"], "content": ["Wonderful, cozy, immaculately clean, and the best hosts.  The owners are the third generation to run this hotel and their grandparents taught them well.  They s", "..."]},
{"author": ["Marcus1304"], "content": ["We had a very short but pleasant and interesting stay in the great artist's apartment in the beautiful old city of Guayaquil.We thank you Arnaldo for your lov", "..."]}
]