[
{"title": ["¡Bienvenidos a IGN Latinoamérica!"], "content": ["​", "IGN es el sitio número 1 de gaming y entretenimiento en el mundo con una audiencia mundial de más de 50 millones y hoy, estamos más que orgullosos de unirnos a esa increíble familia con ¡IGN Latinoamérica!", "¿Y qué puedes esperar de IGN Latinoamérica? Todo lo que quieres, así de fácil. Estaremos trayendo a la región todo el contenido internacional que tanto le gusta a la audiencia de IGN: reviews, artículos y noticias, pero tropicalizados y en español. También nos concentraremos en contenido local y lo que le interesa a nuestro público regional.", "Con el gaming en Latinoamérica creciendo en popularidad, como si se hubiera comido un hongo, consideramos que es el momento perfecto para lanzar IGN Latam y esperamos que todos lo disfruten como nosotros al hacerlo.", "​", "También es muy importante recordarte que si no quieres ver la versión de IGN Latinoamérica (porque tal vez prefieras otra edición) puedes cambiarla con sólo dar click en el nombre de nuestra edición –ahí, arriba a la izquierda o en versión de mobile hasta abajo– lo importante es que tengas la opción que quieres.", "En esta parte del proceso, es probable que encuentres pequeños bugs en el sitio, pero queremos asegurarte que estamos trabajando para resolver todos y cada uno de ellos. Si llegas a encontrar alguno, cuéntanos para revisarlo lo más rápido posible.", "Y claro, no te olvides de seguirnos en nuestras redes sociales en ", "Facebook", ", ", "@IGNLatam", " y ", "Google+", " para estar enterado todo el tiempo de todo lo que sucede en el mundo del gaming y el entretenimiento.", "¡Que comiencen los juegos!", "​", "Mail de contacto:", "\n", "ign_latam@ign.com"]},
{"title": ["Estrenos y lanzamientos del 5 al 11 de abril de 2021"], "publishing_date": ["2 de Abril de 2021"]},
{"title": ["PS4 Pro representa casi uno de cada cinco PS4 vendido"], "content": ["Una entrevista con ejecutivos de PlayStation de Europa y América ha revelado que el PlayStation 4 Pro representa casi 20% de los sistemas PS4 actualmente vendidos.", "Cuando hablaba con Gixel, Jim Ryan, CEO de Sony Entertainment Europe, declaró que el éxito del PS4 Pro excedió las expectativas de la compañía, con el PS4 Pro representando casi uno por cada cinco sistemas PS4 vendidos.", "\"Teníamos confianza en el producto, pero realmente nos ha sorprendido por lo bien que está hecho\", dijo Ryan. \"Casi uno en cada cinco PlayStations vendidos desde el lanzamiento en noviembre han sido un Pro. Eso está muy por arriba de nuestras expectativas. Nos sentimos bastante bien al respecto\".", "De acuerdo con Sony, no sólo las ventas del PlayStation 4 Pro son fuertes pero casi 40% de las ventas son mejoras del PS4 a una versión más poderosa de la consola.", "\"A veces pienso que podemos ser culpables de atribuir demasiada racionalidad a los jugadores\", explicó Ryan. \"La gente sólo quiere lo mejor. ¿Tal vez quieran estar preparados para el futuro? Creo que vemos lo mismo con los clientes de Apple –hay gente que quiere lo mejor que puedan comprar\".", "Las ventas del PlayStation 4, en general, han sido un éxito para Sony, con la compañía habiendo alcanzado su meta de lanzar ", "60 millones de unidades a principios de este año", ". ", "Por otro lado, en la misma entrevista, Shawn Layden reveló que ", "Horizon: Zero Dawn ha vendido 3.4 millones de copias", "."]},
{"title": ["Comparando Marvel's Spider-Man en PS4 vs. PS4 Pro"], "content": ["Marvel's Spider-Man llega esta semana y así se comparan visualmente la nueva entrega de Insomniac en PlayStation 4 y PlayStation 4 Pro.", "A continuación, puedes ver un video que logra dicha comparación, mostrándonos al arácnido favorito de Marvel dentro del juego, revisando secuencias de acción, la ciudad de Nueva York y otros aspectos como texturas y los detalles que se ven a la distancia.", "¿Cuál se ve mejor? ¿Lo ven igual? ", "¿Quieren ver la comparación gráfica entre los charcos?", " Dinos en los comentarios.", "Y para saber más sobre Marvel's Spider-Man,", " mira los detalles sobre el contenido DLC que tendrá el juego post-lanzamiento", ", ", "el trailer del modo fotografía", " y ", "no te pierdas de nuestra review", "."]},
{"title": ["Sony hará un anuncio acerca de MediEvil Remastered la próxima semana"], "content": ["Como reporta ", "vg247", ", Sid Shuman, el director de redes sociales de PlayStation, mencionó en el más reciente ", "Blogcast PlayStation", " que tiene “bajo una excelente autoridad” que Shawn Layden, director de SIE Worldwide Studios, dará un anunció acerca del estado del remaster de MediEvil para PlayStation 4 “en una semana o dos”.", "“Está muy emocionado por darle a todos una gran actualización acerca de MediEvil. Va a estar en el show durante la próxima semana, y nos dará a todos una noticia acerca de eso” dijo Shuman emocionado.", "La remasterización del juego clásico de PlayStation fue anunciada durante la PlayStation Experience 2017 para PS4 y ha mantenido atentos a una gran cantidad de fans, incluyendonos.", "Para más acerca de MediEvil en PS4 continúa aquí, en IGN Latinoamérica.", " ", "Mike Reyes es un editor en IGN Latinoamérica que recuerda haber tenido pesadillas tras jugar el primer MediEvil a una edad muy temprana. Puedes encontrarlo en ", "@Sol_Criva", "."]},
{},
{"title": ["MediEvil PS4 es un Remake, no una remasterización"], "content": ["Shawn Layden, presidente de Sony Worldwide Studios, describió la versión de PS4 de MediEvil como un remake, no una remasterización –a pesar que el videojuego fue promocionado originalmente usando el último término.", "Apareciendo en el ", "PlayStation Blogcast", ", Layden explicó que el acercamiento para esta nueva versión del muy recordado título de PS1:", "\"Creo que han habido algunas palabras que suenan similar pero significan cosas distintas –como remake y remaster. Éste es un remake. Tomamos el diseño del videojuego original y tomamos mucho del arte principal, algunos atributos del diseño del juego y ethos, si quieres. Y hemos trabajando con un desarrollador llamado Other Ocean Interactive y están rehaciendo MediEvil en ese diseño –el MediEvil original de PS1. En el que estaba trabajando cuando estaba en Tokio\".", "Cuando el proyecto fue revelado en PSX 2017, el teaser trailer se refirió específicamente a este como un remaster en 4K, así que esto es un cambio en el mensaje.", "Layden dejó claro que a pesar que un nuevo estudio trabaja en el juego, se mantienen conexiones con el desarrollo original:", "\"Estamos trabajando con algo del talento [que estaba] originalmente asociado con el título hace 20 años\", explicó. \"Así que nos aseguramos que lo mantendremos real, estamos manteniendo la intención original de los creadores\".", "Layden también dijo que un nuevo trailer del juego debería llegar, apropiadamente en Halloween."]},
{"title": ["Netflix abril de 2021: estos son todos los estrenos de la plataforma de streaming"], "content": ["Llegaron a nosotros los estrenos de Netflix para abril 2021 y te los mostramos a continuación.", "Personalmente, estamos muy emocionados por Demon Slayer: Kimetsu no Yaiba y Shrek, obviamente, pero más que nada, Shrek 2.", "Series", "\n\t", "Sombra y hueso (N original) – 23 de abril", "\n\t", "Luis Miguel – La serie, Temporada 2 (N original) – 18 de abril", "\n\t", "La serpiente (N original) – 2 de abril", "\n\t", "El inocente (N original) – 30 de abril", "\n\t", "Cero (N original) – 21 de abril", "\n\t", "Grita, te estamos filmando, Temporada 2 (N original) – 1 de abril", "\n", "Películas", "\n\t", "Dime cuando tú (N original) – 23 de abril", "\n\t", "Fuerza trueno (N original) – 9 de abril", "\n\t", "La apariencia de las cosas (N original) – 29 de abril", "\n\t", "Hasta el cielo (N original) – 2 de abril", "\n\t", "Corre (N original) – 2 de abril", "\n\t", "Cowboys de Filadelfia (N original) – 2 de abril", "\n\t", "Sospecha mortal (N original) – 29 de abril", "\n\t", "Amor y monstruos (N original) – 14 de abril", "\n\t", "Te veo (N original) – 21 de abril", "\n\t", "La lista de Schindler", "\n\t", "Atrápame si puedes", "\n\t", "El mundo perdido: Parque Jurásico", "\n\t", "Letras explícitas", "\n\t", "Siete años en el Tíbet", "\n\t", "Patch Adams", "\n", "Documentales y Especiales", "\n\t", "¿Por qué me mataron? (N original) – 14 de abril", "\n\t", "Mi amor: Seis grandes historias de amor (N original) – 13 de abril", "\n\t", "Dolly Parton: A Musicares Tribute (N original) – 7 de abril", "\n\t", "Guía Headspace para el buen dormir (N original)", "\n\t", "La vida a color con David Attenborough (N original)", "\n\t", "Héroes: silencio y Rock & Roll", "\n\t", "Prejuicio cifrado", "\n", "Niños y Familia", "\n\t", "La familia Mitchel vs. Las maquinas (N original) – 30 de abril", "\n\t", "Rápidos y Furiosos: Espías al volante, Tempaorada 4: México (N original) – 16 de abril", "\n\t", "Reunión familiar (N original) – 5 de abril", "\n\t", "Shrek", "\n\t", "Shrek 2", "\n\t", "Los héroes del Apocalipsis: ¡Felices días finales! (N original)", "\n", "Anime", "\n\t", "De yakuza a amor de casa (N original) – 8 de abril", "\n\t", "Yasuke (N original) – 29 de abril", "\n\t", "Demon Slayer: Kimetsu no Yaiba (N original) – 1 de abril", "\n", "Miguel Bravo es editor de IGN Latinoamérica. Amante de todo lo que viene de Japón, los videojuegos y las buenas historias. Estudiante de una ingeniería en animación y del idioma japonés. Puedes seguirlo en redes sociales como ", "@ElDetectiveMike"]},
{"title": ["Netflix: estos son los animes que se estrenarán en abril de 2021"], "content": ["Recién les hablamos de ", "todas las películas, series y documentales que llegarán a Netflix", " durante el próximo mes de abril, y ahora les tenemos el nuevo anime que se lanzará en la popular plataforma de streaming.", "Pueden ver el listado a continuación:", "1 de abril", "Demon Slayer: Kimetsu no Yaiba", "\n", "Tanjiro emprende un viaje arriesgado para buscar una cura a la maldición de su hermana y vengar a su familia asesinada por un demonio.", "\n", "8 de abril", "De yakuza a amo de casa", "\n", "Tras desaparecer del inframundo, el legendario líder yakuza Tatsu, más conocido como «el dragón inmortal», reaparece convertido en un esposo a tiempo completo.", "\n", "26 de abril", "JoJo's Bizarre Adventure: Sangre fantasma/Tendencia de batalla", "\n", "La relación antagónica de Jonathan Joestar con Dio, su hermano adoptivo, es el primer eslabón de un linaje extraordinariamente curioso, continuado por su nieto Joseph.", "\n", "29 de abril", "Yasuke", "\n", "Proveniente de África, peleó al lado de muchos señores feudales en el brutal Japón del siglo XVI. Era el samurái negro y se convirtió en una leyenda.", "\n", "En cuanto a contenido de niños y familia, encontrarán los siguientes estrenos destacando Shrek y Shrek 2:", "\n\t", "Shrek (1/4/2021)", "\n\t", "Shrek 2 (1/4/2021)", "\n\t", "Heidi: Temporada 2 (1/4/2021)", "\n\t", "Barbie: Aventura de princesas (1/4/2021)", "\n\t", "Reunión familiar: Parte 3 (5/4/2021)", "\n\t", "Los héroes del apocalipsis: ¡Felices días finales! (6/4/2021)", "\n\t", "Mighty Express: Temporada 3 (13/4/2021)", "\n\t", "Rápidos y furiosos: Espías al volante - Temporada 4: México (16/4/2021)", "\n\t", "Izzy y los koalas: Temporada 2 (20/4/2021)", "\n\t", "Tut Tut Cory Bólidos: Temporada 4 (27/4/2021)", "\n", "Y como ya les comentamos, habrá otros estrenos como Sombra y Hueso, La Serpiente, Cero, Dime Cuando Tú y Fuerza Trueno."]},
{"title": ["Xbox Games with Gold: estos son los títulos gratuitos de abril de 2021"], "content": ["Xbox Game with Gold ya ha anunciado los juegos que llegarán este abril de 2021 y con ello tenemos cuatro juegos nuevos, que añadiremos a nuestra colección dentro de poco.", "Así que prepara esa descargas, pues estos son los juegos que puedes encontrar dentro de poco bajo el servicio de Game with Gold en tu consola Xbox.", "\n\t", "Vikings: Wolves of Midgard", "\n", "Disponible desde el 1 hasta el 30 de abril", "\n\t", "FIA European Truck Racing Championship", "\n", "Disponible entre el 16 de abril y el 15 de mayo", "\n\t", "Dark Void", "\n", "Disponible desde el 1 hasta el 15 de abril", "\n\t", "Hard Corps: Uprising", "\n", "Desde el 16 hasta el 30 de abril", "Sinceramente esperábamos algunos juegos un poco más llamativos pero de igual manera hay cosas muy interesantes, en especial los dos juegos de Xbox 360, pues son títulos que han sido muy bien recibidos por el público general.", "Mientras que los otros dos juegos, siendo honesto, no los conocía sino hasta ahora, por lo que no podría decir si son o no realmente buenos, afortunadamente son gratuitos y con eso podemos probarlos y ver lo que tienen que ofrecer.", "No olvides que actualmente Xbox se está enfocando mucho en sus sistema de Game Pass, por lo que si no te convencen estos juegos, hay todo un catálogo muy interesante con títulos de Bethesda dentro de Game Pass. Vale mucho la pena contratar el Ultimate y más porque te regalan más juegos con cada mes que pasa, sumado a todo lo que constantemente agregan al enorme catálogo de Game Pass.", "¿Qué opinas de estos juegos de Xbox Game with Gold? Nos interesa saber tu opinión.", "Miguel Bravo es editor de IGN Latinoamérica. Amante de todo lo que viene de Japón, los videojuegos y las buenas historias. Estudiante de una ingeniería en animación y del idioma japonés. Puedes seguirlo en redes sociales como ", "@ElDetectiveMike"]},
{"title": ["Euforia, nervios y diversión se viven en el IGN Tournament"], "content": ["Gritos de emoción, nervios de acero, decepción por las derrotas, euforia por los triunfos y sobre todo, mucha diversión es lo que se vive minuto a minuto en el IGN Tournament, donde más de 700 gamers buscan quedarse con la corona definitiva en Apex Legends y sobre todo, con los 36,000 MXN que habrá para el vencedor.", "El primer torneo de IGN Latinoamérica comenzó desde las 3:30 de la tarde en las cuatro diferentes sedes de Arena en la Ciudad de México: Antara, Santa Fe, Artz Pedregal y Mundo E. Los entusiastas jóvenes participantes comenzaron a llegar antes de la primera cita -en equipos o sólos- con el ánimo por las nubes y confiando en su talento.", " ", " ", " ", "Al momento de registrarse, cada uno de los 700 jugadores recibió un kit de bienvenida que estaba formado por una bolsa, termo y camisa de IGN Tournament, más un pastelito Gansito y unas galletas Sponch. Tras el registro, muchos de ellos decidieron inmortalizar su participación en el torneo con fotos, videos y hasta transmisiones en vivo con sus seguidores.", " ", " ", " ", "Entre los participantes en Artz Pedregal se encuentra el equipo representante de Timber Esports, dedicados a los battle royale y formado por tres jóvenes especialistas en Apex Legends. Ellos salieron victoriosos en la primera ronda del Torneo y van a la cabeza con 20 kills y 119 puntos.", " ", " ", " ", "Algunos otros jugadores llegaron solos, pero con la esperanza de encontrar un equipo para compartir la intensa jornada que se vive en las distintas sedes de Arena. Si un jugador llega solo, se agrupa con otros gamers sin equipo, y quien sabe, quizá la química aparezca en alguna de estas asociaciones improvisadas y sean capaces de sorprender a más de uno.", "La mayoría de los participantes son varones, pero entre todos los gamers de Artz se encuentra una mujer, Paulina Ramírez, de 29 años, originaria de la Ciudad de México e integrante del equipo “Los Ositos”, que aunque tienen un nombre muy tierno, están en el Torneo dispuestos a arrasar.", "“Cada uno tiene sus funciones en el equipo y yo soy la persona que los cubre de los que les están disparando de lejos. Las mujeres no somos malas jugando, sólo necesitamos a alguien que nos guíe. Yo no soy estratégica, así que necesito que me guíen. Yo voy directo a los golpes”, comentó la joven.", " ", " ", " ", "Los jugadores tuvieron la oportunidad de escoger jugar en PC o en consolas, Xbox One y PlayStation 4, pero sin importar la plataforma, los gritos de los participantes inundaron todos los rincones de Arena Artz Pedregal, pues aunque usaban headsets, el tono de su voz era alto por la adrenalina del momento.", "“Tengo alguien atrás”, “¡No lo vi”, y “¡Está allá!” son algunas de las frases más repetidas durante el IGN Tournament, mientras los diferentes equipos buscan coronarse campeones de Apex Legends.", " ", " ", " ", " ", "El ambiente que se vive en cada una de las sedes es espectacular, pero si no pudiste asistir al torneo, no te preocupes, acá puedes seguir nuestra transmisión:", " "]},
{"title": ["Euforia, nervios y diversión se viven en el IGN Tournament"], "content": ["Gritos de emoción, nervios de acero, decepción por las derrotas, euforia por los triunfos y sobre todo, mucha diversión es lo que se vive minuto a minuto en el IGN Tournament, donde más de 700 gamers buscan quedarse con la corona definitiva en Apex Legends y sobre todo, con los 36,000 MXN que habrá para el vencedor.", "El primer torneo de IGN Latinoamérica comenzó desde las 3:30 de la tarde en las cuatro diferentes sedes de Arena en la Ciudad de México: Antara, Santa Fe, Artz Pedregal y Mundo E. Los entusiastas jóvenes participantes comenzaron a llegar antes de la primera cita -en equipos o sólos- con el ánimo por las nubes y confiando en su talento.", " ", " ", " ", "Al momento de registrarse, cada uno de los 700 jugadores recibió un kit de bienvenida que estaba formado por una bolsa, termo y camisa de IGN Tournament, más un pastelito Gansito y unas galletas Sponch. Tras el registro, muchos de ellos decidieron inmortalizar su participación en el torneo con fotos, videos y hasta transmisiones en vivo con sus seguidores.", " ", " ", " ", "Entre los participantes en Artz Pedregal se encuentra el equipo representante de Timber Esports, dedicados a los battle royale y formado por tres jóvenes especialistas en Apex Legends. Ellos salieron victoriosos en la primera ronda del Torneo y van a la cabeza con 20 kills y 119 puntos.", " ", " ", " ", "Algunos otros jugadores llegaron solos, pero con la esperanza de encontrar un equipo para compartir la intensa jornada que se vive en las distintas sedes de Arena. Si un jugador llega solo, se agrupa con otros gamers sin equipo, y quien sabe, quizá la química aparezca en alguna de estas asociaciones improvisadas y sean capaces de sorprender a más de uno.", "La mayoría de los participantes son varones, pero entre todos los gamers de Artz se encuentra una mujer, Paulina Ramírez, de 29 años, originaria de la Ciudad de México e integrante del equipo “Los Ositos”, que aunque tienen un nombre muy tierno, están en el Torneo dispuestos a arrasar.", "“Cada uno tiene sus funciones en el equipo y yo soy la persona que los cubre de los que les están disparando de lejos. Las mujeres no somos malas jugando, sólo necesitamos a alguien que nos guíe. Yo no soy estratégica, así que necesito que me guíen. Yo voy directo a los golpes”, comentó la joven.", " ", " ", " ", "Los jugadores tuvieron la oportunidad de escoger jugar en PC o en consolas, Xbox One y PlayStation 4, pero sin importar la plataforma, los gritos de los participantes inundaron todos los rincones de Arena Artz Pedregal, pues aunque usaban headsets, el tono de su voz era alto por la adrenalina del momento.", "“Tengo alguien atrás”, “¡No lo vi”, y “¡Está allá!” son algunas de las frases más repetidas durante el IGN Tournament, mientras los diferentes equipos buscan coronarse campeones de Apex Legends.", " ", " ", " ", " ", "El ambiente que se vive en cada una de las sedes es espectacular, pero si no pudiste asistir al torneo, no te preocupes, acá puedes seguir nuestra transmisión:", " "]},
{"title": ["2018: Un año de bloopers"], "publishing_date": ["31 de Diciembre de 2018"]},
{"title": ["2018: Un año de bloopers"], "publishing_date": ["31 de Diciembre de 2018"]},
{"title": ["IGN Fan Fest 2021"], "publishing_date": ["26 de Febrero de 2021"]},
{"title": ["Comparación gráfica de InFamous: Second Son (PS4 Pro vs. PS4)"], "publishing_date": ["8 de Noviembre de 2016"]},
{"title": ["Watch Dogs 2 comparación gráfica: PS4 vs. PS4 Pro"], "publishing_date": ["15 de Noviembre de 2016"]},
{"title": ["Estrenos y lanzamientos del 18 al 24 de enero de 2021"], "publishing_date": ["18 de Enero de 2021"]},
{"title": ["El PS4 Pro edición especial por las 500 millones de unidades vendidas llegará a Latinoamérica"], "content": ["Sony confirmó que llegarán unidades limitadas del 500 Million Limited Edition PS4 Pro a Latinoamérica.", "A través de una publicación en el ", "blog de PlayStation", ", la compañía confirmó la llegada de la consola PS4 Pro, que servirá para conmemorar la venta de 500 millones de unidades, a Latinoamérica, sin embargo, confirmó que llegarán unidades muy limitadas. Aquí puedes ver el sistema antes mencionado:", "Esta edición no sólo vendrá con un estilo distinto (azul oscuro transparente), sino que traerá consigo una memoria de 2 TB de almacenamiento y el soporte vertical, con el que podrán cambiar la posición de su consola. ", "Aquí puedes ver todo lo que contendrá", ".", "A pesar de que no se revelaron las tiendas en las que estará disponible, es factible que Sony las envíe a las más importantes de cada país, dándole mayor importancia al sistema.", "Dentro de la misma publicación, la empresa pidió estar al pendiente de los siguientes números de serie: 09995, 01115 y 01013. Las consolas con dichos números tendrán una sorpresa muy especial, ya que conmemoran fechas importantes para la compañía –lanzamiento estadounidense del PlayStation Original, lanzamiento estadounidense del PS4 y la salida del PSVR.", "En noticias relacionadas, ", "no olvides revisar los juegos que están disponibles este mes en PlayStation Plus", ".", " ", "Fernando Farciert es redactor y productor en IGN Latinoamérica. Ama la pizza y los discos de vinilo. Hay que estar pendientes para alcanzar una. Puedes platicar con él de cómics, películas, comida y videojuegos en ", "@esemifar"]},
{"title": ["Marvel's Spider-Man - Trailer del modo foto"], "publishing_date": ["3 de Septiembre de 2018"]},
{"title": ["MediEvil - Announce Trailer"], "publishing_date": ["31 de Octubre de 2018"]},
{"title": ["Dragon Ball: ¿conocías la extraña fusión entre Cell y Krillin?"], "content": ["Uno de los elementos que más aman los fans de Dragon Ball son las fusiones; que sencillamente son la unión de dos personajes para crear uno nuevo, casi siempre con el objetivo de volverse más poderosos para derrotar a un rival en turno. Por ejemplo, Vegetto y Gotenks, las uniones de Gokú y Vegeta; y Goten y Trunks, respectivamente, para enfrentarse a Majin Buu en sus diversas formas.", "Pero, ¿en algún momento las fusiones se salieron de control? Bueno, en Dragon Ball Z vimos a Gotenks fallar dos veces y dar como resultado a Gotenks gordo y Gotenks flaco, además de Den-Goku, la hipotética fusión de Dendé y Gokú o Gokután, el saiyajin + Mister Satán; las cuales fueron creadas en la mente del héroe mientras pensaba con quien unirse con los pendientes Pothala para enfrentarse a Super Buu.", "\n", "Toei Animation", "\n", " ", "También tenemos Dragon Ball Fusions, el videojuego de Bandai Namco para Nintendo 3DS donde, como su nombre indica, se enfoca en las fusiones de los personajes que se te ocurran, dando como resultado uniones tan locas como Yamta (Yamcha + Vegeta), Colohan (Piccolo + Gohan), Janks (Jaco + Trunks) y Rappa (Raditz + Nappa). Pero seguramente ninguna de ellas te parecerá tan… extraña como la que te mostraremos a continuación, la cual está compuesta por Cell y Krillin.", "Esta fusión aparece en el videojuego Dragon Ball Z: Budokai y se origina en una pesadilla del bioandroide, en la que absorbe al humano más poderoso de la Tierra por error, mientras intentaba absorber a la Androide 18, en los días previos a los Cell Games. Resulta que luego de tragarse al Androide 17, Krillin interviene para evitar que el villano también se comiera a la rubia, así que la empuja y en su lugar el absorbido es él.", "\n", "Bandai Namco", "\n", "El resultado de esta extraña combinación es un nuevo personaje llamado Cellin; que bien parece un Cell Jr. con la cabeza del amigo de Gokú y algunas de sus características, como su seis puntos en la calva, los colores naranjas y el símbolo de la Tortuga en la Espalda y el pecho.", "Por supuesto, para Cell es una pesadilla porque tras esta fusión, su poder de pelea comienza a descender en caída libre. Con esta forma, Cellin apenas es capaz de vencer a Yamcha y finalmente, es destruido por Ten Shin Han.", "\n", "Bandai Namco", "\n", " ", "En este momento es cuando el villano despierta y se da cuenta que su cuerpo perfecto sigue ahí y que la unión con Krillin fue sólo una pesadilla. Así, respirando tranquilamente, puede volverse a dormir de cara a los Cell Games.", " ", "Si quieres leer más contenido del mundo de Dragon Ball, dale un vistazo a: ", "Jiren vs. Gokú y los 10 mejores combates de Dragon Ball Super", " y", " ¿Broly vs Jiren? ¿Quién es más poderoso?", "Jemima Sebastián hace de todo un poco en IGN Latinoamérica. Ama el anime, los deportes y la fotografía. Encuéntrala en ", "Twitter", " e ", "Instagram", " como @jemafg"]},
{"title": ["Sony hará un anuncio acerca de MediEvil Remastered la próxima semana"], "content": ["Como reporta ", "vg247", ", Sid Shuman, el director de redes sociales de PlayStation, mencionó en el más reciente ", "Blogcast PlayStation", " que tiene “bajo una excelente autoridad” que Shawn Layden, director de SIE Worldwide Studios, dará un anunció acerca del estado del remaster de MediEvil para PlayStation 4 “en una semana o dos”.", "“Está muy emocionado por darle a todos una gran actualización acerca de MediEvil. Va a estar en el show durante la próxima semana, y nos dará a todos una noticia acerca de eso” dijo Shuman emocionado.", "La remasterización del juego clásico de PlayStation fue anunciada durante la PlayStation Experience 2017 para PS4 y ha mantenido atentos a una gran cantidad de fans, incluyendonos.", "Para más acerca de MediEvil en PS4 continúa aquí, en IGN Latinoamérica.", " ", "Mike Reyes es un editor en IGN Latinoamérica que recuerda haber tenido pesadillas tras jugar el primer MediEvil a una edad muy temprana. Puedes encontrarlo en ", "@Sol_Criva", "."]},
{"title": ["Resident Evil: Infinite Darkness - revelan sinopsis, actores de voz y arte de la serie de Netflix"], "content": ["Netflix ha revelado varias novedades sobre ", "Resident Evil: Infinite Darkness", ", su nueva serie CGI que originalmente estaba planeada para ser una película.", "La compañía ha dado a conocer la sinopsis de la serie, los actores de voz de Leon y Claire, y la pieza de arte que pueden ver a continuación:", " ", "Destaca que los actores de voz para los mencionados personajes serán los mismos que participaron en el videojuego Resident Evil 2, por lo que Stephanie Panisello será Claire Redfield y Nick Apostolides será Leon S. Kennedy.", "\n", "Resident Evil: Infinite Darkness is bringing back the RE2 remake’s Nick Apostolides as Leon Kennedy and Stephanie Panisello as Claire Redfield. ", "pic.twitter.com/qjIa13hfZc", "\n— NX (@NXOnNetflix) ", "March 12, 2021", "Y esta es la sinopsis oficial (", "vía", " BloodyDisgusting):", "\n", "\"En 2006, hubo rastros de acceso indebido a archivos presidenciales secretos encontrados en la red de la Casa Blanca. El agente federal estadounidense Leon S. Kennedy se encuentra entre el grupo invitado a la Casa Blanca para investigar este incidente, pero cuando las luces se apagan repentinamente, Leon y el equipo SWAT se ven obligados a acabar con una horda de misteriosos zombis.", "\n\n", "Mientras tanto, Claire Redfield, miembro del personal de TerraSave, se encuentra con una imagen misteriosa dibujada por un joven en un país que visitó, mientras brinda apoyo a los refugiados. Atormentada por este dibujo, que parece ser una víctima de una infección viral, Claire comienza su propia investigación.", "\n\n", "A la mañana siguiente, Claire visita la Casa Blanca para solicitar la construcción de una instalación de asistencia social. Allí, ella tiene la oportunidad de reunirse con Leon y aprovecha la oportunidad para mostrarle el dibujo del niño. Leon parece darse cuenta de algún tipo de conexión entre el brote de zombis en la Casa Blanca y el extraño dibujo, pero le dice a Claire que no hay relación y se va. Con el tiempo, estos dos brotes de zombis en países lejanos conducen a eventos que sacuden a la nación hasta la médula.\"", "\n", "Resident Evil: Infinite Darkness", " es producida por Hiroyuki Kobayashi y se estrenará en este 2021."]},
{"title": ["Netflix abril de 2021: estos son todos los estrenos de la plataforma de streaming"], "content": ["Llegaron a nosotros los estrenos de Netflix para abril 2021 y te los mostramos a continuación.", "Personalmente, estamos muy emocionados por Demon Slayer: Kimetsu no Yaiba y Shrek, obviamente, pero más que nada, Shrek 2.", "Series", "\n\t", "Sombra y hueso (N original) – 23 de abril", "\n\t", "Luis Miguel – La serie, Temporada 2 (N original) – 18 de abril", "\n\t", "La serpiente (N original) – 2 de abril", "\n\t", "El inocente (N original) – 30 de abril", "\n\t", "Cero (N original) – 21 de abril", "\n\t", "Grita, te estamos filmando, Temporada 2 (N original) – 1 de abril", "\n", "Películas", "\n\t", "Dime cuando tú (N original) – 23 de abril", "\n\t", "Fuerza trueno (N original) – 9 de abril", "\n\t", "La apariencia de las cosas (N original) – 29 de abril", "\n\t", "Hasta el cielo (N original) – 2 de abril", "\n\t", "Corre (N original) – 2 de abril", "\n\t", "Cowboys de Filadelfia (N original) – 2 de abril", "\n\t", "Sospecha mortal (N original) – 29 de abril", "\n\t", "Amor y monstruos (N original) – 14 de abril", "\n\t", "Te veo (N original) – 21 de abril", "\n\t", "La lista de Schindler", "\n\t", "Atrápame si puedes", "\n\t", "El mundo perdido: Parque Jurásico", "\n\t", "Letras explícitas", "\n\t", "Siete años en el Tíbet", "\n\t", "Patch Adams", "\n", "Documentales y Especiales", "\n\t", "¿Por qué me mataron? (N original) – 14 de abril", "\n\t", "Mi amor: Seis grandes historias de amor (N original) – 13 de abril", "\n\t", "Dolly Parton: A Musicares Tribute (N original) – 7 de abril", "\n\t", "Guía Headspace para el buen dormir (N original)", "\n\t", "La vida a color con David Attenborough (N original)", "\n\t", "Héroes: silencio y Rock & Roll", "\n\t", "Prejuicio cifrado", "\n", "Niños y Familia", "\n\t", "La familia Mitchel vs. Las maquinas (N original) – 30 de abril", "\n\t", "Rápidos y Furiosos: Espías al volante, Tempaorada 4: México (N original) – 16 de abril", "\n\t", "Reunión familiar (N original) – 5 de abril", "\n\t", "Shrek", "\n\t", "Shrek 2", "\n\t", "Los héroes del Apocalipsis: ¡Felices días finales! (N original)", "\n", "Anime", "\n\t", "De yakuza a amor de casa (N original) – 8 de abril", "\n\t", "Yasuke (N original) – 29 de abril", "\n\t", "Demon Slayer: Kimetsu no Yaiba (N original) – 1 de abril", "\n", "Miguel Bravo es editor de IGN Latinoamérica. Amante de todo lo que viene de Japón, los videojuegos y las buenas historias. Estudiante de una ingeniería en animación y del idioma japonés. Puedes seguirlo en redes sociales como ", "@ElDetectiveMike"]},
{"title": ["Xbox Series S ya tiene descuento en México, a solo unos días de su lanzamiento"], "content": ["Hace justo una semana fue el lanzamiento de las consolas Xbox de siguiente generación, incluyendo Xbox Series X que es la de mayor potencia y la ", "Xbox Series S", " que viene sin unidad de disco.", "La Xbox Series X se agotó rápidamente en prácticamente todos los establecimientos debido a que era la más solicitada y a la limitada cantidad de unidades disponibles, pero la Xbox Series S aún se puede conseguir en diversas tiendas de México.", "Lo que llama la atención en este momento es que a unos cuantos días de su salida Xbox Series S ya se puede conseguir con descuento, y es que en Amazon México tiene un 10 por ciento de descuento sobre su precio regular. De esta manera en lugar de pagar MXN $8,499 que es el precio regular de la Series S, la pueden adquirir por MXN $7,649. Al momento de la publicación de esta nota aún sigue activa la promoción, y como pueden ver en la captura a continuación se entregará a partir del próximo 23 de noviembre.", " ", "Xbox Series X y Xbox Series S ya están disponibles, y ", "en este enlace pueden ver 6 cosas que nos gustaron de la consola más potente", ".", "En otras notas recientes, ", "estos son los juegos de Xbox Series X y PS5 confirmados con crossplay hasta el momento", ", ", "arte conceptual nos muestra cómo lucirá el siguiente Mass Effect", ", ", "Zack Snyder reveló un nuevo tráiler de Justice League", ", y ", "así pueden obtener la nueva actualización de PS5 que mejora su rendimiento", "."]},
{"title": ["Xbox Series S ya tiene descuento en México, a solo unos días de su lanzamiento"], "content": ["Hace justo una semana fue el lanzamiento de las consolas Xbox de siguiente generación, incluyendo Xbox Series X que es la de mayor potencia y la ", "Xbox Series S", " que viene sin unidad de disco.", "La Xbox Series X se agotó rápidamente en prácticamente todos los establecimientos debido a que era la más solicitada y a la limitada cantidad de unidades disponibles, pero la Xbox Series S aún se puede conseguir en diversas tiendas de México.", "Lo que llama la atención en este momento es que a unos cuantos días de su salida Xbox Series S ya se puede conseguir con descuento, y es que en Amazon México tiene un 10 por ciento de descuento sobre su precio regular. De esta manera en lugar de pagar MXN $8,499 que es el precio regular de la Series S, la pueden adquirir por MXN $7,649. Al momento de la publicación de esta nota aún sigue activa la promoción, y como pueden ver en la captura a continuación se entregará a partir del próximo 23 de noviembre.", " ", "Xbox Series X y Xbox Series S ya están disponibles, y ", "en este enlace pueden ver 6 cosas que nos gustaron de la consola más potente", ".", "En otras notas recientes, ", "estos son los juegos de Xbox Series X y PS5 confirmados con crossplay hasta el momento", ", ", "arte conceptual nos muestra cómo lucirá el siguiente Mass Effect", ", ", "Zack Snyder reveló un nuevo tráiler de Justice League", ", y ", "así pueden obtener la nueva actualización de PS5 que mejora su rendimiento", "."]},
{"title": ["Microsoft trabaja en por qué PS5 supera a Xbox Series X en ciertos juegos"], "content": ["Si bien Microsoft ha estado promocionando que la ", "Xbox Series X", " como la \"consola más poderosa del mundo\", la ", "PS5", " la está superando en las primeras pruebas de juego, y Microsoft está trabajando en conocer el motivo.", "Tal como reporta The Verge, Digital Foundry ha estado analizando algunos de los nuevos juegos tanto en la PS5 - que es capaz de 10.28 teraflops de rendimiento de la GPU - como en Xbox Series X - que es capaz de 12 teraflops - y no es tan unilateral como parecía inicialmente.", "En Devil May Cry 5, la Xbox Series X tiene un mejor rendimiento en los modos 4K y de ray tracing, pero la opción de mayor velocidad de fotogramas funciona mejor en PS5, con las diferencias de velocidad de fotogramas en más de 40 fps en algunos casos.", "\"Las caídas me parecen realmente extrañas, y me sugiere algún tipo de limitación de API en el lado de Xbox, donde la GPU está siendo retenida por algo\", sugiere el editor de Digital Foundry, Richard Leadbetter.", " ", "Assassin's Creed Valhalla, que ha sido fuertemente promocionado por Microsoft, también funciona un poco mejor en PS5, con la versión de Xbox Series X mostrando screen tearing y caídas regulares de framerate por debajo de 60 fps.", "La misma historia se desarrolla en Dirt 5, donde la calidad de imagen y la resolución favorecen a PS5. El desarrollador de Dirt, Codemasters, ha reconocido esta brecha de rendimiento y ya ha dicho que tienen una solución en proceso.", "Call of Duty: Black Ops Cold War funciona mejor en el modo de rendimiento de ray tracing en Xbox Series X, pero en PS5 funciona mejor en el modo de 120 fps.", " ", "¿Por qué ocurre esto en múltiples juegos? Algunos desarrolladores han hablado con The Verge y han dicho que algunos de los problemas surgen del hecho de que Microsoft solo permitió a los desarrolladores enviar juegos para la certificación Xbox Series X en junio, mientras que los desarrolladores tenían acceso a los kits de desarrollo de PS5 con mucha anticipación.", "Entonces, parece que este problema no es necesariamente un problema de plataforma, sino un problema con los desarrolladores que no tuvieron suficiente tiempo para optimizar sus títulos para la ", "Xbox Series X", ". Microsoft ha reconocido este problema y promete que está trabajando con los desarrolladores para resolver cualquier complicación.", "\"Somos conscientes de los problemas de rendimiento en un puñado de títulos optimizados en Xbox Series X | S y estamos trabajando activamente con nuestros socios para identificar y resolver los problemas para garantizar una experiencia óptima\", dijo un portavoz de Microsoft en un comunicado a The Verge. \"A medida que comenzamos una nueva generación de consolas, nuestros socios recién están rascando la superficie de lo que pueden hacer las consolas de siguiente generación y se esperan correcciones de errores menores a medida que aprendan cómo aprovechar al máximo nuestra nueva plataforma. Estamos ansiosos por seguir trabajando con los desarrolladores para seguir explorando la capacidad de Xbox Series X | S en el futuro\".", " ", "La ", "Xbox Series X", " tiene ciertas ventajas sobre la PS5, en el papel, como la frecuencia de actualización variable y el soporte completo de AMD RDNA2, pero muchos desarrolladores aún necesitan tiempo para aprovechar toda la potencia que ofrece la consola de Microsoft.", " "]},
{"title": ["Entrevista con Bernardo Guzmán de Nintendo Latam E3 2015"], "publishing_date": ["18 de Junio de 2015"]},
{"title": ["Recorriendo E3 2015 Parte 1"], "publishing_date": ["18 de Junio de 2015"]},
{"title": ["Aliens: Fireteam - walktrough de las clases Gunner y Technician - IGN First"], "publishing_date": ["12 de Marzo de 2021"]},
{"title": ["15 juegos que llegarán a PlayStation 4 Pro"], "publishing_date": ["8 de Septiembre de 2016"]},
{"title": ["Entrevista con Colin Graham, director de animación de Watch Dogs 2"], "publishing_date": ["11 de Noviembre de 2016"]},
{"title": ["Estrenos y lanzamientos del 11 al 17 de enero de 2021"], "publishing_date": ["10 de Enero de 2021"]},
{"title": ["Sony celebra 500 millones de sistemas PlayStation vendidos con un PS4 Pro edición limitada"], "content": ["Sony está celebrando el hito de 500 millones de sistemas PlayStation vendidos con el PS4 Pro 500 Million Limited Edition.", "Anunciado en el ", "PlayStation Blog,", " esta consola edición limitada llega justo después de que 525.3 millones de consolas PlayStation fueron vendidas alrededor del mundo. Como un \"gracias\" para los fans, Sony producirá 50,000 unidades de este PS4 Pro.", "El PS4 Pro 500 Million Limited Edition cuenta con \"una consola de color azul oscuro translúcido y un control inalámbrico DualShock 4, PlayStation Camera, Soporte Vertical y Audífonos Mono\". El PS4 Pro cuenta con un disco duro de 2TB.", "Cada sistema tendrá una placa de cobre conmemorativa en frente con el número de serie.", "Más interesante, habrá unidades \"extra especiales\" que conmemoran fechas importantes en la historia de PlayStation, incluyendo \"09995 (9 de septiembre de 1995 – fecha de lanzamiento estadounidense de la PlayStation original), 01115 (15 de noviembre de 2013 – fecha de lanzamiento estadounidense de PS4) y 01013 (13 de octubre de 2016 – fecha de lanzamiento estadounidense PS VR)\".", "No hay mención si estas unidades \"extra especiales\" incluirán algo más que los paquetes estándar del PS4 Pro 500 Million Limited Edition .", "Para aquellos que no quieran comprar el PS4 Pro, el DualShock 4 500 Million Limited Edition estará disponible por $64.99 dólares.", "Para continuar la celebración, Sony lanzará un audífono dorado 500 Million Limited Edition a $99.99 dólares, que contará con el \"mismo diseño azul oscuro translúcido con detalles de cobre\".", "La PS4 Pro 500 Million Limited Edition estará disponible en tiendas el 24 de agosto de 2018 por $499.99 dólares, con el DualShock 4 y audífono dorado estando disponibles a inicios de septiembre."]},
{"title": ["Spider-Man: Miles Morales Gameplay Trailer"], "publishing_date": ["16 de Septiembre de 2020"]},
{"title": ["Guía de lanzamientos octubre 2019"], "publishing_date": ["1 de Octubre de 2019"]},
{"title": ["Dragon Ball Super: ¿por qué Shenlong le tiene miedo a Bills?"], "content": ["En Dragon Ball también hay reglas que se siguen al pie de la letra y una de ellas es que Shenlong no puede conceder deseos que estén por encima de su propio poder.", "Algunos de esos deseos tiene que ver con quitarle la vida a seres que estén por encima de su propio poder, así que poder eliminar a Bills es básicamente imposible, bueno, literalmente imposible.", "Y es esa una de las pocas razones por las que este debería tenerle miedo a Bills, pero la razón es otra completamente otra y tiene mucho sentido.", "La razón por la que Shenlong le tiene miedo a Bills en la película \"La Batalla de los Dioses\" es simple, pues siendo que Shenlong está atado a Dende, el hecho de que Bills es un ser más poderoso que Goku, y a la vez, más poderoso que Dende, querría decir que si este Dios de la Destrucción tenía planeado destruir la Tierra, no habría quien pudiera detenerlo, y al destruir la Tierra misma, Dende sería erradicado con esta y, en consecuencia, Shenlong dejaría de existir también.", "Tiene todo el sentido del mundo que tenga miedo, pero creo que Dende mismo debería encontrar la manera de ser más fuerte, pues creo que no sirve de mucho su poder ahora que todo mundo es más fuerte que él, incluso creo que él mismo podría aumentar su poder con las esferas del dragón... Aunque tal vez sea una de las reglas que tienen, tal vez hay un límite en esto también. Eso sería bueno investigarlo igual, los mantendremos informados sobre esto.", "Miguel Bravo es editor de IGN Latinoamérica. Amante de todo lo que viene de Japón, los videojuegos y las buenas historias. Estudiante de una ingeniería en animación y del idioma japonés. Puedes seguirlo en redes sociales como ", "@ElDetectiveMike"]},
{"title": ["Dragon Ball Super: ¿por qué Shenlong le tiene miedo a Bills?"], "content": ["En Dragon Ball también hay reglas que se siguen al pie de la letra y una de ellas es que Shenlong no puede conceder deseos que estén por encima de su propio poder.", "Algunos de esos deseos tiene que ver con quitarle la vida a seres que estén por encima de su propio poder, así que poder eliminar a Bills es básicamente imposible, bueno, literalmente imposible.", "Y es esa una de las pocas razones por las que este debería tenerle miedo a Bills, pero la razón es otra completamente otra y tiene mucho sentido.", "La razón por la que Shenlong le tiene miedo a Bills en la película \"La Batalla de los Dioses\" es simple, pues siendo que Shenlong está atado a Dende, el hecho de que Bills es un ser más poderoso que Goku, y a la vez, más poderoso que Dende, querría decir que si este Dios de la Destrucción tenía planeado destruir la Tierra, no habría quien pudiera detenerlo, y al destruir la Tierra misma, Dende sería erradicado con esta y, en consecuencia, Shenlong dejaría de existir también.", "Tiene todo el sentido del mundo que tenga miedo, pero creo que Dende mismo debería encontrar la manera de ser más fuerte, pues creo que no sirve de mucho su poder ahora que todo mundo es más fuerte que él, incluso creo que él mismo podría aumentar su poder con las esferas del dragón... Aunque tal vez sea una de las reglas que tienen, tal vez hay un límite en esto también. Eso sería bueno investigarlo igual, los mantendremos informados sobre esto.", "Miguel Bravo es editor de IGN Latinoamérica. Amante de todo lo que viene de Japón, los videojuegos y las buenas historias. Estudiante de una ingeniería en animación y del idioma japonés. Puedes seguirlo en redes sociales como ", "@ElDetectiveMike"]},
{"title": ["Resident Evil de Netflix: fotografías oficiales revelan la apariencia de Leon y Claire"], "content": ["Netflix compartió nuevas imágenes de Leon S. Kennedy y Claire Redfield para la próxima serie CGI, Resident Evil: Infinite Darkness.", "Las dos nuevas imágenes de personajes se dieron a conocer en un tweet ", "de la cuenta oficial de Netflix NX, que también confirmó que la serie animada Resident Evil estará", " \"ambientada en el canon de la clásica franquicia de terror de supervivencia de Capcom\".", "\n\n", "Netflix", "\n", " ", " ", "\n\n", "Netflix", "\n", " ", "\"Cuando los peligros biológicos se vuelven locos, solo un par de asesinos de zombis veteranos pueden hacer el trabajo\", se lee en el tweet junto con el par de imágenes de vista previa. Las imágenes ofrecen a los fanáticos una mirada más cercana a los héroes de Resident Evil 2 que están tomando la iniciativa en la nueva serie de acción y terror CGI, que actualmente está programada para un lanzamiento global exclusivamente en Netflix en 2021.", "La nueva serie está siendo producida por Hiroyuki Kobayashi de Capcom, quien ha sido responsable de dar vida a numerosos títulos de la serie Resident Evil. TMS Entertainment, que ha dado a luz a varias series de anime, producirá Resident Evil: Infinite Darkness de Netflix, con Quebico y Kei Miyamoto, el productor de Resident Evil: Vendetta, supervisando la animación 3DCG de la serie.", "Además de Resident Evil: Infinite Darkness, Netflix también está trabajando ", "duro en una adaptación live-action de la franquicia", ", que contará una nueva historia en dos líneas de tiempo centradas en las hermanas Jade y Billie Wesker. La primera temporada de ocho episodios cobrará vida gracias al alumno de Supernatural, Andrew Dabb, quien se desempeñará como productor ejecutivo y showrunner de la serie.", "Fuera de Netflix,", " Resident Evil también está recibiendo el tratamiento de reinicio con una nueva película de historia de origen actualmente en desarrollo", ". Esta adaptación tiene como objetivo recrear la \"aterradora experiencia visceral\" de los dos primeros juegos de la franquicia con una historia que está protagonizada por Kaya Scodelario como Claire Redfield, Hannah John-Kamen como Jill Valentine y Robbie Amell como Chris Redfield, entre varios otros.", "Con múltiples proyectos de Resident Evil en trámite, junto con Resident Evil Village planeando una fecha de lanzamiento para 2021, el próximo año debería ser horriblemente brillante para los fanáticos de la querida franquicia de terror."]},
{"title": ["Resident Evil: Infinite Darkness es presentada por Netflix"], "content": ["Netflix Portugal ha liberado un nuevo tráiler de Resident Evil: Infinite Darkness, una nueva película CGI con Claire Redfield, Leon S. Kennedy y más personajes que está programada para ser lanzada en 2021.", "Cabe señalar que al momento de escribir este artículo, ninguna otra cuenta de ", "Netflix", " ha publicado el avance, por lo que es posible que se haya lanzado antes de que se estableciera el anuncio oficial.", "\n", "Eu? Com medo? Não... Nada! ", "pic.twitter.com/XuYcHRxZG0", "\n— Netflix Portugal (@NetflixPT) ", "September 26, 2020", "Hasta el momento no se ha publicado más información al respecto y solo se ha confirmado que las estrellas de Resident Evil 2 y su reciente remake probablemente serán los protagonistas de la película.", "Esto parece ser diferente a la adaptación de Resident Evil live action confirmada previamente para Netflix que se centrará en múltiples líneas de tiempo y las hermanas Jade y Billie Wesker.", "Con este proyecto y la próxima serie live action de Netflix, junto con ", "Resident Evil Village", " planeando con una fecha de lanzamiento para 2021, el próximo año debería ser horriblemente brillante para los fans de la querida franquicia de terror.", "Por cierto, en la galería a continuación pueden ver una buena cantidad de imágenes de Resident Evil Village:", "Mientras tanto estaremos atentos a más información sobre Resident Evil: Infinite Darkness que luce interesante.", " "]},
{"title": ["6 cosas que nos gustaron del Xbox Series X"], "publishing_date": ["11 de Noviembre de 2020"]},
{"title": ["Xbox Games with Gold: estos son los títulos gratuitos de abril de 2021"], "content": ["Xbox Game with Gold ya ha anunciado los juegos que llegarán este abril de 2021 y con ello tenemos cuatro juegos nuevos, que añadiremos a nuestra colección dentro de poco.", "Así que prepara esa descargas, pues estos son los juegos que puedes encontrar dentro de poco bajo el servicio de Game with Gold en tu consola Xbox.", "\n\t", "Vikings: Wolves of Midgard", "\n", "Disponible desde el 1 hasta el 30 de abril", "\n\t", "FIA European Truck Racing Championship", "\n", "Disponible entre el 16 de abril y el 15 de mayo", "\n\t", "Dark Void", "\n", "Disponible desde el 1 hasta el 15 de abril", "\n\t", "Hard Corps: Uprising", "\n", "Desde el 16 hasta el 30 de abril", "Sinceramente esperábamos algunos juegos un poco más llamativos pero de igual manera hay cosas muy interesantes, en especial los dos juegos de Xbox 360, pues son títulos que han sido muy bien recibidos por el público general.", "Mientras que los otros dos juegos, siendo honesto, no los conocía sino hasta ahora, por lo que no podría decir si son o no realmente buenos, afortunadamente son gratuitos y con eso podemos probarlos y ver lo que tienen que ofrecer.", "No olvides que actualmente Xbox se está enfocando mucho en sus sistema de Game Pass, por lo que si no te convencen estos juegos, hay todo un catálogo muy interesante con títulos de Bethesda dentro de Game Pass. Vale mucho la pena contratar el Ultimate y más porque te regalan más juegos con cada mes que pasa, sumado a todo lo que constantemente agregan al enorme catálogo de Game Pass.", "¿Qué opinas de estos juegos de Xbox Game with Gold? Nos interesa saber tu opinión.", "Miguel Bravo es editor de IGN Latinoamérica. Amante de todo lo que viene de Japón, los videojuegos y las buenas historias. Estudiante de una ingeniería en animación y del idioma japonés. Puedes seguirlo en redes sociales como ", "@ElDetectiveMike"]},
{"title": ["PS5: así puedes obtener la nueva actualización que mejora el rendimiento del sistema"], "content": ["Sony lanzó la actualización 20.02-02.25.00 para PlayStation 5, la cual pesa 866MB.", "Los detalles no se conocen en este momento, y la descripción oficial simplemente dice que \"esta actualización del software del sistema mejora el rendimiento del sistema\". Nos hemos puesto en contacto con Sony para comentar sobre qué debería cambiar la actualización.", "Desde su llegada, los informes no confirmados han apuntado a problemas potenciales con el modo de reposo de PS5 y fallas relacionadas con el disco duro externo; esta actualización puede ser un intento de solucionarlos.", "Lamentablemente, después de haberla probado, esta actualización aparentemente no soluciona el error de la cola de descarga que ha afectado a Call of Duty: Black Ops Cold War, entre otros juegos.", "Si desea descargar el parche manualmente, dirígete a: Configuración> Sistema> Software del sistema> Actualización y configuración del software del sistema> Actualizar software del sistema.", "La actualización llega poco antes del segundo día de lanzamiento de la PS5, cuando se llegará en muchos territorios nuevos, incluido Europa, luego de su lanzamiento el 12 de noviembre en EE. UU., Japón, Canadá, México, Australia, Nueva Zelanda y Corea del Sur.", "Para más de la nueva consola de siguiente generación, no te pierdas nuestro unboxing en el siguiente video: "]},
{"title": ["Unboxing Xbox Series X y Series S"], "publishing_date": ["30 de Octubre de 2020"]},
{"title": ["Recorriendo E3 2015 Parte 3"], "publishing_date": ["19 de Junio de 2015"]},
{"title": ["Zack Snyder's Justice League: Clip exclusivo, Los orígenes de la Caja Madre- IGN Fan Fest 2021"], "publishing_date": ["27 de Febrero de 2021"]},
{"title": ["Review Marvel's Spider-Man"], "publishing_date": ["7 de Septiembre de 2018"]},
{"title": ["Dragon Ball: ¿conocías la extraña fusión entre Cell y Krillin?"], "content": ["Uno de los elementos que más aman los fans de Dragon Ball son las fusiones; que sencillamente son la unión de dos personajes para crear uno nuevo, casi siempre con el objetivo de volverse más poderosos para derrotar a un rival en turno. Por ejemplo, Vegetto y Gotenks, las uniones de Gokú y Vegeta; y Goten y Trunks, respectivamente, para enfrentarse a Majin Buu en sus diversas formas.", "Pero, ¿en algún momento las fusiones se salieron de control? Bueno, en Dragon Ball Z vimos a Gotenks fallar dos veces y dar como resultado a Gotenks gordo y Gotenks flaco, además de Den-Goku, la hipotética fusión de Dendé y Gokú o Gokután, el saiyajin + Mister Satán; las cuales fueron creadas en la mente del héroe mientras pensaba con quien unirse con los pendientes Pothala para enfrentarse a Super Buu.", "\n", "Toei Animation", "\n", " ", "También tenemos Dragon Ball Fusions, el videojuego de Bandai Namco para Nintendo 3DS donde, como su nombre indica, se enfoca en las fusiones de los personajes que se te ocurran, dando como resultado uniones tan locas como Yamta (Yamcha + Vegeta), Colohan (Piccolo + Gohan), Janks (Jaco + Trunks) y Rappa (Raditz + Nappa). Pero seguramente ninguna de ellas te parecerá tan… extraña como la que te mostraremos a continuación, la cual está compuesta por Cell y Krillin.", "Esta fusión aparece en el videojuego Dragon Ball Z: Budokai y se origina en una pesadilla del bioandroide, en la que absorbe al humano más poderoso de la Tierra por error, mientras intentaba absorber a la Androide 18, en los días previos a los Cell Games. Resulta que luego de tragarse al Androide 17, Krillin interviene para evitar que el villano también se comiera a la rubia, así que la empuja y en su lugar el absorbido es él.", "\n", "Bandai Namco", "\n", "El resultado de esta extraña combinación es un nuevo personaje llamado Cellin; que bien parece un Cell Jr. con la cabeza del amigo de Gokú y algunas de sus características, como su seis puntos en la calva, los colores naranjas y el símbolo de la Tortuga en la Espalda y el pecho.", "Por supuesto, para Cell es una pesadilla porque tras esta fusión, su poder de pelea comienza a descender en caída libre. Con esta forma, Cellin apenas es capaz de vencer a Yamcha y finalmente, es destruido por Ten Shin Han.", "\n", "Bandai Namco", "\n", " ", "En este momento es cuando el villano despierta y se da cuenta que su cuerpo perfecto sigue ahí y que la unión con Krillin fue sólo una pesadilla. Así, respirando tranquilamente, puede volverse a dormir de cara a los Cell Games.", " ", "Si quieres leer más contenido del mundo de Dragon Ball, dale un vistazo a: ", "Jiren vs. Gokú y los 10 mejores combates de Dragon Ball Super", " y", " ¿Broly vs Jiren? ¿Quién es más poderoso?", "Jemima Sebastián hace de todo un poco en IGN Latinoamérica. Ama el anime, los deportes y la fotografía. Encuéntrala en ", "Twitter", " e ", "Instagram", " como @jemafg"]},
{"title": ["Resident Evil: Netflix filtra detalles de la serie"], "content": ["El año pasado, se reportó que Netflix estaba desarrollando una serie live-action de Resident Evil. Ahora, su descripción aparentemente se ha filtrado y parece confirmar que el show de horror se dirige a un dispositivo de streaming cerca de ti en el futuro cercano.", "El usuario de ResetERA ", "Jawmuncher", " encontró la descripción ahora eliminada en el Media Center de Netflix. Mientras que ya no se puede encontrar ahí, un viaje rápido en la ", "Wayback Machine", " te permite ver el párrafo que nos da un adelanto a lo que la serie podría ser.", "\"El pueblo de Clearfield, MD ha estado un largo tiempo bajo la sombra de tres gigantes aparentemente sin relación - la Corporación Umbrella, el Asilo desmantelado Greenwood, y Washington, D.C. Hoy, veintiseis años tras el descubrimiento del T-Virus, secretos mantenidos por los tres comenzarán a ser revelados ante las primeras señales de una epidemia\".", "Esta descripción se alinea con el reporte de ", "Deadline del enero pasado acerca de la existencia de la serie", ", que decía que esta \"exploraría los procesos internos de la Corporación Umbrella y el nuevo orden mundial causado por la epidemia del T-Virus\".", "El que una serie de Resident Evil de Netflix llegara este año sería algo genial para los fans que ya están recibiendo el remake de Resident Evil 3: Nemesis el 3 de abril de 2020.", "Esto tampoco es el único rumor de Resident Evil que está flotando por ahí, ya que un reporte reciente sugirió que ", "Resident Evil 8 podría quedarse en perspectiva de primera persona, así como el regreso de Ethan Winters de Resident Evil 7, y podría presentar algo similar a hombres lobo", "."]},
{"title": ["Resident Evil 8 te llevará a una aldea tétrica, gótica y letal"], "content": ["Resident Evil VIII: Village ha sido revelado como uno de los títulos que llegarán a la consola de próxima generación de Sony, el PlayStation 5.", "Curiosamente, parece ser que los rumores y filtraciones previas eran bastante ciertos, con el juego poniéndote en los zapaos de Ethan Winters una vez más, explorando una misteriosa y letal aldea que parece estar siendo bajo el asedio de monstruosos hombres bestias.", "La próxima entrega de la legendaria franquicia de terror regresará a un formato en primera persona, como Resident Evil 7, y parece enfocarse en crear un ambiente completamente terrorífico en el que deberás intentar sobrevivir a alguna especie de nueva arma biológica, con rastros de la corporación Umbrella, lo que parece ser un culto de \"brujas\", y una conspiración que parece complicar las cosas más allá.", "La historia de Resident Evil finalmente se moverá hacia adelante una vez más con todos sus monstruos, villanos, y acertijos innecesariamente complejos pero divertidos, cuando el juego llegue a PlayStation 5 en el 2021."]},
{"title": ["Call of the Sea"], "publishing_date": ["7 de Mayo de 2020"]},
{"title": ["IGN Expo día 4: ¡Gameplay y Revelaciones Exclusivas! - Summer of Gaming en vivo"], "publishing_date": ["10 de Junio de 2020"]},
{"title": ["PlayStation: patente de Sony sugiere que podríamos usar un plátano como control"], "content": ["Sony ha patentado una tecnología que permitiría a los jugadores convertir objetos domésticos e incluso frutas en controles de ", "PlayStation", ". Los jugadores usarían una cámara para escanear objetos para que el sistema los detecte, que luego podrían usarse para funciones específicas en el juego.", "De acuerdo al reporte de GamesIndustry.Biz, se presentó una patente reciente de Sony para la innovación, identificando que los periféricos del juego pueden ser vistos como demasiado complicados y costosos para algunos usuarios y razonando que, \"Sería deseable que un usuario pudiera usar un dispositivo simple, económico y no electrónico como periférico de videojuego\". ¿Su posible solución? Convertir objetos fácilmente disponibles en periféricos para juegos.", "Siempre que un objeto sea \"no luminoso\" y \"pasivo\", Sony sugiere que podría usarse como control. Las figuras de la patente muestran un plátano y un par de naranjas como ejemplo de posibles periféricos. La patente dice que un usuario podría sostener el objeto frente a una cámara, que podría interpretar el objeto para imponerle entradas y hacerlo utilizable en el juego.", "La copia también habla de cómo la tecnología podría generar \"una imagen de realidad aumentada de un control pasivo no luminoso\", y luego detectar cambios en la pose del objeto para adaptarse a los movimientos de la mano de un jugador y generar entradas virtuales superpuestas, mencionando un \"detector de dedos\". En la figura que se muestra a continuación, pueden ver los botones X y Triángulo superpuestos en un plátano, como un ejemplo de esta idea en acción:", "\"La figura 8 ilustra esquemáticamente un ejemplo de cómo el objeto no luminoso puede aparecer al usuario cuando uno o más botones virtuales se han superpuesto en la parte superior de la vista del objeto por parte del usuario\", dice la patente. La copia sugiere que una imagen del plátano con botones virtuales podría verse a través de un dispositivo montado en la cabeza, una imagen \"superpuesta en la parte superior de una pantalla transparente a través de la cual el usuario mira\" o un video que se muestra en la misma pantalla que mira el jugador. Entonces, una vez que se haya mapeado el plátano, podrás ver dónde debe presionar con los dedos para obtener entradas.", "Otras implementaciones incluyen el uso de movimiento para conducir usando dos naranjas como un volante, cambiar el punto de vista con un periférico doméstico a través de ejes generados e incluso ingresar \"un comando de 'pausa'\" colocando una taza en un platillo mientras ambos objetos son detectados por la tecnología.", "Los ingenieros han usado previamente frutas para jugar juegos, por ejemplo, jugar Overwatch usando un montón de plátanos, pero eso ha sido principalmente mediante el uso de la conducción de electricidad de la fruta para generar comandos. Este es un proceso más profundo y potencialmente flexible.", " "]}
]