[
{"title": ["Libro El Fin De La Ansiedad - Gio Zararri [ Original ]"], "description": ["<<<------------------------------------------------->>>", "SINOPSIS", "El libro sobre la ansiedad que arrasa en internet.", "¿Qué es la ansiedad y por qué aparece en nuestra vida? Existe una solución para superarla que nos ayudará a convivir con sus síntomas y a convertirnos en personas más fuertes y felices.", "Todo lo que necesitas para vencer la ansiedad lo tienes dentro de ti. En este libro encontrarás las herramientas para comprender por qué esta emoción se presenta en tu vida y aprenderás a ponerle remedio. Descubrirás que convivir con ella puede ser sencillo e incluso divertido.", "El fin de la ansiedad es uno de los libros mejor valorados sobre este tema en internet, y es recomendado en revistas web de psicología y estilo de vida. Su autor, Gio Zararri, a través de su propia experiencia con la enfermedad, nos ayudará a cambiar el modo de entender y superar uno de los problemas psicológicos más extendidos en nuestra época. Desde la cercanía y el humor, Zararri nos enseña que la ansiedad siempre llega debido a la necesidad inminente de realizar un cambio: el nuestro.", "<<<------------------------------------------------->>>", "DETALLES DEL LIBRO", "Pasta blanda: 208 páginas", "Editor: Vergara (22 de octubre de 2019)", "Idioma: Español", "ISBN-10: 8417664335", "ISBN-13: 978-8417664336", "Dimensiones del producto: 13.9 x 1.4 x 20.2 cm", "Peso del envío: 240 g"], "price": ["559", "56"]},
{"title": ["Matematicas Financieras Con Excel Pierdant Patria P122304"], "description": ["LIBRO FÍSICO - NUEVO - ORIGINAL", "Edición 2015, páginas 296", "La matemática financiera en la actualidad tiene una gran importancia por su utilidad en la administración, la economía, en las políticas públicas, así como en diversas ramas en donde es empleada como auxiliar de cálculos en la ingeniería económica para la valuación de inversiones en maquinaria, equipos, instalacio nes, tecnología, infraestructura y, en general, en cualquier inversión que signifique un proceso en el cual deba realizarse una evaluación de proyecto. También es útil para el pequeño inversionista en el análisis de opciones de crédito, en la adquisición de bienes y servicios cotidianos que le permitan tener mejores condiciones de vida y para toda persona que tenga la necesidad de utilizar el sistema financiero. En esta segunda edición, se presentan los conceptos con un lenguaje sencillo y ameno. Se realizaron las modificaciones y adecuaciones a tos ejemplos dentro del ámbito nacional e internacional. Se incorporo el capítulo Progresiones aritméticas y geométricas enfocado al ámbito financiero. Cada subtema está estructurado con ejemplos sencillos y se va aumentando su complejidad, con la idea que el alumno adquiera seguridad y confianza; lo anterior le permitirá resolver los problemas propuestos al final de cada unidad o cualquiera que se le llegue a presentar en la vida académica o profesional con éxito."], "price": ["515", "51"]},
{"title": ["Labview - Entorno Gráfico De Programación 3ª Edición"], "description": ["Autores LAJARA VIZCAíNO, José Rafael ; PELEGRÍ SEBASTIÁ, José", "Editorial Alfaomega, Marcombo", "Año de edición 2018", "Código de barras 9786075380070", "ISBN 978-607-538-007-0", "Materiales adicionales No", "Número de la edición 3", "Número de páginas 560", "Dimensiones 17x23 cms.", "Peso en gramos 785", "Encuadernación Rústica", "Idioma  Español", "Estado  Nuevo", "Este texto presenta una exposición completa, detallada y actualizada de LabVIEW, la tecnología que ha permeado en áreas como Teleoperación, SCADA, Biomedicina, Control y Regulación, Vibraciones, Percepción Electromovilidad, Acústica, Domótica, Robótica, etc. Se abordan los conceptos más básicos de programación, las funciones más comunes como la creación y depuración de programas, la manipulación de textos y gráficas; los usos más frecuentes de LabVIEW como el control de instrumentos y adquisición de datos; enseguida se estudian conceptos más avanzados como ActiveX, uso de librerías compartidas, .Net, optimización de código, máquinas de estado y multihilo; se explican las herramientas VI Server y VI Scripting. Se aborda también de manera extensa la Programación Orientada a Objetos, así como conceptos sobre ingeniería del software aplicado a LabVIEW tales como análisis de código, control de versiones, herramientas de captura de requisitos, etc.; asimismo, se expone cómo controlar hardware de bajo coste como Arduino, Raspberry y robots de LEGO, y se explican algunos sistemas de hardware industrial como los basados en FPGA y PXI.", "VENTAJAS", "• Contiene una plataforma de contenidos complementarios muy útiles que el lector podrá descargar ingresando un código que se encuentra en el libro.", "• Es un documento escrito de manera detallada, completa y actualizada.", "• Cada capítulo cuenta con ejemplos y figuras que guían paso a paso al lector y una bibliografía que le ayudará a ampliar cualquier tema de su interés.", "CONOZCA", "• Las características y funcionalidad de las estructuras que operan en LabVIEW.", "• Los distintos tipos de datos de LabVIEW y sus características, así como la forma en que se almacenan en memoria.", "• Las principales funciones utilizadas para el manejo de ficheros en LabVIEW.", "APRENDA", "• A establecer comunicaciones en serie y en paralelo entre dispositivos.", "• A adquirir y generar señales eléctricas por medio de tarjetas de adquisición de datos.", "• A utilizar las prestaciones actualizadas que ofrece LabVIEW.", "DESARROLLE SUS HABILIDADES PARA", "• Utilizar las funciones de TCP y UDP en LabVIEW.", "• Aplicar técnicas avanzadas de programación con LabVIEW.", "• Crear de manera óptima el código de un programa en LabVIEW.", "A QUIÉN VA DIRIGIDO", "El presente libro está dirigido a estudiantes, profesionales y a todo lector interesado en aprender a manejar la plataforma LabVIEW."], "price": ["498", "49"]},
{"title": ["Algoritmos A Fondo - Con Implementaciones En C Y Java"], "description": ["Autores SZNAJDLEDER, Pablo", "Editorial Alfaomega", "Año de edición 2012", "Código de barras 9789871609376", "ISBN 978-987-1609-37-6", "Número de la edición 1", "Número de páginas 576", "Dimensiones 21x24 cms.", "Peso en gramos 1145", "Encuadernación Rústica", "Idioma Español", "Estado   Nuevo", "Este libro está diseñado para cubrir las necesidades de los alumnos universitarios que cursan las materias de Algoritmos I, II y III. Comienza desde cero, explicando los conceptos de lógica algorítmica y programación estructurada y llega hasta el análisis, diseño e implementación de algoritmos complejos y estructuras de datos dinámicas no lineales.", "Desarrolla un curso de programación donde se guía al alumno en un proceso de aprendizaje durante el cual podrá adquirir la lógica necesaria para diseñar e implementar algoritmos en lenguaje C (programación estructurada) y Java (programación orientada a objetos). En este curso, cada capítulo introduce un mayor nivel de dificultad, ya sea incorporando nuevos conceptos y recursos o bien, incorporando técnicas de programación más complejas.", "Algoritmos a fondo se compone de cuatro módulos que agrupan los diferentes capítulos, según el siguiente criterio:", "El Módulo 1 “Programación estructurada”", "La implementación de los algoritmos y conceptos que aquí se estudian se basa en los diagramas de Chapín; la estructura de estos diagramas es mucho más rígida que la del diagrama de flujo tradicional y ayuda al alumno a pensar en algoritmos compuestos por bloques de “única entrada” y “única salida”. Este razonamiento constituye una de las premisas fundamentales de la programación estructurada.", "En el Módulo 2 “Programación orientada a objetos”", "Se explican los conceptos de programación orientada a objetos, comenzando por la idea de “encapsulamiento”. Es decir: diseñar clases cuyos métodos encapsulen algoritmos complejos de forma tal un programador con menos conocimientos o menos experiencia los pueda utilizar sin tener que preocuparse por comprender su implementación.", "El Módulo 3 “Aplicación práctica”", "En sí mismo, un ejercicio integrador cuyo desarrollo requerirá aplicar gran parte de los conocimientos adquiridos durante los dos módulos anteriores. Estamos hablando de un programa compresor/descompresor de archivos basado en el “algoritmo de Huffman”. Aquí se obtendrá suficiente evidencia de las competencias", "adquiridas hasta el momento.", "Esta aplicación constituye un excelente ejercicio que inducirá al alumno a aplicar los principales conceptos estudiados desde el comienzo del libro: arrays, archivos y listas.", "En el Módulo 4 “Conceptos avanzados”", "Comenzando por el tema de recursión, se comparan las implementaciones recursivas e iterativas de diferentes funciones. Por ejemplo, el caso típico de la función factorial y el caso extremo de la función de Fibonacci cuya versión recursiva es incapaz de resolver, en un tiempo razonable, los términos de la serie superiores a 50.", "El autor complementa la obra con una serie de videos en los que explica temas que, dada su naturaleza, resultarían extremadamente tediosos de leer; cómo instalar Eclipse, cómo depurar un programa, etc."], "price": ["448", "44"]},
{"title": ["Libro Labview Entorno Grafico De Programacion 3ra Ed. 2018"], "description": ["!! ENVIO GRATIS POR MERCADO ENVIOS: DHL, FEDEX, ESTAFETA !!", "** SI REQUIERES FACTURA, TAMBIEN PODEMOS EMITIRLA", "Este texto presenta una exposición completa, detallada y actualizada de LabVIEW, la tecnología que ha permeado en áreas como Teleoperación, SCADA, Biomedicina, Control y Regulación, Vibraciones, Percepción Electromovilidad, Acústica, Domótica, Robótica, etc. Se abordan los conceptos más básicos de programación, las funciones más comunes como la creación y depuración de programas, la manipulación de textos y gráficas; los usos más frecuentes de LabVIEW como el control de instrumentos y adquisición de datos; enseguida se estudian conceptos más avanzados como ActiveX, uso de librerías compartidas, .Net, optimización de código, máquinas de estado y multihilo; se explican las herramientas VI Server y VI Scripting.", "Se aborda también de manera extensa la Programación Orientada a Objetos, así como conceptos sobre ingeniería del software aplicado a LabVIEW tales como análisis de código, control de versiones, herramientas de captura de requisitos, etc.; asimismo, se expone cómo controlar hardware de bajo coste como Arduino, Raspberry y robots de LEGO, y se explican algunos sistemas de hardware industrial como los basados en FPGA y PXI.", "VENTAJAS:", "* Contiene una plataforma de contenidos complementarios muy útiles que el lector podrá descargar ingresando un código que se encuentra en el libro.", "* Es un documento escrito de manera detallada, completa y actualizada.", "* Cada capítulo cuenta con ejemplos y figuras que guían paso a paso al lector y una bibliografía que le ayudará a ampliar cualquier tema de su interés.", "CONOZCA:", "* Las características y funcionalidad de las estructuras que operan en LabVIEW.", "* Los distintos tipos de datos de LabVIEW y sus características, así como la forma en que se almacenan en memoria.", "* Las principales funciones utilizadas para el manejo de ficheros en LabVIEW.", "APRENDA:", "* A establecer comunicaciones en serie y en paralelo entre dispositivos.", "* A adquirir y generar señales eléctricas por medio de tarjetas de adquisición de datos.", "* A utilizar las prestaciones actualizadas que ofrece LabVIEW.", "DESARROLLE SUS HABILIDADES PARA:", "* Utilizar las funciones de TCP y UDP en LabVIEW.", "* Aplicar técnicas avanzadas de programación con LabVIEW.", "* Crear de manera óptima el código de un programa en LabVIEW.", "", "A QUIÉN VA DIRIGIDO:", "El presente libro está dirigido a estudiantes, profesionales y a todo lector interesado en aprender a manejar la plataforma LabVIEW.", "Autores: LAJARA VIZCAíNO, José Rafael; PELEGRÍ SEBASTIÁ, José.", "Editorial: Alfaomega, Marcombo.", "Año de edición: 2018.", "Formato: Fisico, Impreso.", "ISBN: 978-607-538-007-0", "Número de la edición: 3.", "Número de páginas: 560.", "Dimensiones: 17x23 cms.", "Peso en gramos: 785.", "Encuadernación: Rústica.", "Idioma: Español."], "price": ["629", "63"]},
{"title": ["Curso De Programación Orientada A Objetos En C# Alfa 84992"], "description": ["LIBRO FÍSICO - NUEVO - ORIGINAL - TEXTO COMPLETO", "edición 2016, páginas 440", "El libro es un extenso manual acerca de diferentes metodologías para la resolución de problemas a través de la computadora mediante la efectividad al codificar, programar y diseñar herramientas; mediante ejemplos de la vida cotidiana que pueden ser modelados por paradigmas orientados a objetos. Expone los fundamentos de la programación orientada a objetos de sistemas, que son útiles para incrementar la productividad y eficacia en la resolución de problemas. Así mismo, incluye una aplicación práctica, sencilla y completa en modo consola, utilizando el lenguaje de programación C# .NET y además cuenta con una aplicación práctica mediante un programa en modo gráfico que utiliza formas (formularios) en C# .NET.", "A QUIEN VA DIRIGIDO", "Está dirigido a profesores y estudiantes de los cursos de Programación Orientada a Objetos (POO) y en general a profesionistas e interesados en la actualización del paradigma de diseño e implementación de sistemas computacionales."], "price": ["510", "51"]},
{"title": ["Java A Fondo Curso De Programación - Sznajdleder alfa 86284"], "description": ["LIBRO FÍSICO - NUEVO - ORIGINAL - TEXTO COMPLETO", "3 edición 2016, páginas 462", "Java a fondo, ya en su tercera edición, es un curso universitario de lenguaje y desarrollo de aplicaciones Java (actualizado a la versión 8) basado en un enfoque totalmente práctico, sin vueltas ni rodeos. El libro comienza desde un nivel “cero” y avanza hasta llegar a temas complejos como introspección de clases y objetos, acceso a bases de datos (JDBC), multiprogramación, networking y objetos distribuidos (RMI), entre otros. Incluye introducción a Hibernate y Spring.", "Se hace hincapié en la teoría de objetos: polimorfismo, clases abstractas, interfaces Java y clases genéricas así como en el uso de patrones de diseño que permitan desacoplar las diferentes partes que componen una aplicación para que esta resulte mantenible, extensible y escalable.", "La obra explica cómo diseñar y desarrollar aplicaciones Java respetando los estándares y lineamientos propuestos por los expertos de la industria convirtiéndose así en una herramienta fundamental para obtener las certificaciones internacionales SCJP (Sun Certified Java Programmer) y SCJD (Sun Certified Java Developer).", "Para ayudar a aclarar los conceptos, el autor incluye diagramas UML y una serie de video tutoriales que incrementan notablemente la dinámica del aprendizaje.", "Ventajas competitivas: Fue evaluado por docentes Mexicanos y se tomaron los cambios que ellos indicaron para que se adapte a las necesidades de su mercado. El revisor técnico es un prestigioso profesional Java y el prologuista es docente de UVM. Cuenta con videotutoriales muy didácticos.", "La forma en que se presentan los algoritmos de Java y su explicación posterior hace que el alumno se sumerja en la lectura, facilitando el aprendizaje."], "price": ["510", "51"]},
{"title": ["Android Studio - Aprende A Desarrollar Aplicaciones"], "description": ["Autores LUJÁN CASTILLO, José Dimas", "Editorial Alfaomega, RC Libros", "Año de edición 2017", "Código de barras 9786075380094", "ISBN 978-607-538-009-4", "Materiales adicionales No", "Número de la edición 1", "Número de páginas 332", "Dimensiones 17x23 cms.", "Peso en gramos 360", "Encuadernación Rústica", "Idioma Español", "Estado   Nuevo", "Android Studio es una herramienta con la que es posible implementar elementos básicos como el acceso a APIs, gestionar y administrar archivos, y agregar dependencias; la utilización de esta herramienta proporciona apoyo y agilidad al desarrollo de aplicaciones, ya que Android Studio ha cubierto algunas carencias que venían surgiendo con las herramientas de programación y ha establecido algunas reglas del desarrollo en Android. En la actualidad, uno de los retos de los desarrolladores es establecer una interacción con los usuarios, con la tecnología involucrada en el mundo móvil, con otras aplicaciones, y con los servidores.", "El presente libro está pensado para principiantes interesados en adentrarse en el desarrollo móvil Android; los conocimientos en el lenguaje de programación Java no son necesarios, pero contar con conocimientos básicos de programación facilitaría el aprendizaje de los temas aquí abordados. Sin embargo, con estudio, práctica y paciencia se podrá alcanzar la meta de desarrollar aplicaciones Android.", "VENTAJAS", "• Contiene impresiones de pantalla con las cuales se pretende que el lector entienda mejor lo que se explica en los ejercicios o ejemplos.", "• Explica paso a paso el desarrollo de interfaces, software y aplicaciones desde cero.", "• Cuenta con un índice analítico útil en la localización de conceptos de interés para el lector.", "CONOZCA", "• Los elementos que conforman la estructura de un proyecto.", "• Los componentes gráficos que intervienen en la creación de la interfaz para una aplicación.", "• Cómo interactúan los elementos dentro de una aplicación.", "APRENDA", "• A utilizar los Layouts adecuados para desarrollar aplicaciones en Android.", "• A trabajar con imágenes en el desarrollo de una aplicación en Android.", "• A crear una Activity utilizando cualquiera de los distintos métodos.", "DESARROLLE SUS HABILIDADES PARA", "• Crear fragmentos y establecer una comunicación entre ellos.", "• Instalar y utilizar los RecyclerView y CardView en una aplicación.", "• Gestionar un proceso para publicar una aplicación.", "A QUIÉN VA DIRIGIDO", "El presente libro está dirigido a estudiantes, diseñadores y autodidactas de la tecnología que deseen aprender el desarrollo de interfaces, software y aplicaciones desde cero, así como a quienes deseen profundizar en el universo Android."], "price": ["298", "29"]},
{"title": ["Fundamentos De Programacion: Diagramas De Flujo, Diagramas N"], "description": ["Te ofrecemos la mejor selección de libros, en nuestro catálogo encontrarás los mejores libros de literatura, ensayo, política, historia, además de libros infantiles, juveniles e ilustrados; y parte de nuestra selección de accesorios.", "También, podrás encontrar mandalas para relajarte, libros de pasatiempos, deportes, música y demás actividades.", "** MÉTODOS DE ENVÍO", "Estimado lector el tiempo de entrega es de 3 a 7 días hábiles a través de Mercado Envíos.", "No es necesario preguntar por disponibilidad."], "price": ["398", "378", "37"]},
{"title": ["Fundamentos De Programación En C++ DeAntonio Garrido"], "description": ["1.-Introducción 2.-La estructura de selección  3.-La estructura de repetición 4.-Funciones   5.-Vectores y matrices  6.-Punteros  7.-Memoria dinámica  8.-Estructuras 9.-Tipos aritméticos . Límites numéricos   10.-Funciones  11.-Recursividad  12.-Espacios de nombres y compilación separada   a)ingeniería del software  b)Solución de ejercicios"], "price": ["580", "48"]},
{"title": ["Docker - Guía Práctica"], "description": ["Autores GONZÁLEZ RODRÍGUEZ, Alberto", "Editorial Alfaomega, RC Libros", "Año de edición 2017", "Código de barras 9786076229637", "ISBN 978-607-622-963-7", "Materiales adicionales No", "Número de la edición 1", "Número de páginas 256", "Dimensiones 17x23 cms.", "Peso en gramos 360", "Encuadernación Rústica", "Idioma Español", "Estado   Nuevo", "El presente libro se constituye como una guía práctica para que el lector cuente con los elementos necesarios para la administración de Docker y el manejo de aplicaciones a través de contenedores. Docker es una forma de acceder a la tecnología de contenedores, y tiene como propósito facilitar la creación y manipulación de los contenedores. En la actualidad Docker es uno de los proyectos más populares que tiene el apoyo de empresas para su desarrollo y evolución.", "En esta era de la virtualización han surgido distintas tecnologías que tienen como función principal el ahorro en los costes de las empresas, así como el aumento de sus prestaciones; es en este contexto en el que surge con fuerza Docker como una solución para las nuevas necesidades que traído consigo el Big Data. Este documento aborda temas que van desde la instalación hasta la administración más avanzada, complementados con una gran variedad de ejemplos.", "VENTAJAS", "• La instalación de Docker se explica tanto para sistemas Linux, Windows y OSX.", "• Cuenta, a lo largo de su exposición, con explicaciones claras y concisas y ejemplos reales.", "CONOZCA", "• En qué consiste la instalación de Docker en Linux, OS X y Windows.", "• El proceso de creación de una imagen mediante Docker.", "• Las ventajas y desventajas de cada una de los drivers de almacenamiento que nos proporciona Docker.", "APRENDA", "• A crear, ejecutar e inspeccionar contenedores.", "• A asignar etiquetas a cada uno de los objetos de Docker y utilizar el filtrado.", "• A limitar los recursos que un contenedor puede utilizar: memoria, procesador o entrada/salida de disco", "DESARROLLE SUS HABILIDADES PARA", "• Convertir un contenedor en una imagen y publicar una imagen en el repositorio oficial.", "• Utilizar el Docker Compose para definir y ejecutar contenedores basados en una plantilla.", "• Aplicar las diversas funciones que ofrece Docker Cloud y Docker Hub.", "A QUIÉN VA DIRIGIDO", "Este libro está dirigido a lectores que deseen iniciarse en Docker o que tengan actualmente conocimientos y quieran profundizar en ellos."], "price": ["258", "25"]},
{"title": ["Seguridad Cibernetica - Hackeo Etico Y Programacion Defensiv"], "description": ["En un principio Internet era una transparente red de conocimiento e información de acceso libre; los temas relativos a la seguridad y la privacidad no tenían tanta importancia como en la actualidad, ya que aún no se comercializaba la red y nuestros datos personales no se difundían. Con el transcurso del tiempo nuestros datos comenzaron a emplearse para la cibercriminalidad, es decir, resultaba sencillo robar identidades y tarjetas de crédito al sustraer información de los bancos. Actualmente se pueden cifrar datos traficados entre redes y hacerlos ilegibles para los piratas, pero también los piratas han avanzado tecnológicamente. Es por ello que en este libro se analizan los temas relacionados con la seguridad en la generación de aplicaciones para Internet, esto es, las habilidades y conocimientos especiales para desarrollarlas de manera que brinden seguridad, la realización de pruebas de penetración y la programación defensiva. En este documento se muestra la conformación de Internet, del software y de las redes con el fin de proporcionar un completo entendimiento y de este modo crear las condiciones necesarias para la seguridad; también se expone el proceso para hacer ilegibles los datos mediante la criptografía. VENTAJAS • Cada capítulo contiene un listado de los objetivos perseguidos y una introducción. • A lo largo del libro se encuentran prácticas de laboratorio y múltiples figuras explicativas. • Cuenta con un índice analítico útil para una consulta puntual. CONOZCA • La estructura y los protocolos de una red. • En qué consiste un Protocolo de Internet (IP). • Qué es y cómo funciona el Protocolo de Transferencia de Hipertexto (HTTP). • Las partes que conforman el software, sus requisitos de seguridad y sus diagramas de arquitectura UML. APRENDA • A utilizar los distintos cifrados de encriptación. • A aplicar técnicas y herramientas para probar si una aplicación es vulnerable a un ataque. • A utilizar Secure Life Lifecycle (SSLC) para desarrollar un software de seguridad. • A llevar a cabo un modelado de amenazas. DESARROLLE SUS HABILIDADES PARA • Establecer una comunicación de red entre máquinas virtuales. • Utilizar la herramienta Kali Linux para las diez vulnerabilidades más comunes de OWASP (Proyecto Abierto de Seguridad en Aplicaciones en la Red). • Elaborar una programación defensiva. A QUIÉN VA DIRIGIDO Este libro está dirigido tanto a estudiantes y profesores como a desarrolladores y a todo lector interesado en estos importantes temas.", "** MÉTODOS DE ENVÍO", "Estimado lector el tiempo de entrega es de 3 a 7 días hábiles a través de Mercado Envíos.", "No es necesario preguntar por disponibilidad."], "price": ["338", "321", "32"]},
{"title": ["Microcontrolador Stm32 Programación Y Desarrollo"], "description": ["PRODUCTO:", "Nombre: Microcontrolador STM32 Programación y desarrollo", "Marca: RA-MA Editorial", "DESCRIPCIÓN:", "Este libro pretende ser un manual práctico que sirva de base en la creación de proyectos con los microcontroladores de la familia STM32F1. En él, se ha recopilado toda la información necesaria para iniciarse en la programación de estos microcontroladores con los entornos de desarrollo en lenguaje C++ y la utilización de todas las librerías CMSIS que el fabricante STMicroelectronics suministra para facilitar la labor de programadores y diseñadores de código en el uso de los diversos periféricos que poseen estos micros._x000D_", "Todos los microcontroladores de la familia STM32F1, poseen un núcleo de 32 bits basados en los procesadores ARM Cortex-M3, con una tecnología RISC más eficiente, que permite la ejecución de códigos a mayor velocidad que en otros micros y con la potencia de un micro industrial que se hace accesible y no limita la realización de proyectos tan complejos como la imaginación del usuario permita._x000D_", "Es por ello que, hemos querido que los lectores aprendan y puedan desarrollar proyectos con estos micros, mediante una gran cantidad de códigos de ejemplo, explicados paso a paso y proyectados para ser probados y ejecutados en cualquier placa que posean estos microcontroladores._x000D_", "El libro contiene material adicional que podrá descargar accediendo a la ficha del libro en www.ra-ma.es.", "MÁS DETALLES:", "Peso del paquete: 1 kg", "Meses de garantía: 1", "Garantía: Por defectos de fabricación.", "Condición: Nuevo", "Encuadernado: Pasta blanda", "Editorial: RA-MA Editorial", "Titulo del libro: Microcontrolador STM32 Programación y desarrollo", "Autor: Pestano Herrera, Jesús María", "Idioma: Español", "Edición: 1", "Editor: RA-MA Editorial", "Número de páginas: 364", "ISBN-13: 9788499647555", "SKU: 9788499647555", ""], "price": ["550", "55"]},
{"title": ["Programación Orientada A Objetos Y Estructura De Datos"], "description": ["Autores SZNAJDLEDER, Pablo; , Revisor técnico: Alberto Templos Carbajal", "Editorial Alfaomega", "Año de edición 2017", "Código de barras 9789873832277", "ISBN 978-987-383-227-7", "Materiales adicionales No", "Número de la edición 1", "Número de páginas 336", "Dimensiones 17x23 cms.", "Peso en gramos 360", "Encuadernación Rústica", "Idioma Español", "Estado   Nuevo", "Programación orientada a objetos y estructura de datos a fondo es un libro pensado para extender los conocimientos que fueron adquiridos a lo largo de los cursos de las asignaturas iniciales de programación; principalmente de Programación estructurada. La finalidad de iniciar explicando Programación Orientada a Objetos (POO) es proveer una herramienta que permita encapsular la lógica y la complejidad de aquellos algoritmos; ocultándola para no verla. Y así concentrarse en el análisis, diseño y desarrollo de algoritmos con mayor grado de complejidad. Para quienes adquirieron sus conocimientos básicos programando en C, la obra comienza explicando los conceptos principales de encapsulamiento implementándolos con C++. Pero esto es solo el comienzo, ya que el curso de programación avanzada que se propone transita por los senderos del lenguaje Java. ¿Por qué Java? Porque hoy en día, y desde hace más de 20 años, Java es el lenguaje de programación con mayor nivel de aceptación en el ámbito profesional. La mayoría de las empresas desarrollan sus aplicaciones en Java. Y, aunque aquí el foco principal estará puesto sobre la lógica algorítmica, cuando implemente estos algoritmos con Java, el lector estará adquiriendo una destreza que le permitirá incorporarse a trabajar en proyectos de desarrollo que utilicen este lenguaje.", "Además, el lenguaje de programación Java provee una muy extensa biblioteca de clases, por lo que estaremos exentos de tener que programar nosotros mismos cuestiones que, a esta altura, resultarían triviales y básicas.", "En temas que si aborda son las estructuras lineales (listas, pilas, colas) y métodos de ordenamiento de colecciones, lo que le permite concentrarse en entender su lógica de programación; pues la implementación ya la provee el lenguaje Java.", "VENTAJAS", "• La obra se divide en dos partes: la primera abarca la Programación Orientada a Objetos. Todo este paradigma de programación esta implementado en Java. Se explica el lenguaje y se compara su sintaxis y semántica con C/C++; de modo que aquellos lectores que tengan conocimientos previos sobre estos lenguajes puedan notar la gran cantidad de similitudes que existen entre ambos y tomar nota sobre las diferencias.", "• La segunda parte de la obra explica los algoritmos vinculados a las estructuras de datos más complejas: árboles y grafos. Algoritmos recursivos que permitan visitar todos los nodos de un árbol; diferentes tipos de recorridos sobre árboles y comparaciones entre las versiones recursivas e iterativas.", "CONOZCA", "• La técnica de Complejidad Algorítmica como un método analítico para comparar la eficiencia de algoritmos equivalentes; y se utiliza esta técnica para clasificar los diferentes enfoques y/o métodos de ordenamiento. Para llegar a deducir, por ejemplo, que el algoritmo Quicksort es mucho más eficiente que el Bubble sort.", "APRENDA", "• Patrones que delinean diferentes estrategias de diseño algorítmico: Greedy, Divide & conqueer y Programación dinámica. Finalmente, se estudian los algoritmos que resuelven los problemas típicos sobre grafos: Dijkstra, Prim, Kruskal.", "A QUIÉN VA DIRIGIDO", "Es un libro, conciso, directo, cuidado, que puede servir para dos o tres cursos, según el plan de estudios que se aborde. Proporciona bases en los temas de algoritmos computacionales, estructuras de datos y complejidad computacional. Estos conocimientos contribuyen hacia la meta final en esta área de estudios: la construcción de software de gran calidad."], "price": ["298", "24"]},
{"title": ["Labview - Programación Para Sistemas De Instrumentación"], "description": ["Autores DEL RÍO, Joaquín; SHARIAT-PANAHI, Shahram; SARRIÁ, David; LÁZARO, Antoni Mánuel", "Editorial Alfaomega, Garceta", "Año de edición 2013", "Código de barras 9786077075936", "ISBN 978-607-707-593-6", "Materiales adicionales No", "Número de la edición No", "Número de páginas 350", "Dimensiones 17x23 cms.", "Peso en gramos 530", "Encuadernación Rústica", "Idioma Español", "Estado   Nuevo", "Es un libro en el que explica la metodología para aprender a programar Sistemas de Instrumentación con lenguaje de programación fácil de entender. Este libro está organizado en dos partes, en los primeros cinco capítulos el lector conocerá los componentes que integran LabVIEW, así como algunas estructuras básicas de programación y depuración de Errores. Y en los capitulo siguientes se presentan los sistemas de adquisición de datos y Visión que puede gestionar LabVIEW.", "Ventaja Competitiva", "La estructura del texto es sencilla para comprender temas de diferentes áreas como Adquisición de datos, Procesamiento de Señales, Sistemas de validación y diseño de prototipos.", "Aplicará ejercicios que ayudaran a la comprensión de los temas.", "Conozca", "LabVIEW, como una herramienta potencial de programación dirigida a sistemas de Instrumentación.", "Los sistemas automáticos basados en Virtual Instrument.", "Un nuevo lenguaje de programación diferente a los tradicionales", "Conceptos básicos en los sistemas de adquisición de datos.", "Aprenda", "Programación modular con LabVIEW", "Definir y ejecutar procesamientos de Test a través de LabVIEW", "Programar estructuras iterativas como For Loop y While Loop."], "price": ["298", "29"]},
{"title": ["Destrezas 1 Preescolar (conforme Programa Sep Y Rieb)"], "description": ["-Aprendizaje y desarrollo de habilidades cognitivas perceptivas y motoras-", "64 páginas en blanco y negro", "Tamaño carta", "Pasta rústica grapada", "La serie Destrezas Preescolar asegura que los niños empleen y fortalezcan sus capacidades expresivas y comunicativas a través de actividades.", "Las labores comprenden distinguir figura de fondo, encontrar semejanzas y diferencias, relacionar, asociar y completar dibujos, interpretar relaciones espaciales y comparar intervalos de tiempo."], "price": ["50", "5"]},
{"title": ["Curso De Programación Orientada A Objetos En C# .net"], "description": ["Autores LÓPEZ TAKEYAS, Bruno", "Editorial Alfaomega", "Año de edición 2016", "Código de barras 9786076226599", "ISBN 978-607-622-659-9", "Materiales adicionales No", "Número de la edición 1", "Número de páginas 440", "Dimensiones 17x23 cms.", "Peso en gramos 490", "Encuadernación Rústica", "Idioma Español", "Estado   Nuevo", "El libro es un extenso manual acerca de diferentes metodologías para la resolución de problemas a través de la computadora mediante la efectividad al codificar, programar y diseñar herramientas; mediante ejemplos de la vida cotidiana que pueden ser modelados por paradigmas orientados a objetos. Expone los fundamentos de la programación orientada a objetos de sistemas, que son útiles para incrementar la productividad y eficacia en la resolución de problemas. Así mismo, incluye una aplicación práctica, sencilla y completa en modo consola, utilizando el lenguaje de programación C# .NET y además cuenta con una aplicación práctica mediante un programa en modo gráfico que utiliza formas (formularios) en C# .NET.", "A QUIEN VA DIRIGIDO", "Está dirigido a profesores y estudiantes de los cursos de Programación Orientada a Objetos (POO) y en general a profesionistas e interesados en la actualización del paradigma de diseño e implementación de sistemas computacionales."], "price": ["398", "39"]},
{"title": ["Metodología De La Programación Orientada A Objetos"], "description": ["Autores LÓPEZ, Leobardo", "Editorial Alfaomega", "Año de edición 2013", "Código de barras 9786077075899", "ISBN 978-607-707-5899", "Materiales adicionales Para el estudiante", "Número de la edición 2", "Número de páginas 564", "Dimensiones 21x24 cms.", "Peso en gramos 1107", "Encuadernación Rústica", "Idioma Español", "Estado   Nuevo", "Este libro es fundamental para asimilar la Programación Orientada a Objetos, paso a paso incrementa su nivel de dificultad y que presenta numerosos ejemplos explicados detalladamente, ejercicios resueltos y ejercicios propuestos, puede ser utilizado en materias de programación de computadoras que se cursan en los primeros dos o tres semestres de carreras que incluyan programación en su plan de estudios, también puede usarse, por cualquier lector autodidacta para aprender a programar.", "Desarrolla una metodología para aprender a programar mediante un seudo lenguaje, explica los conceptos necesarios para entender la programación orientada a objetos y el desarrollo de la lógica necesaria para solucionar problemas en forma algorítmica. Al final de su estudio el lector podrá comprender el manejo de cualquier lenguaje orientado a objetos como Java, UML y muchos otros.", "La primera parte da énfasis al desarrollo de la lógica básica de la programación usando un pseudo lenguaje. Se estudian los tipos de datos, identificadores, operaciones de entrada, cálculo y salida; usando las estructuras de control: la secuenciación; la selección simple (IF THEN), doble (IF THEN ELSE) y múltiple (SWITCH); la repetición DO WHILE, la repetición FOR y la repetición WHILE; además, se estudia cómo usar más de un método en la clase, en problemas que involucran a más de una tarea o función, métodos que no regresan valor entre otras cosas. La segunda parte aborda los conceptos de la programación orientada a objetos, integrándolos con el concepto de diagrama de clases de UML (Unified Modeling Language), con la arquitectura modelo vista-controlador, con las estructuras estudiadas en los primeros nueve capítulos y la incorporación de los conceptos de la programación orientada a objetos en la técnica seudocódigo, logrando una metodología de la programación que permite diseñar algoritmos orientados a objetos.", "Ventaja Competitiva:", "Incluye en la Web programas que implementan los algoritmos desarrollados en el libro.", "En cada capítulo encontrará listado el contenido, objetivos, competencias, ejemplos desarrollados paso a paso, explicaciones, notas, prácticas de ejercicios resueltos, ejercicios propuestos y resúmenes.", "En la web del libro se encuentran:", "Autoevaluación para el alumno", "Mapa conceptual del capitulo", "Presentaciones en Power Point para el profesor", "Conozca:", "Los conceptos principales del paradigma de programación orientado a objetos y aplicarlos a situaciones de la vida real.", "Aprenda:", "Cómo describir y modelar los conceptos del paradigma de programación orientado a objetos.", "Cómo aplicarlos los conceptos del paradigma de programación orientado a objetos a situaciones de la vida real.", "Cómo sobrecargar métodos y operadores para optimizar el código de una clase.", "Cómo identificar, manejar, gestionar y crear las condiciones de error que interrumpan el flujo normal de ejecución de un programa.", "Realice:", "La Implementación de clases y objetos cumpliendo las reglas de la programación orientada a objetos.", "La Implementación de constructores y destructores para inicializar atributos y liberar recursos.", "La Implementación de la herencia en clases derivadas para reutilizar los miembros de una clase base.", "La Implementación de interfaces y clases polimórficas.", "Aplicaciones orientadas a objetos que creen y manipulen archivos para guardar y recuperar información."], "price": ["448", "44"]},
{"title": ["Control Numérico Y Programación Ii - Curso Práctico"], "description": ["Autores CRUZ, Francisco", "Editorial Alfaomega, Marcombo", "Año de edición 2011", "Código de barras 9786077686569", "ISBN 978-607-7686-56-9", "Materiales adicionales No", "Número de la edición 2", "Número de páginas 424", "Dimensiones 21x24 cms.", "Peso en gramos 1000", "Encuadernación Rústica", "Idioma Español", "Estado Nuevo", "Esta nueva versión está enfocada íntegramente en el control FAGOR 8055 pero mantiene también la programación del 8025 y además incorpora un apéndice de actualización del control 8070. El libro está enfocado al aprendizaje, consulta y actualización de la programación en control numérico general basado en el sistema ISO, sirviendo de base para todas las máquinas CNC.", "Se ha actualizado el tratamiento de los sistemas de coordenadas y de las estructuras de programación, así como los capítulos de información general del control numérico que sirven de forma genérica para todos los sistemas. Todos los controles ISO tienen estructuras comunes en su forma básica, por lo que todo lo aquí expuesto puede ser válido como estructura general.", "Ventajas Competitivas", "La programación sigue una estructura didáctica de fácil comprensión para el lector, creciendo la dificultad del aprendizaje de forma progresiva y no siguiendo una estructura numérica de las diferentes órdenes de programación, lo que le da una estructura de curso práctico.", "Cada instrucción presenta, para una fácil comprensión, los siguientes apartados: Descripción, Formato, Parámetros, Operativa, Ejemplo, Programa y Comentario al ejemplo. Todas las órdenes estudiadas contienen ejemplos perfectamente detallados y comentados línea a línea.", "Ayuda a los nuevos profesionales en su formación inicial y a los técnicos facilitarles una herramienta de consulta y actualización.", "Conozca", "Las ventajas que ofrece una máquina CNC en relación a los sistemas de fabricación manuales.", "La ubicación y denominación de los diferentes puntos de referencia y orígenes necesarios en una máquina CNC, así como la utilidad de los mismos y su cálculo si procede.", "Las técnicas necesarias para programar máquinas herramienta de control numérico.", "Las características fundamentales de las máquinas herramientas de control numérico.", "La programación de las máquinas herramientas de control numérico en el sistema normalizado ISO de programación.", "Aprenda", "Cómo aplicar parámetros de corte para máquinas herramientas de control numérico.", "Cómo aplicar los ciclos fijos de mecanizado.", "Los modos de asignar los datos necesarios para gestionar el uso de las herramientas implicadas en el proceso, y especialmente el por qué del requerimiento de dichos datos y el modo de introducción de los mismos.", "Realice", "Programación de control numérico mediante la utilización en sistema ISO.", "Ejercicios de torneado y fresado punto a punto y con ciclos fijos.", "Aplicación de subrutinas.", "Programación paramétrica."], "price": ["438", "43"]},
{"title": ["Aplicaciones Vba Con Excel"], "description": ["Autores TORRES REMON, Manuel", "Editorial Alfaomega, Macro", "Año de edición 2016", "Código de barras 9786123042653", "ISBN 978-612-304-265-3", "Número de la edición 1", "Número de páginas 344", "Dimensiones 17x23 cms.", "Peso en gramos 480", "Encuadernación Rústica", "Idioma Español", "Estado  Nuevo", "Visual Basic for Applications (VBA) es un programa del lenguaje de Visual Basic que permite ampliar la funcionalidad de los programas de la suite de Microsoft Office. Esta herramienta hace más conveniente el uso de Excel y nos ayuda a tomar ventajas de opciones que no pueden ser accesibles con las funciones y procedimientos habituales de Excel.", "El presente material tiene como objetivo ayudar a crear aplicaciones usando el lenguaje VBA de Excel. Además, contiene casos prácticos debidamente desarrollados enfocados en los diferentes ámbitos empresariales y profesionales.", "A lo largo del libro se desarrolla el estudio de los objetos VBA, las nociones fundamentales de programación (donde se explica cómo analizar problemas, crear códigos y procedimientos), la gestión de errores, la implementación y manejo de las estructuras condicionales y de repetición, y el uso de la base de datos de Access y del propio Excel. Todo esto con la finalidad de que pueda implementar aplicaciones con datos masivos que permitan a cualquier usuario acceder fácilmente a través del entorno Excel.", "Este libro está dirigido a estudiantes de Informática que se inician en programación y a quienes deseen encontrar soluciones prácticas a casos empresariales.", "Ventajas", "La presente obra cuenta con material de la plataforma de contenidos interactivos del libro: Aplicaciones VBA con Excel."], "price": ["537", "53"]},
{"title": ["El Arte De Decir No (n.e.), Un Programa De Ejercicios Para A"], "description": ["Basta Ya De Titubear, Aprende A Decir No, Gracias A Este Libro Conseguirás En Poco Tiempo Resultados Sorprendentes: Un No Pronunciado A Tiempo Evita Malentendidos, Discusiones, Estrés Y Mal Humor. Además De Esclarecer Las Cosas, Facilita Un Mejor Entendimiento Entre Las Personas, Generando Confianza Y Aceptación. Con Unas Cuantas Técnicas, Consejos Y Trucos Harás Tu Vida Más Fácil, Serás Más Respetado Y Nadie Volverá A Aprovecharse De Ti.", "** MÉTODOS DE ENVÍO", "Estimado lector el tiempo de entrega es de 3 a 7 días hábiles a través de Mercado Envíos.", "No es necesario preguntar por disponibilidad."], "price": ["275", "206", "20"]},
{"title": ["Programa Educativo Nuevo Milenio 22 Vols/ 5 Cd-roms Y 10 Dvd"], "description": ["Compra online la colección Programa Educativo Nuevo Milenio 22 Vols con 5 CD-ROMs y 10 DVDs de Ediciones Credimar; disponible en Royce Editores, la mejor y más grande librería de diccionarios y enciclopedias en México.", "TOMO 1: ENCICLOPEDIA UNIVERSAL.", "TOMO 2: ENCICLOPEDIA UNIVERSAL.", "TOMO 3: ENCICLOPEDIA UNIVERSAL.", "TOMO 4: ENCICLOPEDIA UNIVERSAL.", "TOMO 5: ENCICLOPEDIA UNIVERSAL.", "TOMO 6: ENCICLOPEDIA UNIVERSAL.", "TOMO 7: ENCICLOPEDIA DE MÉXICO.", "TOMO 8: ENCICLOPEDIA DE MÉXICO.", "TOMO 9: ENCICLOPEDIA DE MÉXICO.", "TOMO 10: ENCICLOPEDIA DE MÉXICO.", "TOMO 11: ENCICLOPEDIA DE MÉXICO.", "TOMO 12: ENCICLOPEDIA DE MÉXICO.", "TOMO 13: DICCIONARIO ENCICLOPÉDICO.", "TOMO 14: DICCIONARIO ENCICLOPÉDICO.", "TOMO 15: DICCIONARIO ENCICLOPÉDICO.", "TOMO 16: DICCIONARIO ENCICLOPÉDICO.", "TOMO 17: DICCIONARIO ENCICLOPÉDICO.", "TOMO 18: DICCIONARIO DE BIOGRAFÍAS.", "TOMO 19: DICCIONARIO DE BIOGRAFÍAS.", "TOMO 20: DICCIONARIO DE BIOGRAFÍAS.", "TOMO 21: DICCIONARIO DE BIOGRAFÍAS.", "TOMO 22: DICCIONARIO DE BIOGRAFÍAS.", "CD-ROM: EL JUEGO DEL SABER.", "CD-ROM: ENCICLOPEDIA DE LA CIENCIA Y LA TECNOLOGÍA.", "CD-ROM: LOS NOMBRES Y LOS HECHOS DE MÉXICO.", "CD-ROM: MULTIDICCIONARIO.", "CD-ROM: DICCIONARIO DE LITERATURA.", "DVD 1: EL ÁTOMO.", "DVD 2: LA CÉLULA.", "DVD 3: LA LUZ Y LA ENERGÍA.", "DVD 4: LAS FUERZAS DE LA MATERIA.", "DVD 5: LA BIODIVERSIDAD.", "DVD 6: EL CUERPO HUMANO.", "DVD 7: LA TIERRA.", "DVD 8: LA NATURALEZA.", "DVD 9: LOS ECOSISTEMAS.", "DVD 10: EL UNIVERSO.", "=====================", "FICHA TÉCNICA:", "=====================", "— Veintidós libros impresos", "— Formato 22 x 29 x 57 cm", "— 5.012 páginas impresas a todo color", "— Fina encuadernación en tapa dura", "— Edición 2006", "— © Ediciones Credimar", "— Programa Educativo Nacional"], "price": ["9,990", "832"]},
{"title": ["Sanar El Trauma. Un Programa Pionero Para Restaurar"], "description": ["Recientes investigaciones han demostrado que con frecuencia los supervivientes de accidentes, desastres o traumas infantiles soportan síntomas a lo largo de su vida que pueden ir desde ansiedad y depresión hasta dolor físico inexplicado, cansancio, distintas enfermedades y comportamientos dañinos. Actualmente, tanto los profesionales como los clientes del trabajo corporal y de la psicoterapia está apoyándose en el método innovador Somatic Experiencing, diseñado por el doctor Peter Levine, para superar eficazmente dichas patologías. En Sanar el trauma, el doctor Levine te ofrece una guía personal pormenorizada para emplear la teoría que introdujo originalmente en su prestigioso trabajo Waking the Tiger (Curar el trauma), y ahora podrás seguir sus pasos con el fin de sanar tus traumas al «revisitarlos» en vez de revivirlos. Incluye un CD con 12 ejercicios guiados de Somatic Experiencing®"], "price": ["420", "42"]},
{"title": ["Libro Diseño De Algoritmos Y Su Programación En C"], "description": ["Autores MÉNDEZ GIRÓN, Alejandra", "Editorial Alfaomega", "Año de edición 2013", "Código de barras 9786077076018", "ISBN 978-607-7076-018", "Materiales adicionales No", "Número de la edición No", "Número de páginas 300", "Dimensiones 17x23 cms.", "Peso en gramos 456", "Encuadernación Rústica", "Idioma Español", "La presente obra representa una herramienta de estudio para el diseño de algoritmos y su traducción a lenguaje C. Explica las técnicas básicas para el diseño de algoritmos que todo programador debe seleccionar y adoptar en un momento de su trayectoria, ya sea en el ámbito escolar o profesional. Este libro no está limitado a su lectura por estudiantes de informática o computación, ya que es aplicable a cualquier profesión donde sus planes de estudio contemplen la asignatura de programación.", "Destaca por", "Su diseño, que contempla conceptos universales", "Estar escrito de lo más simple a lo más complejo.", "Incluir técnicas de programación estructurada para el diseño de algoritmos.", "Conozca", "Las instrucciones en Lenguaje C.", "Los temas de arreglos unidimensionales y bidimensionales.", "El concepto de archivos y su implementación en lenguaje C.", "Aprenda", "Técnicas auxiliares como la identación, modularidad y segmentación.", "El diseño Top Down.", "A elaborar diagramas de flujo (como complemento de documentación de los algoritmos más que como herramienta de diseño).", "Realice", "La traducción de un algoritmo.", "Diseñar sus propias librerías o bibliotecas, con la finalidad de construir sus propias herramientas para programar y dar paso a la segmentación de aplicaciones.", "____________________________________________________", "CAMBIOS Y DEVOLUCIONES", "- Si necesita hacer una devolución, no se preocupe, podrá hacerlo sin ningún inconveniente.", "- Nos podrá contactar a través del chat interno que ofrece Mercado Libre.", "- Nosotros le indicaremos los pasos a seguir para que pueda devolver el producto.", "ENVÍOS", "- Nos encargaremos de despachar su producto en cuanto su pedido este confirmado.", "- Mercado Libre le enviará un aviso de que su compra ya esta en camino.", "- Envíos a toda la República Mexicana.", "ELECCIÓN CORRECTA", "Es importante que revise los datos exactos de su libro (Título, Autor, ISBN y Editorial) para asegurarse de estar eligiendo el producto adecuado.", "HORARIOS DE ATENCION PERSONALIZADO", "De Lunes a Domingo, de 9 am a 9 pm.", "PREGUNTAS FRECUENTES", "¿Son productos originales y nuevos?", "Si, todos nuestros productos son 100% originales y nuevos.", "¿Hacen factura?", "Si facturamos (Pedirla en un máximo de 24 hrs. a partir de su compra).", "¿Tenemos garantía en nuestros productos?", "Si, todos nuestros productos cuentan con garantía.", "¿Se puede retirar los productos en tiendas?", "No, solo se realizan envíos vía mensajería al cliente.", "¿Hay disponibilidad?", "Si la publicación se encuentra activa, es que aun tenemos disponibilidad para usted.", "PRODUCTO ENVIADO POR MERCADO FULL", "Su compra será enviada de forma inmediata y segura. Se envía desde la bodega de Mercado Libre, con la garantía de que el artículo va protegido para que lo reciba lo más rápido y en perfecto estado.", "ATENCIÓN AL CLIENTE DE LA MÁS ALTA CALIDAD", "Al recibir su producto nos podrá escribir para cualquier duda o necesidad desde la sección de mensajes de Mercado Libre.", "Siempre estaremos al pendiente para brindarte un servicio de calidad y atención personalizada.", "FORMAS DE PAGO", "- A través de Mercado Pago.", "- Con tarjeta de crédito o débito VISA, MasterCard o American Express (a través de Mercado Pago).", "- En efectivo en OXXO y 7-eleven.", "- Depósitos en ventanilla de Banamex, BBVA y Santander.", "- Saldo en Mercado Pago.", "COMPRA 100% SEGURA.", "NO DUDE MÁS Y HAGA SU COMPRA."], "price": ["298", "29"]},
{"title": ["Desarrollo De Aplicaciones C# Con Visual Studio .net"], "description": ["Autores ORBEGOZO ARANA, Borja", "Editorial Alfaomega, Altaria Editorial", "Año de edición 2015", "Código de barras 9786076222201", "ISBN 978-607-622-220-1", "Materiales adicionales No", "Número de la edición 1", "Número de páginas 284", "Dimensiones 17x23 cms.", "Peso en gramos 443", "Encuadernación Rústica", "Idioma Español", "Estado   Nuevo", "El libro va dirigido a cualquier usuario con conocimientos básicos o nulos sobre programación y que desee ampliarlos o adquirirlos. También va dirigido a quienes deseen aprender a diseñar aplicaciones de escritorio a partir de los problemas reales que se deseen solucionar.", "Es un manual sencillo de seguir y con mucha parte práctica, de manera que sirva como herramienta tanto para fines académicos como productivos, imprescindible en academias y centros de formación, así como para usuarios autodidactas.", "Ventajas", "El contenido del libro es lo más didáctico posible, para que el lector pueda hacer pruebas en su propio equipo mientras progresa en la lectura.", "Contiene muchas imágenes y mucho código fuente para facilitar más la lectura y el aprendizaje, haciéndolo más ameno.", "Al final del libro se encuentran los ejemplos prácticos más importantes y las soluciones a todos los ejercicios planteados en los diferentes capítulos.", "Conozca", "La Programación orientada a objetos, Programación base, Programación gráfica.", "Realice", "Proyectos completos de programación", "Instalación de aplicaciones"], "price": ["248", "20"]},
{"title": ["R En Profundidad - Programacion, Graficos Y Estadistica"], "description": ["Te ofrecemos la mejor selección de libros, en nuestro catálogo encontrarás los mejores libros de literatura, ensayo, política, historia, además de libros infantiles, juveniles e ilustrados; y parte de nuestra selección de accesorios.", "También, podrás encontrar mandalas para relajarte, libros de pasatiempos, deportes, música y demás actividades.", "** MÉTODOS DE ENVÍO", "Estimado lector el tiempo de entrega es de 3 a 7 días hábiles a través de Mercado Envíos.", "No es necesario preguntar por disponibilidad."], "price": ["398", "378", "37"]},
{"title": ["Programación De Microcontroladores Pic - Alfa 86842"], "description": ["LIBRO FÍSICO - NUEVO - ORIGINAL - TEXTO COMPLETO", "edición 2017, páginas 220", "El presente libro es una guía práctica para estudiantes de ingeniería y personas que deseen elaborar un diseño electrónico utilizando sistemas de microcontroladores de 8 bits. El lenguaje C es un lenguaje de programación muy eficiente para sistemas embebidos y es en la actualidad el más usado, se aplica en comunicaciones, automoción, audio, periféricos de ordenadores, equipos de consumo, procesamiento de imagen, control de motores, robótica, instrumentación industrial, etc.", "Aquí se exponen primeramente los esquemas de programación en C y posteriormente se utilizan en los proyectos de diseño con el microcontrolador PIC. Asimismo, se practican funciones que permiten un uso sencillo de los periféricos disponibles en el microcontrolador. En este documento se utiliza el compilador de C de microchip y el microprocesador PIC16F877A, sin embargo, los conceptos y ejercicios tienen validez para cualquier compilador y plataforma con sólo algunos cambios ligeros.", "VENTAJAS", "• La metodología que se utiliza en este libro permite dar seguimiento a los ejemplos con base en los conocimientos básicos de programación explicados en los primeros capítulos y no es necesario utilizar hardware o elementos adicionales.", "• A lo largo del libro aparecen múltiples figuras que guían paso a paso cada uno de los ejemplos propuestos.", "CONOZCA", "• El funcionamiento de los puertos de entrada y salida digitales.", "• En qué consisten los módulos de captura, de comparación, y la modulación de anchura de pulsos.", "• Cómo usar un sensor de temperatura TC1047A.", "APRENDA", "• A utilizar los diferentes tipos de temporizadores.", "• A generar una señal analógica utilizando un módulo generador de tensión de referencia.", "• A comparar señales analógicas usando el módulo comparador de tensión analógica.", "DESARROLLE SUS HABILIDADES PARA", "• Realizar una conversión analógica digital de varios canales.", "• Manejar los módulos de comunicación USART (Universal Synchronous Asynchronous Receiver Transmitter) y MSSP (Master Synchronous Serial Port).", "• Utilizar la memoria interna EEPROM.", "A QUIÉN VA DIRIGIDO", "Esta publicación está dirigida principalmente a estudiantes de ingeniería, pero también a los interesados en aprender a programar los microcontroladores PIC con el lenguaje C para dispositivos sensores y actuadores."], "price": ["340", "34"]},
{"title": ["Programación Orientada A Objetos En Java"], "description": ["PRODUCTO:", "Nombre: Programación Orientada a Objetos en JAVA", "Marca: RA-MA Editorial", "DESCRIPCIÓN:", "El objetivo principal de este libro es presentar al lector los fundamentos de la Programación Orientada a Objetos. Focalizamos la atención en conceptos como el encapsulamiento, la herencia, el polimorfismo, composición, delegación, clases envoltorio, reflection, genéricos, lanzamiento, intercepción, tratamiento de excepciones, etc._x000D_", "_x000D_", "Se ha escogido Java como medio en que implementar dichos conceptos por ser el máximo exponente de la Orientación a Objetos; por su purismo, por su trayectoria y por su expansión._x000D_", "_x000D_", "Se incluyen múltiples ejemplos de aplicaciones Java, todos ellos cuidadosamente elaborados y especialmente dirigidos a facilitar la comprensión del concepto que se aborda en cada momento, así como numerosos gráficos en que se representan los datos, objetos, y métodos que intervienen en cada ejemplo._x000D_", "Se ha intentado establecer en cada tema una progresión en el nivel de complejidad,_x000D_", "planteando en primer lugar programas breves y sintéticos para posteriormente presentar_x000D_", "aplicaciones de mayor extensión para ayudar al lector a integrar dichos conceptos la realidad productiva._x000D_", "Adicionalmente, se incluyen temas específicos en que se exponen los mecanismos a utilizar para, desde una aplicación Java:_x000D_", "_x000D_", "Generar y gestionar archivos PDF_x000D_", "Gestionar archivos XML_x000D_", "Enviar y leer emails_x000D_", "_x000D_", "El libro contiene material adicional, descargable desde la web del libro, con todos los ejemplos de aplicaciones para una mejor comprensión y aprendizaje de los temas tratados._x000D_", "MÁS DETALLES:", "Peso del paquete: 1 kg", "Meses de garantía: 1", "Garantía: Por defectos de fabricación.", "Condición: Nuevo", "Encuadernado: Pasta blanda", "Editorial: RA-MA Editorial", "Titulo del libro: Programación Orientada a Objetos en JAVA", "Autor: Blasco, Francisco", "Idioma: Español", "Edición: 1", "Editor: RA-MA Editorial", "Número de páginas: 588", "ISBN-13: 9788499648057", "SKU: 9788499648057", ""], "price": ["890", "89"]},
{"title": ["Fundamentos De Programacion"], "description": ["Sinopsis no disponible", "FUNDAMENTOS DE PROGRAMACION *MÉTODOS DE ENVÍO", "Estimado lector el tiempo de entrega es de 3 a 7 días hábiles a través de Mercado Envíos.", "No es necesario preguntar por disponibilidad."], "price": ["699", "664", "66"]},
{"title": ["Libro Modificación De Conductas Problema En El Niño Programa"], "description": ["LIBROS EN CIENCIAS MÉDICAS - \"ENVIO GRATIS\"", "TENEMOS UN AMPLIO SURTIDO DE LIBROS DE TODAS LAS ESPECIALIDADES MÉDICAS", "¿NECESITA ALGÚN LIBRO? NOSOTROS SE LO CONSEGUIMOS!!!!", "CONTENIDO:", "* Primera parte.", "- Elaboración del paquete de servicio", "- Reorientemos las técnicas de", "modificación conductual hacia los", "principios de la integración", "educativa", "- Construcción de los instrumentos de", "diagnósticos", "- El paquete de tratamiento y el", "paquete de servicio", "* Segunda parte.", "- Paquete de servicio", "- Instructivo general para el uso del", "paquete de servicio", "- Paquete de tratamiento", "Este libro expone de manera clara y precisa los principales aspectos teóricos, metodológicos y prácticas para la evaluación de conductas problema. Asimismo, proporciona los lineamientos, criterios y habilidades para que el mediador, que puede ser un psicólogo especializado, un padre de familia o un médico, pueda detectar y resolver problemas de comportamiento en menores."], "price": ["449", "45"]},
{"title": ["Excel 2019  365"], "description": ["Autores YESCAS, Leonel; MONSALVE, Liz", "Editorial Alfaomega, Altaria Editorial", "Año de edición 2019", "Código de barras 9786075384450", "ISBN 978-607-538-445-0", "Materiales adicionales No", "Número de la edición 1", "Número de páginas 344", "Dimensiones 16.8 x 23 cms", "Peso en gramos 369", "Encuadernación Rústica", "Idioma Español", "Estado   Nuevo", "Esta es una publicación escrita de una manera sencilla y dinámica que facilita el aprendizaje de uno de los softwares más utilizados en la paquetería de Office. Para un funcionamiento óptimo de Excel es necesario un manejo adecuado de éste, donde se aproveche al máximo todas las prestaciones que ofrece; es así que los autores ponderaron una didáctica donde se estableciera una comunicación fluida con el lector.", "Este libro expone de manera amigable el uso de las herramientas que permiten trabajar con la nueva versión: Excel 2019. De este modo, el lector adquirirá una experiencia agradable al resolver problemas relacionados con el uso de este software al mismo tiempo que explota todo su potencial. El orden de su contenido está dispuesto de menor a mayor complejidad, hasta llegar a la realización de funciones complejas como resolver problemas lineales, crear tablas dinámicas utilizando herramientas de análisis y previsiones de datos, así como crear y manejar gráficos que representen información o importar datos de fuentes externas y actualizarlas.", "VENTAJAS", "• Cada uno de los capítulos cuenta con una serie de ejercicios en donde se usan los conocimientos adquiridos.", "• Al final del libro aparece un capítulo dedicado a las prácticas para que el lector aplique la lógica y encuentre las soluciones adecuadas.", "• La comunicación que establece el autor con sus lectores es clara y directa, de modo que se crea un ambiente de confianza que da como resultado un aprendizaje más completo.", "CONOZCA", "• Las novedades integradas en Excel 2019 con respecto a la versión anterior.", "• Las funciones de cada uno de los elementos que conforman la pantalla de inicio y la ventana principal de Excel 2019.", "• Los distintos tipos de formatos y estilos que pueden aplicarse a los rangos, tablas y celdas del entorno de trabajo.", "• Cómo crear y utilizar macros en Excel.", "APRENDA", "• A utilizar las herramientas necesarias para trabajar con hojas y celdas.", "• A dar formato a las celdas para organizar, identificar y entender mejor los datos de las tablas y hojas.", "• A emplear gráficos en la representación de datos para una mejor proyección y entendimiento de éstos.", "• A realizar conexiones de datos dentro de un libro de Excel para obtener información de varias fuentes externas, así como para exportar los datos del libro de trabajo.", "• A utilizar las herramientas de análisis de datos que ofrece Excel para resolver problemas complejos.", "DESARROLLE SUS HABILIDADES PARA", "• Utilizar las prestaciones para hojas de cálculo y libros que ofrece Excel 2019.", "• Resolver problemas matemáticos mediante el uso de fórmulas y rangos de Excel.", "• Crear hojas de gráficos o gráficos incrustados para optimizar el manejo de la información.", "• Generar y utilizar tablas dinámicas para obtener informes de una manera más detallada y simple.", "A QUIÉN VA DIRIGIDO", "El presente documento está dirigido principalmente a personas autodidactas que deseen aprender las nuevas herramientas de Excel 2019 para la resolución de problemas de la vida cotidiana y laboral. Asimismo, también está pensado para centros o instituciones educativas que brinden información actualizada y veraz que sirva a los estudiantes como base para desempeñarse de forma eficiente"], "price": ["328", "32"]},
{"title": ["Matemáticas Para Preescolar/ 1º, 2º Y 3º/ Paquete De Los 3."], "description": ["\"EL ENCUENTRO\" REVISTAS, CÓMICS, PUBLICACIONES ATRASADAS Y LIBROS NUEVOS, VIEJOS, USADOS, DESCONTINUADOS Y LITERATURA INFANTIL, DIDÁCTICOS Y DESTREZA MENTAL.", "- Paquete especial de manuales de educación matemática para preescolares, con ejercicios para el desarrollo intelectual y capacidad motriz de los niños", "- De 21X27 cms.", "- De entre 60 y 64 páginas.", "- Lea índice de contenido.", "- Envío a domicilio, de cualquier parte del país, A CARGO DEL COMPRADOR y, si lo prefiere, a meses sin interés con tarjeta de crédito.", "SI BUSCA ALGÚN OTRO LIBRO O REVISTA EN ESPECIAL, PREGUNTE, CON GUSTO SE LE ATIENDE.", "-"], "price": ["179", "14"]},
{"title": ["Fundamentos De Programación"], "description": ["Autores JIMÉNEZ, José; JIMENEZ, Eréndira Miriam; ALVARADO, Laura Nelly", "Editorial Alfaomega", "Año de edición 2014", "Código de barras 9786076222027", "ISBN 978-607-622-202-7", "Materiales adicionales De libre acceso", "Número de la edición 1", "Número de páginas 432", "Dimensiones 17x23 cms.", "Peso en gramos 640", "Encuadernación Rústica", "Idioma Español", "Estado   Nuevo", "Esta obra está pensada para ayudar a las personas que comienzan una carrera en el área de la computación. Busca desarrollar la lógica de programación del lector usando diferentes maneras de representar los algoritmos y resolviendo problemas interesantes para ilustrar y explicar cada uno de los conceptos o instrucciones de los lenguajes de programación, plantea problemas que obligarán a la persona a pensar y ser creativa para resolverlos.", "Ventaja competitiva", "Explica cómo plantear un algoritmo en Pseudocódigo, Diagramas Nassi-Shneiderman (N-S) y Diagramas de Flujo para analizar problemas y diseñar soluciones.", "Informa sobre los elementos, estructuras y sintaxis del lenguaje de programación Java.", "Introduce a los paradigmas de Programación Orientado a Objetos y de la Programación Gráfica.", "Conozca", "Las palabras y conceptos propios del área.", "La estructura básica de un programa en Java.", "Las estructuras de control.", "Aprenda", "Cómo gestionar sus proyectos.", "Cómo utilizar el lenguaje de programación Java para el diseño de programas.", "Realice", "El análisis de problemas y su representación.", "Arreglos para presentar las propiedades y restricciones de estructuras que permitan guardar y procesar gran cantidad información.", "Programas más amigables, a través de la programación gráfica."], "price": ["398", "39"]},
{"title": ["Libro Microcontrolador Pic16f84 Desarrollo De Proyectos Pic"], "description": ["!! ENVIO GRATIS POR MERCADO ENVIOS ( DHL, FEDEX, ESTAFETA ) !!", "* SI REQUIERES FACTURA, TAMBIEN PODEMOS FACTURAR *", "Aprende a programar a los Microcontroladores PIC de Microchip en Lenguaje ASM, con este Excelente Libro !, ademas aprenderas a manejar un sin fin de Perifericos: LCD's, Motores a Paso, Servomotores, Sensores, y muchos mas.", "Si eres principiante, o apenas estas empezando con el mundo de los Microcontroladores, este libro es el ideal. NO POR NADA ESTE LIBRO YA VA EN SU TERCERA EDICION, ES EL MAS VENDIDO.", "Esta completamente en ESPAÑOL, incluye un CD con ejemplos y ejercicios del Libro.", "", "Resumen Del Contenido:", "Este libro introduce al lector en el desarrollo de proyectos de circuitos electrónicos construidos con el popular microcontrolador PIC16F84.", "Es una obra de extraordinaria utilidad para estudiantes que desean realizar sus primeros proyectos de circuitos electrónicos. Contiene más de 200 ejercicios, esquemas y conceptos teóricos, como la realización de termómetros, relojes, calendarios, cerraduras electrónicas, control de displays, termostatos, temporizadores, alarmas, sirenas, comunicación con la computadora, juegos, control de motores, micro robots, entre muchos otros.", "El software utilizado es de distribución libre y los circuitos emplean componentes que se pueden adquirir fácilmente. Cada proyecto es desarrollado paso a paso.", "Ventajas Competitivas:", "Dispone de su propia página Web que es un lugar de encuentro entre todos aquellos que utilicen el libro, y donde podrán intercambiar ideas, realizar consultas, descargar actualizaciones de los proyectos, apuntes de los conocimientos previos necesarios, así como el esquema de todos los ejercicios para poder comprobarlos con el popular simulador software PROTEUS.", "En la tercera edición de este libro se ha actualizado a las últimas versiones del software utilizado bajo el sistema operativo Windows Vista, como son la última versión del MPLAB IDE y la herramienta software de grabación WinPic800.", "Se han añadido nuevos ejercicios, se explican nuevos procedimientos de grabación para puertos USB y se facilita la simulación de los ejercicios mediante la herramienta software PROTEUS.", "El CD-ROM que acompaña al libro se ha renovado con toda esta nueva información y contiene el software necesario, ejercicios y notas técnicas.", "Conozca:", "Las Características básicas de los microcontroladores.", "Las diferentes arquitecturas de microcontroladores, su capacidad de entrada/salida y circuitería electrónica asociada.", "La importancia que tienen los microcontroladores PIC 16F84A.", "Aprenda:", "El uso y programación de los microcontroladores PIC 16F84A.", "Como reducir el costo para el sistema.", "Como reducir tiempo de desarrollo de todo el sistema.", "Realice:", "Modificaciones constantes a su sistema.", "Proyectos de circuitos electrónicos construidos con el microcontrolador PIC16F84.", "Diseñe e implemente circuitos basados en microcontroladores.", "Aumente:", "Su productividad y competencia en el diseño de dispositivos controladores digitales.", "Su creatividad y su capacidad de análisis y síntesis para el desarrollo de proyectos con elementos digitales.", "Su autoestima al comprobar que lo que ha creado funciona y que realiza la tarea para la que fue ideado.", "Autores: Enrique Palacios, Fernando Remiro, Lucas J. Lopez.", "Formato: Impreso / Fisico.", "Idioma: Español.", "652 págs. Rústica , 17x23 cms.", "ISBN: 978-607-7686-37-8.", "Coedición: Alfaomega, Ra-Ma.", "Peso: 985 grs.", "Edicion: 3'ra Edicion."], "price": ["569", "57"]}
]